#ವ್ಯಾಖ್ಯಾನಿತವಾಗದಿದ್ದರೆ ACTIVATIONS_H
#ವ್ಯಾಖ್ಯಾನಿಸು ACTIVATIONS_H
#ಅನ್ತರ್ಭಾವ "darknet.h"
#ಅನ್ತರ್ಭಾವ "cuda.h"
#ಅನ್ತರ್ಭಾವ "math.h"

ACTIVATION get_activation(ಅಕ್ಷರ *s);

ಅಕ್ಷರ *get_activation_string(ACTIVATION a);
ದಶಮಾಂಶ activate(ದಶಮಾಂಶ x, ACTIVATION a);
ದಶಮಾಂಶ gradient(ದಶಮಾಂಶ x, ACTIVATION a);
ಶೂನ್ಯ gradient_array(ಸ್ಥಿರಾಂಕ ದಶಮಾಂಶ *x, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ n, ಸ್ಥಿರಾಂಕ ACTIVATION a, ದಶಮಾಂಶ *delta);
ಶೂನ್ಯ activate_array(ದಶಮಾಂಶ *x, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ n, ಸ್ಥಿರಾಂಕ ACTIVATION a);
#ವ್ಯಾಖ್ಯಾನಿತವಾದರೆ GPU
ಶೂನ್ಯ activate_array_gpu(ದಶಮಾಂಶ *x, ಪೂರ್ಣಾಂಕ n, ACTIVATION a);
ಶೂನ್ಯ gradient_array_gpu(ದಶಮಾಂಶ *x, ಪೂರ್ಣಾಂಕ n, ACTIVATION a, ದಶಮಾಂಶ *delta);
#ಆದರೆ_ಅಂತ್ಯ

ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ stair_activate(ದಶಮಾಂಶ x)
{
    ಪೂರ್ಣಾಂಕ n = floor(x);
    ಆದರೆ (n%2 == 0) ಹಿಂತಿರುಗಿ floor(x/2.);
    ಇಲ್ಲದಿದ್ದರೆ ಹಿಂತಿರುಗಿ (x - n) + floor(x/2.);
}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ hardtan_activate(ದಶಮಾಂಶ x)
{
    ಆದರೆ (x < -1) ಹಿಂತಿರುಗಿ -1;
    ಆದರೆ (x > 1) ಹಿಂತಿರುಗಿ 1;
    ಹಿಂತಿರುಗಿ x;
}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ ರೇಖೀಯ_activate(ದಶಮಾಂಶ x){ಹಿಂತಿರುಗಿ x;}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ logistic_activate(ದಶಮಾಂಶ x){ಹಿಂತಿರುಗಿ 1./(1. + ಘಾತಾಂಕ(-x));}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ loggy_activate(ದಶಮಾಂಶ x){ಹಿಂತಿರುಗಿ 2./(1. + ಘಾತಾಂಕ(-x)) - 1;}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ relu_activate(ದಶಮಾಂಶ x){ಹಿಂತಿರುಗಿ x*(x>0);}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ elu_activate(ದಶಮಾಂಶ x){ಹಿಂತಿರುಗಿ (x >= 0)*x + (x < 0)*(ಘಾತಾಂಕ(x)-1);}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ selu_activate(ದಶಮಾಂಶ x){ಹಿಂತಿರುಗಿ (x >= 0)*1.0507*x + (x < 0)*1.0507*1.6732*(ಘಾತಾಂಕ(x)-1);}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ relie_activate(ದಶಮಾಂಶ x){ಹಿಂತಿರುಗಿ (x>0) ? x : .01*x;}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ ramp_activate(ದಶಮಾಂಶ x){ಹಿಂತಿರುಗಿ x*(x>0)+.1*x;}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ leaky_activate(ದಶಮಾಂಶ x){ಹಿಂತಿರುಗಿ (x>0) ? x : .1*x;}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ tanh_activate(ದಶಮಾಂಶ x){ಹಿಂತಿರುಗಿ (ಘಾತಾಂಕ(2*x)-1)/(ಘಾತಾಂಕ(2*x)+1);}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ plse_activate(ದಶಮಾಂಶ x)
{
    ಆದರೆ(x < -4) ಹಿಂತಿರುಗಿ .01 * (x + 4);
    ಆದರೆ(x > 4)  ಹಿಂತಿರುಗಿ .01 * (x - 4) + 1;
    ಹಿಂತಿರುಗಿ .125*x + .5;
}

ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ lhtan_activate(ದಶಮಾಂಶ x)
{
    ಆದರೆ(x < 0) ಹಿಂತಿರುಗಿ .001*x;
    ಆದರೆ(x > 1) ಹಿಂತಿರುಗಿ .001*(x-1) + 1;
    ಹಿಂತಿರುಗಿ x;
}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ lhtan_gradient(ದಶಮಾಂಶ x)
{
    ಆದರೆ(x > 0 && x < 1) ಹಿಂತಿರುಗಿ 1;
    ಹಿಂತಿರುಗಿ .001;
}

ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ hardtan_gradient(ದಶಮಾಂಶ x)
{
    ಆದರೆ (x > -1 && x < 1) ಹಿಂತಿರುಗಿ 1;
    ಹಿಂತಿರುಗಿ 0;
}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ ರೇಖೀಯ_gradient(ದಶಮಾಂಶ x){ಹಿಂತಿರುಗಿ 1;}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ logistic_gradient(ದಶಮಾಂಶ x){ಹಿಂತಿರುಗಿ (1-x)*x;}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ loggy_gradient(ದಶಮಾಂಶ x)
{
    ದಶಮಾಂಶ y = (x+1.)/2.;
    ಹಿಂತಿರುಗಿ 2*(1-y)*y;
}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ stair_gradient(ದಶಮಾಂಶ x)
{
    ಆದರೆ (floor(x) == x) ಹಿಂತಿರುಗಿ 0;
    ಹಿಂತಿರುಗಿ 1;
}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ relu_gradient(ದಶಮಾಂಶ x){ಹಿಂತಿರುಗಿ (x>0);}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ elu_gradient(ದಶಮಾಂಶ x){ಹಿಂತಿರುಗಿ (x >= 0) + (x < 0)*(x + 1);}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ selu_gradient(ದಶಮಾಂಶ x){ಹಿಂತಿರುಗಿ (x >= 0)*1.0507 + (x < 0)*(x + 1.0507*1.6732);}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ relie_gradient(ದಶಮಾಂಶ x){ಹಿಂತಿರುಗಿ (x>0) ? 1 : .01;}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ ramp_gradient(ದಶಮಾಂಶ x){ಹಿಂತಿರುಗಿ (x>0)+.1;}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ leaky_gradient(ದಶಮಾಂಶ x){ಹಿಂತಿರುಗಿ (x>0) ? 1 : .1;}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ tanh_gradient(ದಶಮಾಂಶ x){ಹಿಂತಿರುಗಿ 1-x*x;}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ plse_gradient(ದಶಮಾಂಶ x){ಹಿಂತಿರುಗಿ (x < 0 || x > 1) ? .01 : .125;}

#ಆದರೆ_ಅಂತ್ಯ

