#اگر_غیر_تعریف_شدہ ACTIVATIONS_H
#تعریف_کرو ACTIVATIONS_H
#شامل "darknet.h"
#شامل "cuda.h"
#شامل "math.h"

ACTIVATION get_activation(حرف *s);

حرف *get_activation_string(ACTIVATION a);
اعشاری activate(اعشاری x, ACTIVATION a);
اعشاری gradient(اعشاری x, ACTIVATION a);
خالی gradient_array(ثابت اعشاری *x, ثابت صحیح n, ثابت ACTIVATION a, اعشاری *delta);
خالی activate_array(اعشاری *x, ثابت صحیح n, ثابت ACTIVATION a);
#اگر_تعریف_شدہ GPU
خالی activate_array_gpu(اعشاری *x, صحیح n, ACTIVATION a);
خالی gradient_array_gpu(اعشاری *x, صحیح n, ACTIVATION a, اعشاری *delta);
#اگر_ختم

ساکن اندرونی اعشاری stair_activate(اعشاری x)
{
    صحیح n = floor(x);
    اگر (n%2 == 0) واپس floor(x/2.);
    ورنہ واپس (x - n) + floor(x/2.);
}
ساکن اندرونی اعشاری hardtan_activate(اعشاری x)
{
    اگر (x < -1) واپس -1;
    اگر (x > 1) واپس 1;
    واپس x;
}
ساکن اندرونی اعشاری خطی_activate(اعشاری x){واپس x;}
ساکن اندرونی اعشاری logistic_activate(اعشاری x){واپس 1./(1. + قوت_نما(-x));}
ساکن اندرونی اعشاری loggy_activate(اعشاری x){واپس 2./(1. + قوت_نما(-x)) - 1;}
ساکن اندرونی اعشاری relu_activate(اعشاری x){واپس x*(x>0);}
ساکن اندرونی اعشاری elu_activate(اعشاری x){واپس (x >= 0)*x + (x < 0)*(قوت_نما(x)-1);}
ساکن اندرونی اعشاری selu_activate(اعشاری x){واپس (x >= 0)*1.0507*x + (x < 0)*1.0507*1.6732*(قوت_نما(x)-1);}
ساکن اندرونی اعشاری relie_activate(اعشاری x){واپس (x>0) ? x : .01*x;}
ساکن اندرونی اعشاری ramp_activate(اعشاری x){واپس x*(x>0)+.1*x;}
ساکن اندرونی اعشاری leaky_activate(اعشاری x){واپس (x>0) ? x : .1*x;}
ساکن اندرونی اعشاری tanh_activate(اعشاری x){واپس (قوت_نما(2*x)-1)/(قوت_نما(2*x)+1);}
ساکن اندرونی اعشاری plse_activate(اعشاری x)
{
    اگر(x < -4) واپس .01 * (x + 4);
    اگر(x > 4)  واپس .01 * (x - 4) + 1;
    واپس .125*x + .5;
}

ساکن اندرونی اعشاری lhtan_activate(اعشاری x)
{
    اگر(x < 0) واپس .001*x;
    اگر(x > 1) واپس .001*(x-1) + 1;
    واپس x;
}
ساکن اندرونی اعشاری lhtan_gradient(اعشاری x)
{
    اگر(x > 0 && x < 1) واپس 1;
    واپس .001;
}

ساکن اندرونی اعشاری hardtan_gradient(اعشاری x)
{
    اگر (x > -1 && x < 1) واپس 1;
    واپس 0;
}
ساکن اندرونی اعشاری خطی_gradient(اعشاری x){واپس 1;}
ساکن اندرونی اعشاری logistic_gradient(اعشاری x){واپس (1-x)*x;}
ساکن اندرونی اعشاری loggy_gradient(اعشاری x)
{
    اعشاری y = (x+1.)/2.;
    واپس 2*(1-y)*y;
}
ساکن اندرونی اعشاری stair_gradient(اعشاری x)
{
    اگر (floor(x) == x) واپس 0;
    واپس 1;
}
ساکن اندرونی اعشاری relu_gradient(اعشاری x){واپس (x>0);}
ساکن اندرونی اعشاری elu_gradient(اعشاری x){واپس (x >= 0) + (x < 0)*(x + 1);}
ساکن اندرونی اعشاری selu_gradient(اعشاری x){واپس (x >= 0)*1.0507 + (x < 0)*(x + 1.0507*1.6732);}
ساکن اندرونی اعشاری relie_gradient(اعشاری x){واپس (x>0) ? 1 : .01;}
ساکن اندرونی اعشاری ramp_gradient(اعشاری x){واپس (x>0)+.1;}
ساکن اندرونی اعشاری leaky_gradient(اعشاری x){واپس (x>0) ? 1 : .1;}
ساکن اندرونی اعشاری tanh_gradient(اعشاری x){واپس 1-x*x;}
ساکن اندرونی اعشاری plse_gradient(اعشاری x){واپس (x < 0 || x > 1) ? .01 : .125;}

#اگر_ختم

