#ਜੇ_ਅਪਰਿਭਾਸ਼ਿਤ ACTIVATIONS_H
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ ACTIVATIONS_H
#ਅਨ੍ਤਰ੍ਭਾਵ "darknet.h"
#ਅਨ੍ਤਰ੍ਭਾਵ "cuda.h"
#ਅਨ੍ਤਰ੍ਭਾਵ "math.h"

ACTIVATION get_activation(ਅੱਖਰ *s);

ਅੱਖਰ *get_activation_string(ACTIVATION a);
ਦਸ਼ਮਲਵ activate(ਦਸ਼ਮਲਵ x, ACTIVATION a);
ਦਸ਼ਮਲਵ gradient(ਦਸ਼ਮਲਵ x, ACTIVATION a);
ਖਾਲੀ gradient_array(ਅਚਲ ਦਸ਼ਮਲਵ *x, ਅਚਲ ਪੂਰਨ n, ਅਚਲ ACTIVATION a, ਦਸ਼ਮਲਵ *delta);
ਖਾਲੀ activate_array(ਦਸ਼ਮਲਵ *x, ਅਚਲ ਪੂਰਨ n, ਅਚਲ ACTIVATION a);
#ਜੇ_ਪਰਿਭਾਸ਼ਿਤ GPU
ਖਾਲੀ activate_array_gpu(ਦਸ਼ਮਲਵ *x, ਪੂਰਨ n, ACTIVATION a);
ਖਾਲੀ gradient_array_gpu(ਦਸ਼ਮਲਵ *x, ਪੂਰਨ n, ACTIVATION a, ਦਸ਼ਮਲਵ *delta);
#ਜੇ_ਅੰਤ

ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ stair_activate(ਦਸ਼ਮਲਵ x)
{
    ਪੂਰਨ n = floor(x);
    ਜੇ (n%2 == 0) ਵਾਪਸ floor(x/2.);
    ਨਹੀਂਤਾਂ ਵਾਪਸ (x - n) + floor(x/2.);
}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ hardtan_activate(ਦਸ਼ਮਲਵ x)
{
    ਜੇ (x < -1) ਵਾਪਸ -1;
    ਜੇ (x > 1) ਵਾਪਸ 1;
    ਵਾਪਸ x;
}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ ਰੇਖਿਕ_activate(ਦਸ਼ਮਲਵ x){ਵਾਪਸ x;}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ logistic_activate(ਦਸ਼ਮਲਵ x){ਵਾਪਸ 1./(1. + ਘਾਤਾਂਕ(-x));}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ loggy_activate(ਦਸ਼ਮਲਵ x){ਵਾਪਸ 2./(1. + ਘਾਤਾਂਕ(-x)) - 1;}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ relu_activate(ਦਸ਼ਮਲਵ x){ਵਾਪਸ x*(x>0);}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ elu_activate(ਦਸ਼ਮਲਵ x){ਵਾਪਸ (x >= 0)*x + (x < 0)*(ਘਾਤਾਂਕ(x)-1);}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ selu_activate(ਦਸ਼ਮਲਵ x){ਵਾਪਸ (x >= 0)*1.0507*x + (x < 0)*1.0507*1.6732*(ਘਾਤਾਂਕ(x)-1);}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ relie_activate(ਦਸ਼ਮਲਵ x){ਵਾਪਸ (x>0) ? x : .01*x;}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ ramp_activate(ਦਸ਼ਮਲਵ x){ਵਾਪਸ x*(x>0)+.1*x;}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ leaky_activate(ਦਸ਼ਮਲਵ x){ਵਾਪਸ (x>0) ? x : .1*x;}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ tanh_activate(ਦਸ਼ਮਲਵ x){ਵਾਪਸ (ਘਾਤਾਂਕ(2*x)-1)/(ਘਾਤਾਂਕ(2*x)+1);}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ plse_activate(ਦਸ਼ਮਲਵ x)
{
    ਜੇ(x < -4) ਵਾਪਸ .01 * (x + 4);
    ਜੇ(x > 4)  ਵਾਪਸ .01 * (x - 4) + 1;
    ਵਾਪਸ .125*x + .5;
}

ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ lhtan_activate(ਦਸ਼ਮਲਵ x)
{
    ਜੇ(x < 0) ਵਾਪਸ .001*x;
    ਜੇ(x > 1) ਵਾਪਸ .001*(x-1) + 1;
    ਵਾਪਸ x;
}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ lhtan_gradient(ਦਸ਼ਮਲਵ x)
{
    ਜੇ(x > 0 && x < 1) ਵਾਪਸ 1;
    ਵਾਪਸ .001;
}

ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ hardtan_gradient(ਦਸ਼ਮਲਵ x)
{
    ਜੇ (x > -1 && x < 1) ਵਾਪਸ 1;
    ਵਾਪਸ 0;
}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ ਰੇਖਿਕ_gradient(ਦਸ਼ਮਲਵ x){ਵਾਪਸ 1;}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ logistic_gradient(ਦਸ਼ਮਲਵ x){ਵਾਪਸ (1-x)*x;}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ loggy_gradient(ਦਸ਼ਮਲਵ x)
{
    ਦਸ਼ਮਲਵ y = (x+1.)/2.;
    ਵਾਪਸ 2*(1-y)*y;
}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ stair_gradient(ਦਸ਼ਮਲਵ x)
{
    ਜੇ (floor(x) == x) ਵਾਪਸ 0;
    ਵਾਪਸ 1;
}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ relu_gradient(ਦਸ਼ਮਲਵ x){ਵਾਪਸ (x>0);}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ elu_gradient(ਦਸ਼ਮਲਵ x){ਵਾਪਸ (x >= 0) + (x < 0)*(x + 1);}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ selu_gradient(ਦਸ਼ਮਲਵ x){ਵਾਪਸ (x >= 0)*1.0507 + (x < 0)*(x + 1.0507*1.6732);}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ relie_gradient(ਦਸ਼ਮਲਵ x){ਵਾਪਸ (x>0) ? 1 : .01;}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ ramp_gradient(ਦਸ਼ਮਲਵ x){ਵਾਪਸ (x>0)+.1;}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ leaky_gradient(ਦਸ਼ਮਲਵ x){ਵਾਪਸ (x>0) ? 1 : .1;}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ tanh_gradient(ਦਸ਼ਮਲਵ x){ਵਾਪਸ 1-x*x;}
ਸਥਿਰ ਸਤਰਅੰਦਰ ਦਸ਼ਮਲਵ plse_gradient(ਦਸ਼ਮਲਵ x){ਵਾਪਸ (x < 0 || x > 1) ? .01 : .125;}

#ਜੇ_ਅੰਤ

