#ifndef ACTIVATIONS_H
#define ACTIVATIONS_H
#ಅನ್ತರ್ಭಾವ "darknet.h"
#ಅನ್ತರ್ಭಾವ "cuda.h"
#ಅನ್ತರ್ಭಾವ "math.h"

ACTIVATION get_activation(ವರ್ಣ *s);

ವರ್ಣ *get_activation_string(ACTIVATION a);
ಭಿನ್ನ activate(ಭಿನ್ನ x, ACTIVATION a);
ಭಿನ್ನ gradient(ಭಿನ್ನ x, ACTIVATION a);
ಶೂನ್ಯ gradient_array(ಧ್ರುವ ಭಿನ್ನ *x, ಧ್ರುವ ಪೂರ್ಣಾಙ್ಕ n, ಧ್ರುವ ACTIVATION a, ಭಿನ್ನ *delta);
ಶೂನ್ಯ activate_array(ಭಿನ್ನ *x, ಧ್ರುವ ಪೂರ್ಣಾಙ್ಕ n, ಧ್ರುವ ACTIVATION a);
#ifdef GPU
ಶೂನ್ಯ activate_array_gpu(ಭಿನ್ನ *x, ಪೂರ್ಣಾಙ್ಕ n, ACTIVATION a);
ಶೂನ್ಯ gradient_array_gpu(ಭಿನ್ನ *x, ಪೂರ್ಣಾಙ್ಕ n, ACTIVATION a, ಭಿನ್ನ *delta);
#endif

ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ stair_activate(ಭಿನ್ನ x)
{
    ಪೂರ್ಣಾಙ್ಕ n = floor(x);
    ಯದಿ (n%2 == 0) ಪ್ರತ್ಯಾಗಮ floor(x/2.);
    ಅನ್ಯಥಾ ಪ್ರತ್ಯಾಗಮ (x - n) + floor(x/2.);
}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ hardtan_activate(ಭಿನ್ನ x)
{
    ಯದಿ (x < -1) ಪ್ರತ್ಯಾಗಮ -1;
    ಯದಿ (x > 1) ಪ್ರತ್ಯಾಗಮ 1;
    ಪ್ರತ್ಯಾಗಮ x;
}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ linear_activate(ಭಿನ್ನ x){ಪ್ರತ್ಯಾಗಮ x;}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ logistic_activate(ಭಿನ್ನ x){ಪ್ರತ್ಯಾಗಮ 1./(1. + exp(-x));}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ loggy_activate(ಭಿನ್ನ x){ಪ್ರತ್ಯಾಗಮ 2./(1. + exp(-x)) - 1;}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ relu_activate(ಭಿನ್ನ x){ಪ್ರತ್ಯಾಗಮ x*(x>0);}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ elu_activate(ಭಿನ್ನ x){ಪ್ರತ್ಯಾಗಮ (x >= 0)*x + (x < 0)*(exp(x)-1);}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ selu_activate(ಭಿನ್ನ x){ಪ್ರತ್ಯಾಗಮ (x >= 0)*1.0507*x + (x < 0)*1.0507*1.6732*(exp(x)-1);}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ relie_activate(ಭಿನ್ನ x){ಪ್ರತ್ಯಾಗಮ (x>0) ? x : .01*x;}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ ramp_activate(ಭಿನ್ನ x){ಪ್ರತ್ಯಾಗಮ x*(x>0)+.1*x;}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ leaky_activate(ಭಿನ್ನ x){ಪ್ರತ್ಯಾಗಮ (x>0) ? x : .1*x;}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ tanh_activate(ಭಿನ್ನ x){ಪ್ರತ್ಯಾಗಮ (exp(2*x)-1)/(exp(2*x)+1);}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ plse_activate(ಭಿನ್ನ x)
{
    ಯದಿ(x < -4) ಪ್ರತ್ಯಾಗಮ .01 * (x + 4);
    ಯದಿ(x > 4)  ಪ್ರತ್ಯಾಗಮ .01 * (x - 4) + 1;
    ಪ್ರತ್ಯಾಗಮ .125*x + .5;
}

ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ lhtan_activate(ಭಿನ್ನ x)
{
    ಯದಿ(x < 0) ಪ್ರತ್ಯಾಗಮ .001*x;
    ಯದಿ(x > 1) ಪ್ರತ್ಯಾಗಮ .001*(x-1) + 1;
    ಪ್ರತ್ಯಾಗಮ x;
}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ lhtan_gradient(ಭಿನ್ನ x)
{
    ಯದಿ(x > 0 && x < 1) ಪ್ರತ್ಯಾಗಮ 1;
    ಪ್ರತ್ಯಾಗಮ .001;
}

ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ hardtan_gradient(ಭಿನ್ನ x)
{
    ಯದಿ (x > -1 && x < 1) ಪ್ರತ್ಯಾಗಮ 1;
    ಪ್ರತ್ಯಾಗಮ 0;
}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ linear_gradient(ಭಿನ್ನ x){ಪ್ರತ್ಯಾಗಮ 1;}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ logistic_gradient(ಭಿನ್ನ x){ಪ್ರತ್ಯಾಗಮ (1-x)*x;}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ loggy_gradient(ಭಿನ್ನ x)
{
    ಭಿನ್ನ y = (x+1.)/2.;
    ಪ್ರತ್ಯಾಗಮ 2*(1-y)*y;
}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ stair_gradient(ಭಿನ್ನ x)
{
    ಯದಿ (floor(x) == x) ಪ್ರತ್ಯಾಗಮ 0;
    ಪ್ರತ್ಯಾಗಮ 1;
}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ relu_gradient(ಭಿನ್ನ x){ಪ್ರತ್ಯಾಗಮ (x>0);}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ elu_gradient(ಭಿನ್ನ x){ಪ್ರತ್ಯಾಗಮ (x >= 0) + (x < 0)*(x + 1);}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ selu_gradient(ಭಿನ್ನ x){ಪ್ರತ್ಯಾಗಮ (x >= 0)*1.0507 + (x < 0)*(x + 1.0507*1.6732);}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ relie_gradient(ಭಿನ್ನ x){ಪ್ರತ್ಯಾಗಮ (x>0) ? 1 : .01;}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ ramp_gradient(ಭಿನ್ನ x){ಪ್ರತ್ಯಾಗಮ (x>0)+.1;}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ leaky_gradient(ಭಿನ್ನ x){ಪ್ರತ್ಯಾಗಮ (x>0) ? 1 : .1;}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ tanh_gradient(ಭಿನ್ನ x){ಪ್ರತ್ಯಾಗಮ 1-x*x;}
ಸ್ಥಿರ ಅನ್ತಃಸ್ಥ ಭಿನ್ನ plse_gradient(ಭಿನ್ನ x){ಪ್ರತ್ಯಾಗಮ (x < 0 || x > 1) ? .01 : .125;}

#endif

