#నిర్వచితం_కాకపోతే ACTIVATIONS_H
#నిర్వచించు ACTIVATIONS_H
#అన్తర్భావ "darknet.h"
#అన్తర్భావ "cuda.h"
#అన్తర్భావ "math.h"

ACTIVATION get_activation(అక్షరం *s);

అక్షరం *get_activation_string(ACTIVATION a);
దశాంశం activate(దశాంశం x, ACTIVATION a);
దశాంశం gradient(దశాంశం x, ACTIVATION a);
శూన్య gradient_array(స్థిరరాశి దశాంశం *x, స్థిరరాశి పూర్ణాంకం n, స్థిరరాశి ACTIVATION a, దశాంశం *delta);
శూన్య activate_array(దశాంశం *x, స్థిరరాశి పూర్ణాంకం n, స్థిరరాశి ACTIVATION a);
#నిర్వచితమైతే GPU
శూన్య activate_array_gpu(దశాంశం *x, పూర్ణాంకం n, ACTIVATION a);
శూన్య gradient_array_gpu(దశాంశం *x, పూర్ణాంకం n, ACTIVATION a, దశాంశం *delta);
#అయితే_ముగింపు

స్థిర అంతఃవరుస దశాంశం stair_activate(దశాంశం x)
{
    పూర్ణాంకం n = floor(x);
    ఒకవేళ (n%2 == 0) తిరిగి floor(x/2.);
    లేకపోతే తిరిగి (x - n) + floor(x/2.);
}
స్థిర అంతఃవరుస దశాంశం hardtan_activate(దశాంశం x)
{
    ఒకవేళ (x < -1) తిరిగి -1;
    ఒకవేళ (x > 1) తిరిగి 1;
    తిరిగి x;
}
స్థిర అంతఃవరుస దశాంశం రేఖీయ_activate(దశాంశం x){తిరిగి x;}
స్థిర అంతఃవరుస దశాంశం logistic_activate(దశాంశం x){తిరిగి 1./(1. + ఘాతాంకం(-x));}
స్థిర అంతఃవరుస దశాంశం loggy_activate(దశాంశం x){తిరిగి 2./(1. + ఘాతాంకం(-x)) - 1;}
స్థిర అంతఃవరుస దశాంశం relu_activate(దశాంశం x){తిరిగి x*(x>0);}
స్థిర అంతఃవరుస దశాంశం elu_activate(దశాంశం x){తిరిగి (x >= 0)*x + (x < 0)*(ఘాతాంకం(x)-1);}
స్థిర అంతఃవరుస దశాంశం selu_activate(దశాంశం x){తిరిగి (x >= 0)*1.0507*x + (x < 0)*1.0507*1.6732*(ఘాతాంకం(x)-1);}
స్థిర అంతఃవరుస దశాంశం relie_activate(దశాంశం x){తిరిగి (x>0) ? x : .01*x;}
స్థిర అంతఃవరుస దశాంశం ramp_activate(దశాంశం x){తిరిగి x*(x>0)+.1*x;}
స్థిర అంతఃవరుస దశాంశం leaky_activate(దశాంశం x){తిరిగి (x>0) ? x : .1*x;}
స్థిర అంతఃవరుస దశాంశం tanh_activate(దశాంశం x){తిరిగి (ఘాతాంకం(2*x)-1)/(ఘాతాంకం(2*x)+1);}
స్థిర అంతఃవరుస దశాంశం plse_activate(దశాంశం x)
{
    ఒకవేళ(x < -4) తిరిగి .01 * (x + 4);
    ఒకవేళ(x > 4)  తిరిగి .01 * (x - 4) + 1;
    తిరిగి .125*x + .5;
}

స్థిర అంతఃవరుస దశాంశం lhtan_activate(దశాంశం x)
{
    ఒకవేళ(x < 0) తిరిగి .001*x;
    ఒకవేళ(x > 1) తిరిగి .001*(x-1) + 1;
    తిరిగి x;
}
స్థిర అంతఃవరుస దశాంశం lhtan_gradient(దశాంశం x)
{
    ఒకవేళ(x > 0 && x < 1) తిరిగి 1;
    తిరిగి .001;
}

స్థిర అంతఃవరుస దశాంశం hardtan_gradient(దశాంశం x)
{
    ఒకవేళ (x > -1 && x < 1) తిరిగి 1;
    తిరిగి 0;
}
స్థిర అంతఃవరుస దశాంశం రేఖీయ_gradient(దశాంశం x){తిరిగి 1;}
స్థిర అంతఃవరుస దశాంశం logistic_gradient(దశాంశం x){తిరిగి (1-x)*x;}
స్థిర అంతఃవరుస దశాంశం loggy_gradient(దశాంశం x)
{
    దశాంశం y = (x+1.)/2.;
    తిరిగి 2*(1-y)*y;
}
స్థిర అంతఃవరుస దశాంశం stair_gradient(దశాంశం x)
{
    ఒకవేళ (floor(x) == x) తిరిగి 0;
    తిరిగి 1;
}
స్థిర అంతఃవరుస దశాంశం relu_gradient(దశాంశం x){తిరిగి (x>0);}
స్థిర అంతఃవరుస దశాంశం elu_gradient(దశాంశం x){తిరిగి (x >= 0) + (x < 0)*(x + 1);}
స్థిర అంతఃవరుస దశాంశం selu_gradient(దశాంశం x){తిరిగి (x >= 0)*1.0507 + (x < 0)*(x + 1.0507*1.6732);}
స్థిర అంతఃవరుస దశాంశం relie_gradient(దశాంశం x){తిరిగి (x>0) ? 1 : .01;}
స్థిర అంతఃవరుస దశాంశం ramp_gradient(దశాంశం x){తిరిగి (x>0)+.1;}
స్థిర అంతఃవరుస దశాంశం leaky_gradient(దశాంశం x){తిరిగి (x>0) ? 1 : .1;}
స్థిర అంతఃవరుస దశాంశం tanh_gradient(దశాంశం x){తిరిగి 1-x*x;}
స్థిర అంతఃవరుస దశాంశం plse_gradient(దశాంశం x){తిరిగి (x < 0 || x > 1) ? .01 : .125;}

#అయితే_ముగింపు

