#ವ್ಯಾಖ್ಯಾನಿತವಾಗದಿದ್ದರೆ BLAS_H
#ವ್ಯಾಖ್ಯಾನಿಸು BLAS_H
#ಅನ್ತರ್ಭಾವ "darknet.h"

ಶೂನ್ಯ flatten(ದಶಮಾಂಶ *x, ಪೂರ್ಣಾಂಕ ಗಾತ್ರ_2, ಪೂರ್ಣಾಂಕ layers, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ forward);
ಶೂನ್ಯ pm(ಪೂರ್ಣಾಂಕ M, ಪೂರ್ಣಾಂಕ N, ದಶಮಾಂಶ *A);
ದಶಮಾಂಶ *random_ಮಾತೃಕೆ(ಪೂರ್ಣಾಂಕ ಅಡ್ಡಸಾಲುಗಳು, ಪೂರ್ಣಾಂಕ ಲಂಬಸಾಲು_ಸಂಖ್ಯೆ);
ಶೂನ್ಯ ಸಮಯ_random_ಮಾತೃಕೆ(ಪೂರ್ಣಾಂಕ TA, ಪೂರ್ಣಾಂಕ TB, ಪೂರ್ಣಾಂಕ m, ಪೂರ್ಣಾಂಕ k, ಪೂರ್ಣಾಂಕ n);
ಶೂನ್ಯ reorg_cpu(ದಶಮಾಂಶ *x, ಪೂರ್ಣಾಂಕ w, ಪೂರ್ಣಾಂಕ h, ಪೂರ್ಣಾಂಕ c, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ stride, ಪೂರ್ಣಾಂಕ forward, ದಶಮಾಂಶ *ಹೊರಹೋಗು);

ಶೂನ್ಯ test_blas();

ಶೂನ್ಯ inter_cpu(ಪೂರ್ಣಾಂಕ NX, ದಶಮಾಂಶ *X, ಪೂರ್ಣಾಂಕ NY, ದಶಮಾಂಶ *Y, ಪೂರ್ಣಾಂಕ B, ದಶಮಾಂಶ *ಹೊರಹೋಗು_2);
ಶೂನ್ಯ deinter_cpu(ಪೂರ್ಣಾಂಕ NX, ದಶಮಾಂಶ *X, ಪೂರ್ಣಾಂಕ NY, ದಶಮಾಂಶ *Y, ಪೂರ್ಣಾಂಕ B, ದಶಮಾಂಶ *ಹೊರಹೋಗು_2);
ಶೂನ್ಯ mult_ಕೂಡಿಸು_into_cpu(ಪೂರ್ಣಾಂಕ N, ದಶಮಾಂಶ *X, ದಶಮಾಂಶ *Y, ದಶಮಾಂಶ *Z);

ಶೂನ್ಯ const_cpu(ಪೂರ್ಣಾಂಕ N, ದಶಮಾಂಶ ALPHA, ದಶಮಾಂಶ *X, ಪೂರ್ಣಾಂಕ INCX);
ಶೂನ್ಯ constrain_gpu(ಪೂರ್ಣಾಂಕ N, ದಶಮಾಂಶ ALPHA, ದಶಮಾಂಶ * X, ಪೂರ್ಣಾಂಕ INCX);
ಶೂನ್ಯ pow_cpu(ಪೂರ್ಣಾಂಕ N, ದಶಮಾಂಶ ALPHA, ದಶಮಾಂಶ *X, ಪೂರ್ಣಾಂಕ INCX, ದಶಮಾಂಶ *Y, ಪೂರ್ಣಾಂಕ INCY);
ಶೂನ್ಯ mul_cpu(ಪೂರ್ಣಾಂಕ N, ದಶಮಾಂಶ *X, ಪೂರ್ಣಾಂಕ INCX, ದಶಮಾಂಶ *Y, ಪೂರ್ಣಾಂಕ INCY);

ಪೂರ್ಣಾಂಕ test_gpu_blas();
ಶೂನ್ಯ shortcut_cpu(ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ w1, ಪೂರ್ಣಾಂಕ h1, ಪೂರ್ಣಾಂಕ c1, ದಶಮಾಂಶ *ಕೂಡಿಸು, ಪೂರ್ಣಾಂಕ w2, ಪೂರ್ಣಾಂಕ h2, ಪೂರ್ಣಾಂಕ c2, ದಶಮಾಂಶ s1, ದಶಮಾಂಶ s2, ದಶಮಾಂಶ *ಹೊರಹೋಗು);

ಶೂನ್ಯ ಸರಾಸರಿ_cpu(ದಶಮಾಂಶ *x, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ filters, ಪೂರ್ಣಾಂಕ spatial, ದಶಮಾಂಶ *ಸರಾಸರಿ);
ಶೂನ್ಯ variance_cpu(ದಶಮಾಂಶ *x, ದಶಮಾಂಶ *ಸರಾಸರಿ, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ filters, ಪೂರ್ಣಾಂಕ spatial, ದಶಮಾಂಶ *variance);

ಶೂನ್ಯ scale_bias(ದಶಮಾಂಶ *output, ದಶಮಾಂಶ *scales, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ n, ಪೂರ್ಣಾಂಕ ಗಾತ್ರ_2);
ಶೂನ್ಯ backward_scale_cpu(ದಶಮಾಂಶ *x_norm, ದಶಮಾಂಶ *delta, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ n, ಪೂರ್ಣಾಂಕ ಗಾತ್ರ_2, ದಶಮಾಂಶ *scale_updates);
ಶೂನ್ಯ ಸರಾಸರಿ_delta_cpu(ದಶಮಾಂಶ *delta, ದಶಮಾಂಶ *variance, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ filters, ಪೂರ್ಣಾಂಕ spatial, ದಶಮಾಂಶ *ಸರಾಸರಿ_delta);
ಶೂನ್ಯ  variance_delta_cpu(ದಶಮಾಂಶ *x, ದಶಮಾಂಶ *delta, ದಶಮಾಂಶ *ಸರಾಸರಿ, ದಶಮಾಂಶ *variance, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ filters, ಪೂರ್ಣಾಂಕ spatial, ದಶಮಾಂಶ *variance_delta);
ಶೂನ್ಯ normalize_delta_cpu(ದಶಮಾಂಶ *x, ದಶಮಾಂಶ *ಸರಾಸರಿ, ದಶಮಾಂಶ *variance, ದಶಮಾಂಶ *ಸರಾಸರಿ_delta, ದಶಮಾಂಶ *variance_delta, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ filters, ಪೂರ್ಣಾಂಕ spatial, ದಶಮಾಂಶ *delta);
ಶೂನ್ಯ l2normalize_cpu(ದಶಮಾಂಶ *x, ದಶಮಾಂಶ *dx, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ filters, ಪೂರ್ಣಾಂಕ spatial);

ಶೂನ್ಯ smooth_l1_cpu(ಪೂರ್ಣಾಂಕ n, ದಶಮಾಂಶ *pred, ದಶಮಾಂಶ *truth, ದಶಮಾಂಶ *delta, ದಶಮಾಂಶ *error);
ಶೂನ್ಯ l2_cpu(ಪೂರ್ಣಾಂಕ n, ದಶಮಾಂಶ *pred, ದಶಮಾಂಶ *truth, ದಶಮಾಂಶ *delta, ದಶಮಾಂಶ *error);
ಶೂನ್ಯ l1_cpu(ಪೂರ್ಣಾಂಕ n, ದಶಮಾಂಶ *pred, ದಶಮಾಂಶ *truth, ದಶಮಾಂಶ *delta, ದಶಮಾಂಶ *error);
ಶೂನ್ಯ logistic_x_ent_cpu(ಪೂರ್ಣಾಂಕ n, ದಶಮಾಂಶ *pred, ದಶಮಾಂಶ *truth, ದಶಮಾಂಶ *delta, ದಶಮಾಂಶ *error);
ಶೂನ್ಯ softmax_x_ent_cpu(ಪೂರ್ಣಾಂಕ n, ದಶಮಾಂಶ *pred, ದಶಮಾಂಶ *truth, ದಶಮಾಂಶ *delta, ದಶಮಾಂಶ *error);
ಶೂನ್ಯ weighted_ಮೊತ್ತ_cpu(ದಶಮಾಂಶ *a, ದಶಮಾಂಶ *b, ದಶಮಾಂಶ *s, ಪೂರ್ಣಾಂಕ ಅಂಕೆ, ದಶಮಾಂಶ *c);
ಶೂನ್ಯ weighted_delta_cpu(ದಶಮಾಂಶ *a, ದಶಮಾಂಶ *b, ದಶಮಾಂಶ *s, ದಶಮಾಂಶ *da, ದಶಮಾಂಶ *db, ದಶಮಾಂಶ *ds, ಪೂರ್ಣಾಂಕ n, ದಶಮಾಂಶ *dc);

ಶೂನ್ಯ softmax(ದಶಮಾಂಶ *ಒಳಹರಿವು, ಪೂರ್ಣಾಂಕ n, ದಶಮಾಂಶ ತಾತ್ಕಾಲಿಕ, ಪೂರ್ಣಾಂಕ stride, ದಶಮಾಂಶ *output);
ಶೂನ್ಯ softmax_cpu(ದಶಮಾಂಶ *ಒಳಹರಿವು, ಪೂರ್ಣಾಂಕ n, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ batch_ಸ್ಥಾನಾಂತರ, ಪೂರ್ಣಾಂಕ groups, ಪೂರ್ಣಾಂಕ ಗುಂಪು_ಸ್ಥಾನಾಂತರ, ಪೂರ್ಣಾಂಕ stride, ದಶಮಾಂಶ ತಾತ್ಕಾಲಿಕ, ದಶಮಾಂಶ *output);
ಶೂನ್ಯ upsample_cpu(ದಶಮಾಂಶ *ಒಳ, ಪೂರ್ಣಾಂಕ w, ಪೂರ್ಣಾಂಕ h, ಪೂರ್ಣಾಂಕ c, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ stride, ಪೂರ್ಣಾಂಕ forward, ದಶಮಾಂಶ scale, ದಶಮಾಂಶ *ಹೊರಹೋಗು);

#ವ್ಯಾಖ್ಯಾನಿತವಾದರೆ GPU
#ಅನ್ತರ್ಭಾವ "cuda.h"
#ಅನ್ತರ್ಭಾವ "tree.h"

ಶೂನ್ಯ axpy_gpu(ಪೂರ್ಣಾಂಕ N, ದಶಮಾಂಶ ALPHA, ದಶಮಾಂಶ * X, ಪೂರ್ಣಾಂಕ INCX, ದಶಮಾಂಶ * Y, ಪೂರ್ಣಾಂಕ INCY);
ಶೂನ್ಯ axpy_gpu_ಸ್ಥಾನಾಂತರ(ಪೂರ್ಣಾಂಕ N, ದಶಮಾಂಶ ALPHA, ದಶಮಾಂಶ * X, ಪೂರ್ಣಾಂಕ OFFX, ಪೂರ್ಣಾಂಕ INCX, ದಶಮಾಂಶ * Y, ಪೂರ್ಣಾಂಕ OFFY, ಪೂರ್ಣಾಂಕ INCY);
ಶೂನ್ಯ copy_gpu(ಪೂರ್ಣಾಂಕ N, ದಶಮಾಂಶ * X, ಪೂರ್ಣಾಂಕ INCX, ದಶಮಾಂಶ * Y, ಪೂರ್ಣಾಂಕ INCY);
ಶೂನ್ಯ copy_gpu_ಸ್ಥಾನಾಂತರ(ಪೂರ್ಣಾಂಕ N, ದಶಮಾಂಶ * X, ಪೂರ್ಣಾಂಕ OFFX, ಪೂರ್ಣಾಂಕ INCX, ದಶಮಾಂಶ * Y, ಪೂರ್ಣಾಂಕ OFFY, ಪೂರ್ಣಾಂಕ INCY);
ಶೂನ್ಯ ಕೂಡಿಸು_gpu(ಪೂರ್ಣಾಂಕ N, ದಶಮಾಂಶ ALPHA, ದಶಮಾಂಶ * X, ಪೂರ್ಣಾಂಕ INCX);
ಶೂನ್ಯ supp_gpu(ಪೂರ್ಣಾಂಕ N, ದಶಮಾಂಶ ALPHA, ದಶಮಾಂಶ * X, ಪೂರ್ಣಾಂಕ INCX);
ಶೂನ್ಯ ಮುಖವಾಡ_gpu(ಪೂರ್ಣಾಂಕ N, ದಶಮಾಂಶ * X, ದಶಮಾಂಶ ಮುಖವಾಡ_ಅಂಕೆ, ದಶಮಾಂಶ * ಮುಖವಾಡ, ದಶಮಾಂಶ val);
ಶೂನ್ಯ scale_ಮುಖವಾಡ_gpu(ಪೂರ್ಣಾಂಕ N, ದಶಮಾಂಶ * X, ದಶಮಾಂಶ ಮುಖವಾಡ_ಅಂಕೆ, ದಶಮಾಂಶ * ಮುಖವಾಡ, ದಶಮಾಂಶ scale);
ಶೂನ್ಯ const_gpu(ಪೂರ್ಣಾಂಕ N, ದಶಮಾಂಶ ALPHA, ದಶಮಾಂಶ *X, ಪೂರ್ಣಾಂಕ INCX);
ಶೂನ್ಯ pow_gpu(ಪೂರ್ಣಾಂಕ N, ದಶಮಾಂಶ ALPHA, ದಶಮಾಂಶ *X, ಪೂರ್ಣಾಂಕ INCX, ದಶಮಾಂಶ *Y, ಪೂರ್ಣಾಂಕ INCY);
ಶೂನ್ಯ mul_gpu(ಪೂರ್ಣಾಂಕ N, ದಶಮಾಂಶ *X, ಪೂರ್ಣಾಂಕ INCX, ದಶಮಾಂಶ *Y, ಪೂರ್ಣಾಂಕ INCY);

ಶೂನ್ಯ ಸರಾಸರಿ_gpu(ದಶಮಾಂಶ *x, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ filters, ಪೂರ್ಣಾಂಕ spatial, ದಶಮಾಂಶ *ಸರಾಸರಿ);
ಶೂನ್ಯ variance_gpu(ದಶಮಾಂಶ *x, ದಶಮಾಂಶ *ಸರಾಸರಿ, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ filters, ಪೂರ್ಣಾಂಕ spatial, ದಶಮಾಂಶ *variance);
ಶೂನ್ಯ normalize_gpu(ದಶಮಾಂಶ *x, ದಶಮಾಂಶ *ಸರಾಸರಿ, ದಶಮಾಂಶ *variance, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ filters, ಪೂರ್ಣಾಂಕ spatial);
ಶೂನ್ಯ l2normalize_gpu(ದಶಮಾಂಶ *x, ದಶಮಾಂಶ *dx, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ filters, ಪೂರ್ಣಾಂಕ spatial);

ಶೂನ್ಯ normalize_delta_gpu(ದಶಮಾಂಶ *x, ದಶಮಾಂಶ *ಸರಾಸರಿ, ದಶಮಾಂಶ *variance, ದಶಮಾಂಶ *ಸರಾಸರಿ_delta, ದಶಮಾಂಶ *variance_delta, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ filters, ಪೂರ್ಣಾಂಕ spatial, ದಶಮಾಂಶ *delta);

ಶೂನ್ಯ fast_ಸರಾಸರಿ_delta_gpu(ದಶಮಾಂಶ *delta, ದಶಮಾಂಶ *variance, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ filters, ಪೂರ್ಣಾಂಕ spatial, ದಶಮಾಂಶ *ಸರಾಸರಿ_delta);
ಶೂನ್ಯ fast_variance_delta_gpu(ದಶಮಾಂಶ *x, ದಶಮಾಂಶ *delta, ದಶಮಾಂಶ *ಸರಾಸರಿ, ದಶಮಾಂಶ *variance, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ filters, ಪೂರ್ಣಾಂಕ spatial, ದಶಮಾಂಶ *variance_delta);

ಶೂನ್ಯ fast_variance_gpu(ದಶಮಾಂಶ *x, ದಶಮಾಂಶ *ಸರಾಸರಿ, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ filters, ಪೂರ್ಣಾಂಕ spatial, ದಶಮಾಂಶ *variance);
ಶೂನ್ಯ fast_ಸರಾಸರಿ_gpu(ದಶಮಾಂಶ *x, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ filters, ಪೂರ್ಣಾಂಕ spatial, ದಶಮಾಂಶ *ಸರಾಸರಿ);
ಶೂನ್ಯ shortcut_gpu(ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ w1, ಪೂರ್ಣಾಂಕ h1, ಪೂರ್ಣಾಂಕ c1, ದಶಮಾಂಶ *ಕೂಡಿಸು, ಪೂರ್ಣಾಂಕ w2, ಪೂರ್ಣಾಂಕ h2, ಪೂರ್ಣಾಂಕ c2, ದಶಮಾಂಶ s1, ದಶಮಾಂಶ s2, ದಶಮಾಂಶ *ಹೊರಹೋಗು);
ಶೂನ್ಯ scale_bias_gpu(ದಶಮಾಂಶ *output, ದಶಮಾಂಶ *biases, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ n, ಪೂರ್ಣಾಂಕ ಗಾತ್ರ_2);
ಶೂನ್ಯ backward_scale_gpu(ದಶಮಾಂಶ *x_norm, ದಶಮಾಂಶ *delta, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ n, ಪೂರ್ಣಾಂಕ ಗಾತ್ರ_2, ದಶಮಾಂಶ *scale_updates);
ಶೂನ್ಯ scale_bias_gpu(ದಶಮಾಂಶ *output, ದಶಮಾಂಶ *biases, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ n, ಪೂರ್ಣಾಂಕ ಗಾತ್ರ_2);
ಶೂನ್ಯ ಕೂಡಿಸು_bias_gpu(ದಶಮಾಂಶ *output, ದಶಮಾಂಶ *biases, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ n, ಪೂರ್ಣಾಂಕ ಗಾತ್ರ_2);
ಶೂನ್ಯ backward_bias_gpu(ದಶಮಾಂಶ *bias_updates, ದಶಮಾಂಶ *delta, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ n, ಪೂರ್ಣಾಂಕ ಗಾತ್ರ_2);

ಶೂನ್ಯ logistic_x_ent_gpu(ಪೂರ್ಣಾಂಕ n, ದಶಮಾಂಶ *pred, ದಶಮಾಂಶ *truth, ದಶಮಾಂಶ *delta, ದಶಮಾಂಶ *error);
ಶೂನ್ಯ softmax_x_ent_gpu(ಪೂರ್ಣಾಂಕ n, ದಶಮಾಂಶ *pred, ದಶಮಾಂಶ *truth, ದಶಮಾಂಶ *delta, ದಶಮಾಂಶ *error);
ಶೂನ್ಯ smooth_l1_gpu(ಪೂರ್ಣಾಂಕ n, ದಶಮಾಂಶ *pred, ದಶಮಾಂಶ *truth, ದಶಮಾಂಶ *delta, ದಶಮಾಂಶ *error);
ಶೂನ್ಯ l2_gpu(ಪೂರ್ಣಾಂಕ n, ದಶಮಾಂಶ *pred, ದಶಮಾಂಶ *truth, ದಶಮಾಂಶ *delta, ದಶಮಾಂಶ *error);
ಶೂನ್ಯ l1_gpu(ಪೂರ್ಣಾಂಕ n, ದಶಮಾಂಶ *pred, ದಶಮಾಂಶ *truth, ದಶಮಾಂಶ *delta, ದಶಮಾಂಶ *error);
ಶೂನ್ಯ wgan_gpu(ಪೂರ್ಣಾಂಕ n, ದಶಮಾಂಶ *pred, ದಶಮಾಂಶ *truth, ದಶಮಾಂಶ *delta, ದಶಮಾಂಶ *error);
ಶೂನ್ಯ weighted_delta_gpu(ದಶಮಾಂಶ *a, ದಶಮಾಂಶ *b, ದಶಮಾಂಶ *s, ದಶಮಾಂಶ *da, ದಶಮಾಂಶ *db, ದಶಮಾಂಶ *ds, ಪೂರ್ಣಾಂಕ ಅಂಕೆ, ದಶಮಾಂಶ *dc);
ಶೂನ್ಯ weighted_ಮೊತ್ತ_gpu(ದಶಮಾಂಶ *a, ದಶಮಾಂಶ *b, ದಶಮಾಂಶ *s, ಪೂರ್ಣಾಂಕ ಅಂಕೆ, ದಶಮಾಂಶ *c);
ಶೂನ್ಯ mult_ಕೂಡಿಸು_into_gpu(ಪೂರ್ಣಾಂಕ ಅಂಕೆ, ದಶಮಾಂಶ *a, ದಶಮಾಂಶ *b, ದಶಮಾಂಶ *c);
ಶೂನ್ಯ inter_gpu(ಪೂರ್ಣಾಂಕ NX, ದಶಮಾಂಶ *X, ಪೂರ್ಣಾಂಕ NY, ದಶಮಾಂಶ *Y, ಪೂರ್ಣಾಂಕ B, ದಶಮಾಂಶ *ಹೊರಹೋಗು_2);
ಶೂನ್ಯ deinter_gpu(ಪೂರ್ಣಾಂಕ NX, ದಶಮಾಂಶ *X, ಪೂರ್ಣಾಂಕ NY, ದಶಮಾಂಶ *Y, ಪೂರ್ಣಾಂಕ B, ದಶಮಾಂಶ *ಹೊರಹೋಗು_2);

ಶೂನ್ಯ reorg_gpu(ದಶಮಾಂಶ *x, ಪೂರ್ಣಾಂಕ w, ಪೂರ್ಣಾಂಕ h, ಪೂರ್ಣಾಂಕ c, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ stride, ಪೂರ್ಣಾಂಕ forward, ದಶಮಾಂಶ *ಹೊರಹೋಗು);

ಶೂನ್ಯ softmax_gpu(ದಶಮಾಂಶ *ಒಳಹರಿವು, ಪೂರ್ಣಾಂಕ n, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ batch_ಸ್ಥಾನಾಂತರ, ಪೂರ್ಣಾಂಕ groups, ಪೂರ್ಣಾಂಕ ಗುಂಪು_ಸ್ಥಾನಾಂತರ, ಪೂರ್ಣಾಂಕ stride, ದಶಮಾಂಶ ತಾತ್ಕಾಲಿಕ, ದಶಮಾಂಶ *output);
ಶೂನ್ಯ adam_update_gpu(ದಶಮಾಂಶ *w, ದಶಮಾಂಶ *d, ದಶಮಾಂಶ *m, ದಶಮಾಂಶ *v, ದಶಮಾಂಶ B1, ದಶಮಾಂಶ B2, ದಶಮಾಂಶ eps, ದಶಮಾಂಶ decay, ದಶಮಾಂಶ ದರ, ಪೂರ್ಣಾಂಕ n, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ t);
ಶೂನ್ಯ adam_gpu(ಪೂರ್ಣಾಂಕ n, ದಶಮಾಂಶ *x, ದಶಮಾಂಶ *m, ದಶಮಾಂಶ *v, ದಶಮಾಂಶ B1, ದಶಮಾಂಶ B2, ದಶಮಾಂಶ ದರ, ದಶಮಾಂಶ eps, ಪೂರ್ಣಾಂಕ t);

ಶೂನ್ಯ flatten_gpu(ದಶಮಾಂಶ *x, ಪೂರ್ಣಾಂಕ spatial, ಪೂರ್ಣಾಂಕ layers, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ forward, ದಶಮಾಂಶ *ಹೊರಹೋಗು);
ಶೂನ್ಯ softmax_ವೃಕ್ಷ(ದಶಮಾಂಶ *ಒಳಹರಿವು, ಪೂರ್ಣಾಂಕ spatial, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ stride, ದಶಮಾಂಶ ತಾತ್ಕಾಲಿಕ, ದಶಮಾಂಶ *output, ವೃಕ್ಷ hier);
ಶೂನ್ಯ upsample_gpu(ದಶಮಾಂಶ *ಒಳ, ಪೂರ್ಣಾಂಕ w, ಪೂರ್ಣಾಂಕ h, ಪೂರ್ಣಾಂಕ c, ಪೂರ್ಣಾಂಕ batch, ಪೂರ್ಣಾಂಕ stride, ಪೂರ್ಣಾಂಕ forward, ದಶಮಾಂಶ scale, ದಶಮಾಂಶ *ಹೊರಹೋಗು);

#ಆದರೆ_ಅಂತ್ಯ
#ಆದರೆ_ಅಂತ್ಯ
