#నిర్వచితం_కాకపోతే BLAS_H
#నిర్వచించు BLAS_H
#అన్తర్భావ "darknet.h"

శూన్య flatten(దశాంశం *x, పూర్ణాంకం కొలత, పూర్ణాంకం layers, పూర్ణాంకం batch, పూర్ణాంకం forward);
శూన్య pm(పూర్ణాంకం M, పూర్ణాంకం N, దశాంశం *A);
దశాంశం *random_మాతృక(పూర్ణాంకం అడ్డువరుసలు, పూర్ణాంకం నిలువుల_సంఖ్య);
శూన్య సమయం_random_మాతృక(పూర్ణాంకం TA, పూర్ణాంకం TB, పూర్ణాంకం m, పూర్ణాంకం k, పూర్ణాంకం n);
శూన్య reorg_cpu(దశాంశం *x, పూర్ణాంకం w, పూర్ణాంకం h, పూర్ణాంకం c, పూర్ణాంకం batch, పూర్ణాంకం stride, పూర్ణాంకం forward, దశాంశం *బహిర్గతం);

శూన్య test_blas();

శూన్య inter_cpu(పూర్ణాంకం NX, దశాంశం *X, పూర్ణాంకం NY, దశాంశం *Y, పూర్ణాంకం B, దశాంశం *బహిర్గతం_2);
శూన్య deinter_cpu(పూర్ణాంకం NX, దశాంశం *X, పూర్ణాంకం NY, దశాంశం *Y, పూర్ణాంకం B, దశాంశం *బహిర్గతం_2);
శూన్య mult_కూడు_into_cpu(పూర్ణాంకం N, దశాంశం *X, దశాంశం *Y, దశాంశం *Z);

శూన్య const_cpu(పూర్ణాంకం N, దశాంశం ALPHA, దశాంశం *X, పూర్ణాంకం INCX);
శూన్య constrain_gpu(పూర్ణాంకం N, దశాంశం ALPHA, దశాంశం * X, పూర్ణాంకం INCX);
శూన్య pow_cpu(పూర్ణాంకం N, దశాంశం ALPHA, దశాంశం *X, పూర్ణాంకం INCX, దశాంశం *Y, పూర్ణాంకం INCY);
శూన్య mul_cpu(పూర్ణాంకం N, దశాంశం *X, పూర్ణాంకం INCX, దశాంశం *Y, పూర్ణాంకం INCY);

పూర్ణాంకం test_gpu_blas();
శూన్య shortcut_cpu(పూర్ణాంకం batch, పూర్ణాంకం w1, పూర్ణాంకం h1, పూర్ణాంకం c1, దశాంశం *కూడు, పూర్ణాంకం w2, పూర్ణాంకం h2, పూర్ణాంకం c2, దశాంశం s1, దశాంశం s2, దశాంశం *బహిర్గతం);

శూన్య సగటు_cpu(దశాంశం *x, పూర్ణాంకం batch, పూర్ణాంకం filters, పూర్ణాంకం spatial, దశాంశం *సగటు);
శూన్య variance_cpu(దశాంశం *x, దశాంశం *సగటు, పూర్ణాంకం batch, పూర్ణాంకం filters, పూర్ణాంకం spatial, దశాంశం *variance);

శూన్య scale_bias(దశాంశం *output, దశాంశం *scales, పూర్ణాంకం batch, పూర్ణాంకం n, పూర్ణాంకం కొలత);
శూన్య backward_scale_cpu(దశాంశం *x_norm, దశాంశం *delta, పూర్ణాంకం batch, పూర్ణాంకం n, పూర్ణాంకం కొలత, దశాంశం *scale_updates);
శూన్య సగటు_delta_cpu(దశాంశం *delta, దశాంశం *variance, పూర్ణాంకం batch, పూర్ణాంకం filters, పూర్ణాంకం spatial, దశాంశం *సగటు_delta);
శూన్య  variance_delta_cpu(దశాంశం *x, దశాంశం *delta, దశాంశం *సగటు, దశాంశం *variance, పూర్ణాంకం batch, పూర్ణాంకం filters, పూర్ణాంకం spatial, దశాంశం *variance_delta);
శూన్య normalize_delta_cpu(దశాంశం *x, దశాంశం *సగటు, దశాంశం *variance, దశాంశం *సగటు_delta, దశాంశం *variance_delta, పూర్ణాంకం batch, పూర్ణాంకం filters, పూర్ణాంకం spatial, దశాంశం *delta);
శూన్య l2normalize_cpu(దశాంశం *x, దశాంశం *dx, పూర్ణాంకం batch, పూర్ణాంకం filters, పూర్ణాంకం spatial);

శూన్య smooth_l1_cpu(పూర్ణాంకం n, దశాంశం *pred, దశాంశం *truth, దశాంశం *delta, దశాంశం *error);
శూన్య l2_cpu(పూర్ణాంకం n, దశాంశం *pred, దశాంశం *truth, దశాంశం *delta, దశాంశం *error);
శూన్య l1_cpu(పూర్ణాంకం n, దశాంశం *pred, దశాంశం *truth, దశాంశం *delta, దశాంశం *error);
శూన్య logistic_x_ent_cpu(పూర్ణాంకం n, దశాంశం *pred, దశాంశం *truth, దశాంశం *delta, దశాంశం *error);
శూన్య softmax_x_ent_cpu(పూర్ణాంకం n, దశాంశం *pred, దశాంశం *truth, దశాంశం *delta, దశాంశం *error);
శూన్య weighted_కూడిక_cpu(దశాంశం *a, దశాంశం *b, దశాంశం *s, పూర్ణాంకం అంకె, దశాంశం *c);
శూన్య weighted_delta_cpu(దశాంశం *a, దశాంశం *b, దశాంశం *s, దశాంశం *da, దశాంశం *db, దశాంశం *ds, పూర్ణాంకం n, దశాంశం *dc);

శూన్య softmax(దశాంశం *ఆదానం, పూర్ణాంకం n, దశాంశం తాత్కాలిక, పూర్ణాంకం stride, దశాంశం *output);
శూన్య softmax_cpu(దశాంశం *ఆదానం, పూర్ణాంకం n, పూర్ణాంకం batch, పూర్ణాంకం batch_స్థానభ్రంశం, పూర్ణాంకం groups, పూర్ణాంకం సమూహం_స్థానభ్రంశం, పూర్ణాంకం stride, దశాంశం తాత్కాలిక, దశాంశం *output);
శూన్య upsample_cpu(దశాంశం *లోపల, పూర్ణాంకం w, పూర్ణాంకం h, పూర్ణాంకం c, పూర్ణాంకం batch, పూర్ణాంకం stride, పూర్ణాంకం forward, దశాంశం scale, దశాంశం *బహిర్గతం);

#నిర్వచితమైతే GPU
#అన్తర్భావ "cuda.h"
#అన్తర్భావ "tree.h"

శూన్య axpy_gpu(పూర్ణాంకం N, దశాంశం ALPHA, దశాంశం * X, పూర్ణాంకం INCX, దశాంశం * Y, పూర్ణాంకం INCY);
శూన్య axpy_gpu_స్థానభ్రంశం(పూర్ణాంకం N, దశాంశం ALPHA, దశాంశం * X, పూర్ణాంకం OFFX, పూర్ణాంకం INCX, దశాంశం * Y, పూర్ణాంకం OFFY, పూర్ణాంకం INCY);
శూన్య copy_gpu(పూర్ణాంకం N, దశాంశం * X, పూర్ణాంకం INCX, దశాంశం * Y, పూర్ణాంకం INCY);
శూన్య copy_gpu_స్థానభ్రంశం(పూర్ణాంకం N, దశాంశం * X, పూర్ణాంకం OFFX, పూర్ణాంకం INCX, దశాంశం * Y, పూర్ణాంకం OFFY, పూర్ణాంకం INCY);
శూన్య కూడు_gpu(పూర్ణాంకం N, దశాంశం ALPHA, దశాంశం * X, పూర్ణాంకం INCX);
శూన్య supp_gpu(పూర్ణాంకం N, దశాంశం ALPHA, దశాంశం * X, పూర్ణాంకం INCX);
శూన్య ముసుగు_gpu(పూర్ణాంకం N, దశాంశం * X, దశాంశం ముసుగు_అంకె, దశాంశం * ముసుగు, దశాంశం val);
శూన్య scale_ముసుగు_gpu(పూర్ణాంకం N, దశాంశం * X, దశాంశం ముసుగు_అంకె, దశాంశం * ముసుగు, దశాంశం scale);
శూన్య const_gpu(పూర్ణాంకం N, దశాంశం ALPHA, దశాంశం *X, పూర్ణాంకం INCX);
శూన్య pow_gpu(పూర్ణాంకం N, దశాంశం ALPHA, దశాంశం *X, పూర్ణాంకం INCX, దశాంశం *Y, పూర్ణాంకం INCY);
శూన్య mul_gpu(పూర్ణాంకం N, దశాంశం *X, పూర్ణాంకం INCX, దశాంశం *Y, పూర్ణాంకం INCY);

శూన్య సగటు_gpu(దశాంశం *x, పూర్ణాంకం batch, పూర్ణాంకం filters, పూర్ణాంకం spatial, దశాంశం *సగటు);
శూన్య variance_gpu(దశాంశం *x, దశాంశం *సగటు, పూర్ణాంకం batch, పూర్ణాంకం filters, పూర్ణాంకం spatial, దశాంశం *variance);
శూన్య normalize_gpu(దశాంశం *x, దశాంశం *సగటు, దశాంశం *variance, పూర్ణాంకం batch, పూర్ణాంకం filters, పూర్ణాంకం spatial);
శూన్య l2normalize_gpu(దశాంశం *x, దశాంశం *dx, పూర్ణాంకం batch, పూర్ణాంకం filters, పూర్ణాంకం spatial);

శూన్య normalize_delta_gpu(దశాంశం *x, దశాంశం *సగటు, దశాంశం *variance, దశాంశం *సగటు_delta, దశాంశం *variance_delta, పూర్ణాంకం batch, పూర్ణాంకం filters, పూర్ణాంకం spatial, దశాంశం *delta);

శూన్య fast_సగటు_delta_gpu(దశాంశం *delta, దశాంశం *variance, పూర్ణాంకం batch, పూర్ణాంకం filters, పూర్ణాంకం spatial, దశాంశం *సగటు_delta);
శూన్య fast_variance_delta_gpu(దశాంశం *x, దశాంశం *delta, దశాంశం *సగటు, దశాంశం *variance, పూర్ణాంకం batch, పూర్ణాంకం filters, పూర్ణాంకం spatial, దశాంశం *variance_delta);

శూన్య fast_variance_gpu(దశాంశం *x, దశాంశం *సగటు, పూర్ణాంకం batch, పూర్ణాంకం filters, పూర్ణాంకం spatial, దశాంశం *variance);
శూన్య fast_సగటు_gpu(దశాంశం *x, పూర్ణాంకం batch, పూర్ణాంకం filters, పూర్ణాంకం spatial, దశాంశం *సగటు);
శూన్య shortcut_gpu(పూర్ణాంకం batch, పూర్ణాంకం w1, పూర్ణాంకం h1, పూర్ణాంకం c1, దశాంశం *కూడు, పూర్ణాంకం w2, పూర్ణాంకం h2, పూర్ణాంకం c2, దశాంశం s1, దశాంశం s2, దశాంశం *బహిర్గతం);
శూన్య scale_bias_gpu(దశాంశం *output, దశాంశం *biases, పూర్ణాంకం batch, పూర్ణాంకం n, పూర్ణాంకం కొలత);
శూన్య backward_scale_gpu(దశాంశం *x_norm, దశాంశం *delta, పూర్ణాంకం batch, పూర్ణాంకం n, పూర్ణాంకం కొలత, దశాంశం *scale_updates);
శూన్య scale_bias_gpu(దశాంశం *output, దశాంశం *biases, పూర్ణాంకం batch, పూర్ణాంకం n, పూర్ణాంకం కొలత);
శూన్య కూడు_bias_gpu(దశాంశం *output, దశాంశం *biases, పూర్ణాంకం batch, పూర్ణాంకం n, పూర్ణాంకం కొలత);
శూన్య backward_bias_gpu(దశాంశం *bias_updates, దశాంశం *delta, పూర్ణాంకం batch, పూర్ణాంకం n, పూర్ణాంకం కొలత);

శూన్య logistic_x_ent_gpu(పూర్ణాంకం n, దశాంశం *pred, దశాంశం *truth, దశాంశం *delta, దశాంశం *error);
శూన్య softmax_x_ent_gpu(పూర్ణాంకం n, దశాంశం *pred, దశాంశం *truth, దశాంశం *delta, దశాంశం *error);
శూన్య smooth_l1_gpu(పూర్ణాంకం n, దశాంశం *pred, దశాంశం *truth, దశాంశం *delta, దశాంశం *error);
శూన్య l2_gpu(పూర్ణాంకం n, దశాంశం *pred, దశాంశం *truth, దశాంశం *delta, దశాంశం *error);
శూన్య l1_gpu(పూర్ణాంకం n, దశాంశం *pred, దశాంశం *truth, దశాంశం *delta, దశాంశం *error);
శూన్య wgan_gpu(పూర్ణాంకం n, దశాంశం *pred, దశాంశం *truth, దశాంశం *delta, దశాంశం *error);
శూన్య weighted_delta_gpu(దశాంశం *a, దశాంశం *b, దశాంశం *s, దశాంశం *da, దశాంశం *db, దశాంశం *ds, పూర్ణాంకం అంకె, దశాంశం *dc);
శూన్య weighted_కూడిక_gpu(దశాంశం *a, దశాంశం *b, దశాంశం *s, పూర్ణాంకం అంకె, దశాంశం *c);
శూన్య mult_కూడు_into_gpu(పూర్ణాంకం అంకె, దశాంశం *a, దశాంశం *b, దశాంశం *c);
శూన్య inter_gpu(పూర్ణాంకం NX, దశాంశం *X, పూర్ణాంకం NY, దశాంశం *Y, పూర్ణాంకం B, దశాంశం *బహిర్గతం_2);
శూన్య deinter_gpu(పూర్ణాంకం NX, దశాంశం *X, పూర్ణాంకం NY, దశాంశం *Y, పూర్ణాంకం B, దశాంశం *బహిర్గతం_2);

శూన్య reorg_gpu(దశాంశం *x, పూర్ణాంకం w, పూర్ణాంకం h, పూర్ణాంకం c, పూర్ణాంకం batch, పూర్ణాంకం stride, పూర్ణాంకం forward, దశాంశం *బహిర్గతం);

శూన్య softmax_gpu(దశాంశం *ఆదానం, పూర్ణాంకం n, పూర్ణాంకం batch, పూర్ణాంకం batch_స్థానభ్రంశం, పూర్ణాంకం groups, పూర్ణాంకం సమూహం_స్థానభ్రంశం, పూర్ణాంకం stride, దశాంశం తాత్కాలిక, దశాంశం *output);
శూన్య adam_update_gpu(దశాంశం *w, దశాంశం *d, దశాంశం *m, దశాంశం *v, దశాంశం B1, దశాంశం B2, దశాంశం eps, దశాంశం decay, దశాంశం రేటు, పూర్ణాంకం n, పూర్ణాంకం batch, పూర్ణాంకం t);
శూన్య adam_gpu(పూర్ణాంకం n, దశాంశం *x, దశాంశం *m, దశాంశం *v, దశాంశం B1, దశాంశం B2, దశాంశం రేటు, దశాంశం eps, పూర్ణాంకం t);

శూన్య flatten_gpu(దశాంశం *x, పూర్ణాంకం spatial, పూర్ణాంకం layers, పూర్ణాంకం batch, పూర్ణాంకం forward, దశాంశం *బహిర్గతం);
శూన్య softmax_వృక్షం(దశాంశం *ఆదానం, పూర్ణాంకం spatial, పూర్ణాంకం batch, పూర్ణాంకం stride, దశాంశం తాత్కాలిక, దశాంశం *output, వృక్షం hier);
శూన్య upsample_gpu(దశాంశం *లోపల, పూర్ణాంకం w, పూర్ణాంకం h, పూర్ణాంకం c, పూర్ణాంకం batch, పూర్ణాంకం stride, పూర్ణాంకం forward, దశాంశం scale, దశాంశం *బహిర్గతం);

#అయితే_ముగింపు
#అయితే_ముగింపు
