#ವ್ಯಾಖ್ಯಾನಿತವಾಗದಿದ್ದರೆ ದತ್ತಾಂಶ_H
#ವ್ಯಾಖ್ಯಾನಿಸು ದತ್ತಾಂಶ_H
#ಅನ್ತರ್ಭಾವ <pthread.h>

#ಅನ್ತರ್ಭಾವ "darknet.h"
#ಅನ್ತರ್ಭಾವ "matrix.h"
#ಅನ್ತರ್ಭಾವ "list.h"
#ಅನ್ತರ್ಭಾವ "image.h"
#ಅನ್ತರ್ಭಾವ "tree.h"

ಸ್ಥಿರ ಸಾಲೊಳಗೆ ದಶಮಾಂಶ ದೂರ_from_ಅಂಚು(ಪೂರ್ಣಾಂಕ x, ಪೂರ್ಣಾಂಕ max)
{
    ಪೂರ್ಣಾಂಕ dx = (max/2) - x;
    ಆದರೆ (dx < 0) dx = -dx;
    dx = (max/2) + 1 - dx;
    dx *= 2;
    ದಶಮಾಂಶ dist = (ದಶಮಾಂಶ)dx/max;
    ಆದರೆ (dist > 1) dist = 1;
    ಹಿಂತಿರುಗಿ dist;
}
ಶೂನ್ಯ ತುಂಬು_ದತ್ತಾಂಶ_blocking(ತುಂಬು_ವಾದಗಳು ವಾದಗಳು);


ಶೂನ್ಯ print_letters(ದಶಮಾಂಶ *pred, ಪೂರ್ಣಾಂಕ n);
ದತ್ತಾಂಶ ತುಂಬು_ದತ್ತಾಂಶ_captcha(ಅಕ್ಷರ **paths, ಪೂರ್ಣಾಂಕ n, ಪೂರ್ಣಾಂಕ m, ಪೂರ್ಣಾಂಕ k, ಪೂರ್ಣಾಂಕ w, ಪೂರ್ಣಾಂಕ h);
ದತ್ತಾಂಶ ತುಂಬು_ದತ್ತಾಂಶ_captcha_encode(ಅಕ್ಷರ **paths, ಪೂರ್ಣಾಂಕ n, ಪೂರ್ಣಾಂಕ m, ಪೂರ್ಣಾಂಕ w, ಪೂರ್ಣಾಂಕ h);
ದತ್ತಾಂಶ ತುಂಬು_ದತ್ತಾಂಶ_detection(ಪೂರ್ಣಾಂಕ n, ಅಕ್ಷರ **paths, ಪೂರ್ಣಾಂಕ m, ಪೂರ್ಣಾಂಕ w, ಪೂರ್ಣಾಂಕ h, ಪೂರ್ಣಾಂಕ boxes, ಪೂರ್ಣಾಂಕ classes, ದಶಮಾಂಶ jitter, ದಶಮಾಂಶ hue, ದಶಮಾಂಶ saturation, ದಶಮಾಂಶ exposure);
ದತ್ತಾಂಶ ತುಂಬು_ದತ್ತಾಂಶ_ಟ್ಯಾಗ್(ಅಕ್ಷರ **paths, ಪೂರ್ಣಾಂಕ n, ಪೂರ್ಣಾಂಕ m, ಪೂರ್ಣಾಂಕ k, ಪೂರ್ಣಾಂಕ min, ಪೂರ್ಣಾಂಕ max, ಪೂರ್ಣಾಂಕ ಗಾತ್ರ_2, ದಶಮಾಂಶ angle, ದಶಮಾಂಶ aspect, ದಶಮಾಂಶ hue, ದಶಮಾಂಶ saturation, ದಶಮಾಂಶ exposure);
ಮಾತೃಕೆ ತುಂಬು_image_augment_paths(ಅಕ್ಷರ **paths, ಪೂರ್ಣಾಂಕ n, ಪೂರ್ಣಾಂಕ min, ಪೂರ್ಣಾಂಕ max, ಪೂರ್ಣಾಂಕ ಗಾತ್ರ_2, ದಶಮಾಂಶ angle, ದಶಮಾಂಶ aspect, ದಶಮಾಂಶ hue, ದಶಮಾಂಶ saturation, ದಶಮಾಂಶ exposure, ಪೂರ್ಣಾಂಕ center);
ದತ್ತಾಂಶ ತುಂಬು_ದತ್ತಾಂಶ_super(ಅಕ್ಷರ **paths, ಪೂರ್ಣಾಂಕ n, ಪೂರ್ಣಾಂಕ m, ಪೂರ್ಣಾಂಕ w, ಪೂರ್ಣಾಂಕ h, ಪೂರ್ಣಾಂಕ scale);
ದತ್ತಾಂಶ ತುಂಬು_ದತ್ತಾಂಶ_augment(ಅಕ್ಷರ **paths, ಪೂರ್ಣಾಂಕ n, ಪೂರ್ಣಾಂಕ m, ಅಕ್ಷರ **labels, ಪೂರ್ಣಾಂಕ k, ವೃಕ್ಷ *hierarchy, ಪೂರ್ಣಾಂಕ min, ಪೂರ್ಣಾಂಕ max, ಪೂರ್ಣಾಂಕ ಗಾತ್ರ_2, ದಶಮಾಂಶ angle, ದಶಮಾಂಶ aspect, ದಶಮಾಂಶ hue, ದಶಮಾಂಶ saturation, ದಶಮಾಂಶ exposure, ಪೂರ್ಣಾಂಕ center);
ದತ್ತಾಂಶ ತುಂಬು_ದತ್ತಾಂಶ_regression(ಅಕ್ಷರ **paths, ಪೂರ್ಣಾಂಕ n, ಪೂರ್ಣಾಂಕ m, ಪೂರ್ಣಾಂಕ classes, ಪೂರ್ಣಾಂಕ min, ಪೂರ್ಣಾಂಕ max, ಪೂರ್ಣಾಂಕ ಗಾತ್ರ_2, ದಶಮಾಂಶ angle, ದಶಮಾಂಶ aspect, ದಶಮಾಂಶ hue, ದಶಮಾಂಶ saturation, ದಶಮಾಂಶ exposure);
ದತ್ತಾಂಶ ತುಂಬು_go(ಅಕ್ಷರ *filename);


ದತ್ತಾಂಶ ತುಂಬು_ದತ್ತಾಂಶ_writing(ಅಕ್ಷರ **paths, ಪೂರ್ಣಾಂಕ n, ಪೂರ್ಣಾಂಕ m, ಪೂರ್ಣಾಂಕ w, ಪೂರ್ಣಾಂಕ h, ಪೂರ್ಣಾಂಕ ಹೊರಹೋಗು_w, ಪೂರ್ಣಾಂಕ ಹೊರಹೋಗು_h);

ಶೂನ್ಯ get_random_batch(ದತ್ತಾಂಶ d, ಪೂರ್ಣಾಂಕ n, ದಶಮಾಂಶ *X, ದಶಮಾಂಶ *y);
ದತ್ತಾಂಶ get_ದತ್ತಾಂಶ_part(ದತ್ತಾಂಶ d, ಪೂರ್ಣಾಂಕ part, ಪೂರ್ಣಾಂಕ ಒಟ್ಟು);
ದತ್ತಾಂಶ get_random_ದತ್ತಾಂಶ(ದತ್ತಾಂಶ d, ಪೂರ್ಣಾಂಕ ಅಂಕೆ);
ದತ್ತಾಂಶ ತುಂಬು_categorical_ದತ್ತಾಂಶ_csv(ಅಕ್ಷರ *filename, ಪೂರ್ಣಾಂಕ ಗುರಿ, ಪೂರ್ಣಾಂಕ k);
ಶೂನ್ಯ normalize_ದತ್ತಾಂಶ_ಅಡ್ಡಸಾಲುಗಳು(ದತ್ತಾಂಶ d);
ಶೂನ್ಯ scale_ದತ್ತಾಂಶ_ಅಡ್ಡಸಾಲುಗಳು(ದತ್ತಾಂಶ d, ದಶಮಾಂಶ s);
ಶೂನ್ಯ translate_ದತ್ತಾಂಶ_ಅಡ್ಡಸಾಲುಗಳು(ದತ್ತಾಂಶ d, ದಶಮಾಂಶ s);
ಶೂನ್ಯ randomize_ದತ್ತಾಂಶ(ದತ್ತಾಂಶ d);
ದತ್ತಾಂಶ *ವಿಭಜಿಸು_ದತ್ತಾಂಶ(ದತ್ತಾಂಶ d, ಪೂರ್ಣಾಂಕ part, ಪೂರ್ಣಾಂಕ ಒಟ್ಟು);
ದತ್ತಾಂಶ concat_datas(ದತ್ತಾಂಶ *d, ಪೂರ್ಣಾಂಕ n);
ಶೂನ್ಯ fill_truth(ಅಕ್ಷರ *ಮಾರ್ಗ, ಅಕ್ಷರ **labels, ಪೂರ್ಣಾಂಕ k, ದಶಮಾಂಶ *truth);

#ಆದರೆ_ಅಂತ್ಯ
