#यदि_अपरिभाषितम् GEMM_H
#परिभाषय GEMM_H

शून्य gemm_bin(पूर्णाङ्क M, पूर्णाङ्क N, पूर्णाङ्क K, भिन्न ALPHA, 
        वर्ण  *A, पूर्णाङ्क lda, 
        भिन्न *B, पूर्णाङ्क ldb,
        भिन्न *C, पूर्णाङ्क ldc);
        
शून्य gemm(पूर्णाङ्क TA, पूर्णाङ्क TB, पूर्णाङ्क M, पूर्णाङ्क N, पूर्णाङ्क K, भिन्न ALPHA, 
                    भिन्न *A, पूर्णाङ्क lda, 
                    भिन्न *B, पूर्णाङ्क ldb,
                    भिन्न BETA,
                    भिन्न *C, पूर्णाङ्क ldc);

शून्य gemm_cpu(पूर्णाङ्क TA, पूर्णाङ्क TB, पूर्णाङ्क M, पूर्णाङ्क N, पूर्णाङ्क K, भिन्न ALPHA, 
        भिन्न *A, पूर्णाङ्क lda, 
        भिन्न *B, पूर्णाङ्क ldb,
        भिन्न BETA,
        भिन्न *C, पूर्णाङ्क ldc);

#यदि_परिभाषितम् GPU
शून्य gemm_gpu(पूर्णाङ्क TA, पूर्णाङ्क TB, पूर्णाङ्क M, पूर्णाङ्क N, पूर्णाङ्क K, भिन्न ALPHA, 
        भिन्न *A_gpu, पूर्णाङ्क lda, 
        भिन्न *B_gpu, पूर्णाङ्क ldb,
        भिन्न BETA,
        भिन्न *C_gpu, पूर्णाङ्क ldc);

शून्य gemm_gpu(पूर्णाङ्क TA, पूर्णाङ्क TB, पूर्णाङ्क M, पूर्णाङ्क N, पूर्णाङ्क K, भिन्न ALPHA, 
        भिन्न *A, पूर्णाङ्क lda, 
        भिन्न *B, पूर्णाङ्क ldb,
        भिन्न BETA,
        भिन्न *C, पूर्णाङ्क ldc);
#यदि_अन्तः
#यदि_अन्तः
