#ifndef GEMM_H
#define GEMM_H

ଶୂନ୍ୟ gemm_bin(ପୂର୍ଣ୍ଣସଂଖ୍ୟା M, ପୂର୍ଣ୍ଣସଂଖ୍ୟା N, ପୂର୍ଣ୍ଣସଂଖ୍ୟା K, ଦଶମିକ ALPHA, 
        ଅକ୍ଷର  *A, ପୂର୍ଣ୍ଣସଂଖ୍ୟା lda, 
        ଦଶମିକ *B, ପୂର୍ଣ୍ଣସଂଖ୍ୟା ldb,
        ଦଶମିକ *C, ପୂର୍ଣ୍ଣସଂଖ୍ୟା ldc);
        
ଶୂନ୍ୟ gemm(ପୂର୍ଣ୍ଣସଂଖ୍ୟା TA, ପୂର୍ଣ୍ଣସଂଖ୍ୟା TB, ପୂର୍ଣ୍ଣସଂଖ୍ୟା M, ପୂର୍ଣ୍ଣସଂଖ୍ୟା N, ପୂର୍ଣ୍ଣସଂଖ୍ୟା K, ଦଶମିକ ALPHA, 
                    ଦଶମିକ *A, ପୂର୍ଣ୍ଣସଂଖ୍ୟା lda, 
                    ଦଶମିକ *B, ପୂର୍ଣ୍ଣସଂଖ୍ୟା ldb,
                    ଦଶମିକ BETA,
                    ଦଶମିକ *C, ପୂର୍ଣ୍ଣସଂଖ୍ୟା ldc);

ଶୂନ୍ୟ gemm_cpu(ପୂର୍ଣ୍ଣସଂଖ୍ୟା TA, ପୂର୍ଣ୍ଣସଂଖ୍ୟା TB, ପୂର୍ଣ୍ଣସଂଖ୍ୟା M, ପୂର୍ଣ୍ଣସଂଖ୍ୟା N, ପୂର୍ଣ୍ଣସଂଖ୍ୟା K, ଦଶମିକ ALPHA, 
        ଦଶମିକ *A, ପୂର୍ଣ୍ଣସଂଖ୍ୟା lda, 
        ଦଶମିକ *B, ପୂର୍ଣ୍ଣସଂଖ୍ୟା ldb,
        ଦଶମିକ BETA,
        ଦଶମିକ *C, ପୂର୍ଣ୍ଣସଂଖ୍ୟା ldc);

#ifdef GPU
ଶୂନ୍ୟ gemm_gpu(ପୂର୍ଣ୍ଣସଂଖ୍ୟା TA, ପୂର୍ଣ୍ଣସଂଖ୍ୟା TB, ପୂର୍ଣ୍ଣସଂଖ୍ୟା M, ପୂର୍ଣ୍ଣସଂଖ୍ୟା N, ପୂର୍ଣ୍ଣସଂଖ୍ୟା K, ଦଶମିକ ALPHA, 
        ଦଶମିକ *A_gpu, ପୂର୍ଣ୍ଣସଂଖ୍ୟା lda, 
        ଦଶମିକ *B_gpu, ପୂର୍ଣ୍ଣସଂଖ୍ୟା ldb,
        ଦଶମିକ BETA,
        ଦଶମିକ *C_gpu, ପୂର୍ଣ୍ଣସଂଖ୍ୟା ldc);

ଶୂନ୍ୟ gemm_gpu(ପୂର୍ଣ୍ଣସଂଖ୍ୟା TA, ପୂର୍ଣ୍ଣସଂଖ୍ୟା TB, ପୂର୍ଣ୍ଣସଂଖ୍ୟା M, ପୂର୍ଣ୍ଣସଂଖ୍ୟା N, ପୂର୍ଣ୍ଣସଂଖ୍ୟା K, ଦଶମିକ ALPHA, 
        ଦଶମିକ *A, ପୂର୍ଣ୍ଣସଂଖ୍ୟା lda, 
        ଦଶମିକ *B, ପୂର୍ଣ୍ଣସଂଖ୍ୟା ldb,
        ଦଶମିକ BETA,
        ଦଶମିକ *C, ପୂର୍ଣ୍ଣସଂଖ୍ୟା ldc);
#endif
#endif
