#ifndef GEMM_H
#define GEMM_H

শূন্য gemm_bin(পূর্ণাঙ্ক M, পূর্ণাঙ্ক N, পূর্ণাঙ্ক K, ভিন্ন ALPHA, 
        ৱর্ণ  *A, পূর্ণাঙ্ক lda, 
        ভিন্ন *B, পূর্ণাঙ্ক ldb,
        ভিন্ন *C, পূর্ণাঙ্ক ldc);
        
শূন্য gemm(পূর্ণাঙ্ক TA, পূর্ণাঙ্ক TB, পূর্ণাঙ্ক M, পূর্ণাঙ্ক N, পূর্ণাঙ্ক K, ভিন্ন ALPHA, 
                    ভিন্ন *A, পূর্ণাঙ্ক lda, 
                    ভিন্ন *B, পূর্ণাঙ্ক ldb,
                    ভিন্ন BETA,
                    ভিন্ন *C, পূর্ণাঙ্ক ldc);

শূন্য gemm_cpu(পূর্ণাঙ্ক TA, পূর্ণাঙ্ক TB, পূর্ণাঙ্ক M, পূর্ণাঙ্ক N, পূর্ণাঙ্ক K, ভিন্ন ALPHA, 
        ভিন্ন *A, পূর্ণাঙ্ক lda, 
        ভিন্ন *B, পূর্ণাঙ্ক ldb,
        ভিন্ন BETA,
        ভিন্ন *C, পূর্ণাঙ্ক ldc);

#ifdef GPU
শূন্য gemm_gpu(পূর্ণাঙ্ক TA, পূর্ণাঙ্ক TB, পূর্ণাঙ্ক M, পূর্ণাঙ্ক N, পূর্ণাঙ্ক K, ভিন্ন ALPHA, 
        ভিন্ন *A_gpu, পূর্ণাঙ্ক lda, 
        ভিন্ন *B_gpu, পূর্ণাঙ্ক ldb,
        ভিন্ন BETA,
        ভিন্ন *C_gpu, পূর্ণাঙ্ক ldc);

শূন্য gemm_gpu(পূর্ণাঙ্ক TA, পূর্ণাঙ্ক TB, পূর্ণাঙ্ক M, পূর্ণাঙ্ক N, পূর্ণাঙ্ক K, ভিন্ন ALPHA, 
        ভিন্ন *A, পূর্ণাঙ্ক lda, 
        ভিন্ন *B, পূর্ণাঙ্ক ldb,
        ভিন্ন BETA,
        ভিন্ন *C, পূর্ণাঙ্ক ldc);
#endif
#endif
