#اگر_غیر_تعریف_شدہ GEMM_H
#تعریف_کرو GEMM_H

خالی gemm_bin(صحیح M, صحیح N, صحیح K, اعشاری ALPHA, 
        حرف  *A, صحیح lda, 
        اعشاری *B, صحیح ldb,
        اعشاری *C, صحیح ldc);
        
خالی gemm(صحیح TA, صحیح TB, صحیح M, صحیح N, صحیح K, اعشاری ALPHA, 
                    اعشاری *A, صحیح lda, 
                    اعشاری *B, صحیح ldb,
                    اعشاری BETA,
                    اعشاری *C, صحیح ldc);

خالی gemm_cpu(صحیح TA, صحیح TB, صحیح M, صحیح N, صحیح K, اعشاری ALPHA, 
        اعشاری *A, صحیح lda, 
        اعشاری *B, صحیح ldb,
        اعشاری BETA,
        اعشاری *C, صحیح ldc);

#اگر_تعریف_شدہ GPU
خالی gemm_gpu(صحیح TA, صحیح TB, صحیح M, صحیح N, صحیح K, اعشاری ALPHA, 
        اعشاری *A_gpu, صحیح lda, 
        اعشاری *B_gpu, صحیح ldb,
        اعشاری BETA,
        اعشاری *C_gpu, صحیح ldc);

خالی gemm_gpu(صحیح TA, صحیح TB, صحیح M, صحیح N, صحیح K, اعشاری ALPHA, 
        اعشاری *A, صحیح lda, 
        اعشاری *B, صحیح ldb,
        اعشاری BETA,
        اعشاری *C, صحیح ldc);
#اگر_ختم
#اگر_ختم
