#ifndef GEMM_H
#define GEMM_H

শূন্য gemm_bin(পূর্ণসংখ্যা M, পূর্ণসংখ্যা N, পূর্ণসংখ্যা K, দশমিক ALPHA, 
        অক্ষর  *A, পূর্ণসংখ্যা lda, 
        দশমিক *B, পূর্ণসংখ্যা ldb,
        দশমিক *C, পূর্ণসংখ্যা ldc);
        
শূন্য gemm(পূর্ণসংখ্যা TA, পূর্ণসংখ্যা TB, পূর্ণসংখ্যা M, পূর্ণসংখ্যা N, পূর্ণসংখ্যা K, দশমিক ALPHA, 
                    দশমিক *A, পূর্ণসংখ্যা lda, 
                    দশমিক *B, পূর্ণসংখ্যা ldb,
                    দশমিক BETA,
                    দশমিক *C, পূর্ণসংখ্যা ldc);

শূন্য gemm_cpu(পূর্ণসংখ্যা TA, পূর্ণসংখ্যা TB, পূর্ণসংখ্যা M, পূর্ণসংখ্যা N, পূর্ণসংখ্যা K, দশমিক ALPHA, 
        দশমিক *A, পূর্ণসংখ্যা lda, 
        দশমিক *B, পূর্ণসংখ্যা ldb,
        দশমিক BETA,
        দশমিক *C, পূর্ণসংখ্যা ldc);

#ifdef GPU
শূন্য gemm_gpu(পূর্ণসংখ্যা TA, পূর্ণসংখ্যা TB, পূর্ণসংখ্যা M, পূর্ণসংখ্যা N, পূর্ণসংখ্যা K, দশমিক ALPHA, 
        দশমিক *A_gpu, পূর্ণসংখ্যা lda, 
        দশমিক *B_gpu, পূর্ণসংখ্যা ldb,
        দশমিক BETA,
        দশমিক *C_gpu, পূর্ণসংখ্যা ldc);

শূন্য gemm_gpu(পূর্ণসংখ্যা TA, পূর্ণসংখ্যা TB, পূর্ণসংখ্যা M, পূর্ণসংখ্যা N, পূর্ণসংখ্যা K, দশমিক ALPHA, 
        দশমিক *A, পূর্ণসংখ্যা lda, 
        দশমিক *B, পূর্ণসংখ্যা ldb,
        দশমিক BETA,
        দশমিক *C, পূর্ণসংখ্যা ldc);
#endif
#endif
