#ifndef GEMM_H
#define GEMM_H

શૂન્ય gemm_bin(પૂર્ણાંક M, પૂર્ણાંક N, પૂર્ણાંક K, દશાંશ ALPHA, 
        અક્ષર  *A, પૂર્ણાંક lda, 
        દશાંશ *B, પૂર્ણાંક ldb,
        દશાંશ *C, પૂર્ણાંક ldc);
        
શૂન્ય gemm(પૂર્ણાંક TA, પૂર્ણાંક TB, પૂર્ણાંક M, પૂર્ણાંક N, પૂર્ણાંક K, દશાંશ ALPHA, 
                    દશાંશ *A, પૂર્ણાંક lda, 
                    દશાંશ *B, પૂર્ણાંક ldb,
                    દશાંશ BETA,
                    દશાંશ *C, પૂર્ણાંક ldc);

શૂન્ય gemm_cpu(પૂર્ણાંક TA, પૂર્ણાંક TB, પૂર્ણાંક M, પૂર્ણાંક N, પૂર્ણાંક K, દશાંશ ALPHA, 
        દશાંશ *A, પૂર્ણાંક lda, 
        દશાંશ *B, પૂર્ણાંક ldb,
        દશાંશ BETA,
        દશાંશ *C, પૂર્ણાંક ldc);

#ifdef GPU
શૂન્ય gemm_gpu(પૂર્ણાંક TA, પૂર્ણાંક TB, પૂર્ણાંક M, પૂર્ણાંક N, પૂર્ણાંક K, દશાંશ ALPHA, 
        દશાંશ *A_gpu, પૂર્ણાંક lda, 
        દશાંશ *B_gpu, પૂર્ણાંક ldb,
        દશાંશ BETA,
        દશાંશ *C_gpu, પૂર્ણાંક ldc);

શૂન્ય gemm_gpu(પૂર્ણાંક TA, પૂર્ણાંક TB, પૂર્ણાંક M, પૂર્ણાંક N, પૂર્ણાંક K, દશાંશ ALPHA, 
        દશાંશ *A, પૂર્ણાંક lda, 
        દશાંશ *B, પૂર્ણાંક ldb,
        દશાંશ BETA,
        દશાંશ *C, પૂર્ણાંક ldc);
#endif
#endif
