#अगर_अघोषित GEMM_H
#घोषणा GEMM_H

व्योम gemm_bin(पूर्णांक M, पूर्णांक N, पूर्णांक K, भग्न ALPHA, 
        अक्षर  *A, पूर्णांक lda, 
        भग्न *B, पूर्णांक ldb,
        भग्न *C, पूर्णांक ldc);
        
व्योम gemm(पूर्णांक TA, पूर्णांक TB, पूर्णांक M, पूर्णांक N, पूर्णांक K, भग्न ALPHA, 
                    भग्न *A, पूर्णांक lda, 
                    भग्न *B, पूर्णांक ldb,
                    भग्न BETA,
                    भग्न *C, पूर्णांक ldc);

व्योम gemm_cpu(पूर्णांक TA, पूर्णांक TB, पूर्णांक M, पूर्णांक N, पूर्णांक K, भग्न ALPHA, 
        भग्न *A, पूर्णांक lda, 
        भग्न *B, पूर्णांक ldb,
        भग्न BETA,
        भग्न *C, पूर्णांक ldc);

#अगर_घोषित GPU
व्योम gemm_gpu(पूर्णांक TA, पूर्णांक TB, पूर्णांक M, पूर्णांक N, पूर्णांक K, भग्न ALPHA, 
        भग्न *A_gpu, पूर्णांक lda, 
        भग्न *B_gpu, पूर्णांक ldb,
        भग्न BETA,
        भग्न *C_gpu, पूर्णांक ldc);

व्योम gemm_gpu(पूर्णांक TA, पूर्णांक TB, पूर्णांक M, पूर्णांक N, पूर्णांक K, भग्न ALPHA, 
        भग्न *A, पूर्णांक lda, 
        भग्न *B, पूर्णांक ldb,
        भग्न BETA,
        भग्न *C, पूर्णांक ldc);
#पूर्ण_अगर
#पूर्ण_अगर
