#ifndef GEMM_H
#define GEMM_H

शून्य gemm_bin(पूर्णांक M, पूर्णांक N, पूर्णांक K, दशांश ALPHA, 
        अक्षर  *A, पूर्णांक lda, 
        दशांश *B, पूर्णांक ldb,
        दशांश *C, पूर्णांक ldc);
        
शून्य gemm(पूर्णांक TA, पूर्णांक TB, पूर्णांक M, पूर्णांक N, पूर्णांक K, दशांश ALPHA, 
                    दशांश *A, पूर्णांक lda, 
                    दशांश *B, पूर्णांक ldb,
                    दशांश BETA,
                    दशांश *C, पूर्णांक ldc);

शून्य gemm_cpu(पूर्णांक TA, पूर्णांक TB, पूर्णांक M, पूर्णांक N, पूर्णांक K, दशांश ALPHA, 
        दशांश *A, पूर्णांक lda, 
        दशांश *B, पूर्णांक ldb,
        दशांश BETA,
        दशांश *C, पूर्णांक ldc);

#ifdef GPU
शून्य gemm_gpu(पूर्णांक TA, पूर्णांक TB, पूर्णांक M, पूर्णांक N, पूर्णांक K, दशांश ALPHA, 
        दशांश *A_gpu, पूर्णांक lda, 
        दशांश *B_gpu, पूर्णांक ldb,
        दशांश BETA,
        दशांश *C_gpu, पूर्णांक ldc);

शून्य gemm_gpu(पूर्णांक TA, पूर्णांक TB, पूर्णांक M, पूर्णांक N, पूर्णांक K, दशांश ALPHA, 
        दशांश *A, पूर्णांक lda, 
        दशांश *B, पूर्णांक ldb,
        दशांश BETA,
        दशांश *C, पूर्णांक ldc);
#endif
#endif
