#ਜੇ_ਅਪਰਿਭਾਸ਼ਿਤ GEMM_H
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ GEMM_H

ਖਾਲੀ gemm_bin(ਪੂਰਨ M, ਪੂਰਨ N, ਪੂਰਨ K, ਦਸ਼ਮਲਵ ALPHA, 
        ਅੱਖਰ  *A, ਪੂਰਨ lda, 
        ਦਸ਼ਮਲਵ *B, ਪੂਰਨ ldb,
        ਦਸ਼ਮਲਵ *C, ਪੂਰਨ ldc);
        
ਖਾਲੀ gemm(ਪੂਰਨ TA, ਪੂਰਨ TB, ਪੂਰਨ M, ਪੂਰਨ N, ਪੂਰਨ K, ਦਸ਼ਮਲਵ ALPHA, 
                    ਦਸ਼ਮਲਵ *A, ਪੂਰਨ lda, 
                    ਦਸ਼ਮਲਵ *B, ਪੂਰਨ ldb,
                    ਦਸ਼ਮਲਵ BETA,
                    ਦਸ਼ਮਲਵ *C, ਪੂਰਨ ldc);

ਖਾਲੀ gemm_cpu(ਪੂਰਨ TA, ਪੂਰਨ TB, ਪੂਰਨ M, ਪੂਰਨ N, ਪੂਰਨ K, ਦਸ਼ਮਲਵ ALPHA, 
        ਦਸ਼ਮਲਵ *A, ਪੂਰਨ lda, 
        ਦਸ਼ਮਲਵ *B, ਪੂਰਨ ldb,
        ਦਸ਼ਮਲਵ BETA,
        ਦਸ਼ਮਲਵ *C, ਪੂਰਨ ldc);

#ਜੇ_ਪਰਿਭਾਸ਼ਿਤ GPU
ਖਾਲੀ gemm_gpu(ਪੂਰਨ TA, ਪੂਰਨ TB, ਪੂਰਨ M, ਪੂਰਨ N, ਪੂਰਨ K, ਦਸ਼ਮਲਵ ALPHA, 
        ਦਸ਼ਮਲਵ *A_gpu, ਪੂਰਨ lda, 
        ਦਸ਼ਮਲਵ *B_gpu, ਪੂਰਨ ldb,
        ਦਸ਼ਮਲਵ BETA,
        ਦਸ਼ਮਲਵ *C_gpu, ਪੂਰਨ ldc);

ਖਾਲੀ gemm_gpu(ਪੂਰਨ TA, ਪੂਰਨ TB, ਪੂਰਨ M, ਪੂਰਨ N, ਪੂਰਨ K, ਦਸ਼ਮਲਵ ALPHA, 
        ਦਸ਼ਮਲਵ *A, ਪੂਰਨ lda, 
        ਦਸ਼ਮਲਵ *B, ਪੂਰਨ ldb,
        ਦਸ਼ਮਲਵ BETA,
        ਦਸ਼ਮਲਵ *C, ਪੂਰਨ ldc);
#ਜੇ_ਅੰਤ
#ਜੇ_ਅੰਤ
