#ifndef GEMM_H
#define GEMM_H

ശൂന്യം gemm_bin(പൂർണ്ണസംഖ്യ M, പൂർണ്ണസംഖ്യ N, പൂർണ്ണസംഖ്യ K, ദശാംശം ALPHA, 
        അക്ഷരം  *A, പൂർണ്ണസംഖ്യ lda, 
        ദശാംശം *B, പൂർണ്ണസംഖ്യ ldb,
        ദശാംശം *C, പൂർണ്ണസംഖ്യ ldc);
        
ശൂന്യം gemm(പൂർണ്ണസംഖ്യ TA, പൂർണ്ണസംഖ്യ TB, പൂർണ്ണസംഖ്യ M, പൂർണ്ണസംഖ്യ N, പൂർണ്ണസംഖ്യ K, ദശാംശം ALPHA, 
                    ദശാംശം *A, പൂർണ്ണസംഖ്യ lda, 
                    ദശാംശം *B, പൂർണ്ണസംഖ്യ ldb,
                    ദശാംശം BETA,
                    ദശാംശം *C, പൂർണ്ണസംഖ്യ ldc);

ശൂന്യം gemm_cpu(പൂർണ്ണസംഖ്യ TA, പൂർണ്ണസംഖ്യ TB, പൂർണ്ണസംഖ്യ M, പൂർണ്ണസംഖ്യ N, പൂർണ്ണസംഖ്യ K, ദശാംശം ALPHA, 
        ദശാംശം *A, പൂർണ്ണസംഖ്യ lda, 
        ദശാംശം *B, പൂർണ്ണസംഖ്യ ldb,
        ദശാംശം BETA,
        ദശാംശം *C, പൂർണ്ണസംഖ്യ ldc);

#ifdef GPU
ശൂന്യം gemm_gpu(പൂർണ്ണസംഖ്യ TA, പൂർണ്ണസംഖ്യ TB, പൂർണ്ണസംഖ്യ M, പൂർണ്ണസംഖ്യ N, പൂർണ്ണസംഖ്യ K, ദശാംശം ALPHA, 
        ദശാംശം *A_gpu, പൂർണ്ണസംഖ്യ lda, 
        ദശാംശം *B_gpu, പൂർണ്ണസംഖ്യ ldb,
        ദശാംശം BETA,
        ദശാംശം *C_gpu, പൂർണ്ണസംഖ്യ ldc);

ശൂന്യം gemm_gpu(പൂർണ്ണസംഖ്യ TA, പൂർണ്ണസംഖ്യ TB, പൂർണ്ണസംഖ്യ M, പൂർണ്ണസംഖ്യ N, പൂർണ്ണസംഖ്യ K, ദശാംശം ALPHA, 
        ദശാംശം *A, പൂർണ്ണസംഖ്യ lda, 
        ദശാംശം *B, പൂർണ്ണസംഖ്യ ldb,
        ദശാംശം BETA,
        ദശാംശം *C, പൂർണ്ണസംഖ്യ ldc);
#endif
#endif
