#నిర్వచితం_కాకపోతే GEMM_H
#నిర్వచించు GEMM_H

శూన్య gemm_bin(పూర్ణాంకం M, పూర్ణాంకం N, పూర్ణాంకం K, దశాంశం ALPHA, 
        అక్షరం  *A, పూర్ణాంకం lda, 
        దశాంశం *B, పూర్ణాంకం ldb,
        దశాంశం *C, పూర్ణాంకం ldc);
        
శూన్య gemm(పూర్ణాంకం TA, పూర్ణాంకం TB, పూర్ణాంకం M, పూర్ణాంకం N, పూర్ణాంకం K, దశాంశం ALPHA, 
                    దశాంశం *A, పూర్ణాంకం lda, 
                    దశాంశం *B, పూర్ణాంకం ldb,
                    దశాంశం BETA,
                    దశాంశం *C, పూర్ణాంకం ldc);

శూన్య gemm_cpu(పూర్ణాంకం TA, పూర్ణాంకం TB, పూర్ణాంకం M, పూర్ణాంకం N, పూర్ణాంకం K, దశాంశం ALPHA, 
        దశాంశం *A, పూర్ణాంకం lda, 
        దశాంశం *B, పూర్ణాంకం ldb,
        దశాంశం BETA,
        దశాంశం *C, పూర్ణాంకం ldc);

#నిర్వచితమైతే GPU
శూన్య gemm_gpu(పూర్ణాంకం TA, పూర్ణాంకం TB, పూర్ణాంకం M, పూర్ణాంకం N, పూర్ణాంకం K, దశాంశం ALPHA, 
        దశాంశం *A_gpu, పూర్ణాంకం lda, 
        దశాంశం *B_gpu, పూర్ణాంకం ldb,
        దశాంశం BETA,
        దశాంశం *C_gpu, పూర్ణాంకం ldc);

శూన్య gemm_gpu(పూర్ణాంకం TA, పూర్ణాంకం TB, పూర్ణాంకం M, పూర్ణాంకం N, పూర్ణాంకం K, దశాంశం ALPHA, 
        దశాంశం *A, పూర్ణాంకం lda, 
        దశాంశం *B, పూర్ణాంకం ldb,
        దశాంశం BETA,
        దశాంశం *C, పూర్ణాంకం ldc);
#అయితే_ముగింపు
#అయితే_ముగింపు
