#ifndef GEMM_H
#define GEMM_H

ಶೂನ್ಯ gemm_bin(ಪೂರ್ಣಾಙ್ಕ M, ಪೂರ್ಣಾಙ್ಕ N, ಪೂರ್ಣಾಙ್ಕ K, ಭಿನ್ನ ALPHA, 
        ವರ್ಣ  *A, ಪೂರ್ಣಾಙ್ಕ lda, 
        ಭಿನ್ನ *B, ಪೂರ್ಣಾಙ್ಕ ldb,
        ಭಿನ್ನ *C, ಪೂರ್ಣಾಙ್ಕ ldc);
        
ಶೂನ್ಯ gemm(ಪೂರ್ಣಾಙ್ಕ TA, ಪೂರ್ಣಾಙ್ಕ TB, ಪೂರ್ಣಾಙ್ಕ M, ಪೂರ್ಣಾಙ್ಕ N, ಪೂರ್ಣಾಙ್ಕ K, ಭಿನ್ನ ALPHA, 
                    ಭಿನ್ನ *A, ಪೂರ್ಣಾಙ್ಕ lda, 
                    ಭಿನ್ನ *B, ಪೂರ್ಣಾಙ್ಕ ldb,
                    ಭಿನ್ನ BETA,
                    ಭಿನ್ನ *C, ಪೂರ್ಣಾಙ್ಕ ldc);

ಶೂನ್ಯ gemm_cpu(ಪೂರ್ಣಾಙ್ಕ TA, ಪೂರ್ಣಾಙ್ಕ TB, ಪೂರ್ಣಾಙ್ಕ M, ಪೂರ್ಣಾಙ್ಕ N, ಪೂರ್ಣಾಙ್ಕ K, ಭಿನ್ನ ALPHA, 
        ಭಿನ್ನ *A, ಪೂರ್ಣಾಙ್ಕ lda, 
        ಭಿನ್ನ *B, ಪೂರ್ಣಾಙ್ಕ ldb,
        ಭಿನ್ನ BETA,
        ಭಿನ್ನ *C, ಪೂರ್ಣಾಙ್ಕ ldc);

#ifdef GPU
ಶೂನ್ಯ gemm_gpu(ಪೂರ್ಣಾಙ್ಕ TA, ಪೂರ್ಣಾಙ್ಕ TB, ಪೂರ್ಣಾಙ್ಕ M, ಪೂರ್ಣಾಙ್ಕ N, ಪೂರ್ಣಾಙ್ಕ K, ಭಿನ್ನ ALPHA, 
        ಭಿನ್ನ *A_gpu, ಪೂರ್ಣಾಙ್ಕ lda, 
        ಭಿನ್ನ *B_gpu, ಪೂರ್ಣಾಙ್ಕ ldb,
        ಭಿನ್ನ BETA,
        ಭಿನ್ನ *C_gpu, ಪೂರ್ಣಾಙ್ಕ ldc);

ಶೂನ್ಯ gemm_gpu(ಪೂರ್ಣಾಙ್ಕ TA, ಪೂರ್ಣಾಙ್ಕ TB, ಪೂರ್ಣಾಙ್ಕ M, ಪೂರ್ಣಾಙ್ಕ N, ಪೂರ್ಣಾಙ್ಕ K, ಭಿನ್ನ ALPHA, 
        ಭಿನ್ನ *A, ಪೂರ್ಣಾಙ್ಕ lda, 
        ಭಿನ್ನ *B, ಪೂರ್ಣಾಙ್ಕ ldb,
        ಭಿನ್ನ BETA,
        ಭಿನ್ನ *C, ಪೂರ್ಣಾಙ್ಕ ldc);
#endif
#endif
