#ವ್ಯಾಖ್ಯಾನಿತವಾಗದಿದ್ದರೆ GEMM_H
#ವ್ಯಾಖ್ಯಾನಿಸು GEMM_H

ಶೂನ್ಯ gemm_bin(ಪೂರ್ಣಾಂಕ M, ಪೂರ್ಣಾಂಕ N, ಪೂರ್ಣಾಂಕ K, ದಶಮಾಂಶ ALPHA, 
        ಅಕ್ಷರ  *A, ಪೂರ್ಣಾಂಕ lda, 
        ದಶಮಾಂಶ *B, ಪೂರ್ಣಾಂಕ ldb,
        ದಶಮಾಂಶ *C, ಪೂರ್ಣಾಂಕ ldc);
        
ಶೂನ್ಯ gemm(ಪೂರ್ಣಾಂಕ TA, ಪೂರ್ಣಾಂಕ TB, ಪೂರ್ಣಾಂಕ M, ಪೂರ್ಣಾಂಕ N, ಪೂರ್ಣಾಂಕ K, ದಶಮಾಂಶ ALPHA, 
                    ದಶಮಾಂಶ *A, ಪೂರ್ಣಾಂಕ lda, 
                    ದಶಮಾಂಶ *B, ಪೂರ್ಣಾಂಕ ldb,
                    ದಶಮಾಂಶ BETA,
                    ದಶಮಾಂಶ *C, ಪೂರ್ಣಾಂಕ ldc);

ಶೂನ್ಯ gemm_cpu(ಪೂರ್ಣಾಂಕ TA, ಪೂರ್ಣಾಂಕ TB, ಪೂರ್ಣಾಂಕ M, ಪೂರ್ಣಾಂಕ N, ಪೂರ್ಣಾಂಕ K, ದಶಮಾಂಶ ALPHA, 
        ದಶಮಾಂಶ *A, ಪೂರ್ಣಾಂಕ lda, 
        ದಶಮಾಂಶ *B, ಪೂರ್ಣಾಂಕ ldb,
        ದಶಮಾಂಶ BETA,
        ದಶಮಾಂಶ *C, ಪೂರ್ಣಾಂಕ ldc);

#ವ್ಯಾಖ್ಯಾನಿತವಾದರೆ GPU
ಶೂನ್ಯ gemm_gpu(ಪೂರ್ಣಾಂಕ TA, ಪೂರ್ಣಾಂಕ TB, ಪೂರ್ಣಾಂಕ M, ಪೂರ್ಣಾಂಕ N, ಪೂರ್ಣಾಂಕ K, ದಶಮಾಂಶ ALPHA, 
        ದಶಮಾಂಶ *A_gpu, ಪೂರ್ಣಾಂಕ lda, 
        ದಶಮಾಂಶ *B_gpu, ಪೂರ್ಣಾಂಕ ldb,
        ದಶಮಾಂಶ BETA,
        ದಶಮಾಂಶ *C_gpu, ಪೂರ್ಣಾಂಕ ldc);

ಶೂನ್ಯ gemm_gpu(ಪೂರ್ಣಾಂಕ TA, ಪೂರ್ಣಾಂಕ TB, ಪೂರ್ಣಾಂಕ M, ಪೂರ್ಣಾಂಕ N, ಪೂರ್ಣಾಂಕ K, ದಶಮಾಂಶ ALPHA, 
        ದಶಮಾಂಶ *A, ಪೂರ್ಣಾಂಕ lda, 
        ದಶಮಾಂಶ *B, ಪೂರ್ಣಾಂಕ ldb,
        ದಶಮಾಂಶ BETA,
        ದಶಮಾಂಶ *C, ಪೂರ್ಣಾಂಕ ldc);
#ಆದರೆ_ಅಂತ್ಯ
#ಆದರೆ_ಅಂತ್ಯ
