#అన్తర్భావ "im2col.h"
#అన్తర్భావ <stdio.h>
దశాంశం im2col_get_pixel(దశాంశం *im, పూర్ణాంకం ఎత్తు, పూర్ణాంకం వెడల్పు, పూర్ణాంకం channels,
                        పూర్ణాంకం అడ్డువరుస, పూర్ణాంకం నిలువు, పూర్ణాంకం channel, పూర్ణాంకం pad)
{
    అడ్డువరుస -= pad;
    నిలువు -= pad;

    ఒకవేళ (అడ్డువరుస < 0 || నిలువు < 0 ||
        అడ్డువరుస >= ఎత్తు || నిలువు >= వెడల్పు) తిరిగి 0;
    తిరిగి im[నిలువు + వెడల్పు*(అడ్డువరుస + ఎత్తు*channel)];
}

//From Berkeley Vision's Caffe!
//https://github.com/BVLC/caffe/blob/master/LICENSE
శూన్య im2col_cpu(దశాంశం* దత్తాంశం_im,
     పూర్ణాంకం channels,  పూర్ణాంకం ఎత్తు,  పూర్ణాంకం వెడల్పు,
     పూర్ణాంకం ksize,  పూర్ణాంకం stride, పూర్ణాంకం pad, దశాంశం* దత్తాంశం_నిలువు) 
{
    పూర్ణాంకం c,h,w;
    పూర్ణాంకం ఎత్తు_నిలువు = (ఎత్తు + 2*pad - ksize) / stride + 1;
    పూర్ణాంకం వెడల్పు_నిలువు = (వెడల్పు + 2*pad - ksize) / stride + 1;

    పూర్ణాంకం channels_నిలువు = channels * ksize * ksize;
    కొరకు (c = 0; c < channels_నిలువు; ++c) {
        పూర్ణాంకం w_స్థానభ్రంశం = c % ksize;
        పూర్ణాంకం h_స్థానభ్రంశం = (c / ksize) % ksize;
        పూర్ణాంకం c_im = c / ksize / ksize;
        కొరకు (h = 0; h < ఎత్తు_నిలువు; ++h) {
            కొరకు (w = 0; w < వెడల్పు_నిలువు; ++w) {
                పూర్ణాంకం im_అడ్డువరుస = h_స్థానభ్రంశం + h * stride;
                పూర్ణాంకం im_నిలువు = w_స్థానభ్రంశం + w * stride;
                పూర్ణాంకం నిలువు_సూచీ = (c * ఎత్తు_నిలువు + h) * వెడల్పు_నిలువు + w;
                దత్తాంశం_నిలువు[నిలువు_సూచీ] = im2col_get_pixel(దత్తాంశం_im, ఎత్తు, వెడల్పు, channels,
                        im_అడ్డువరుస, im_నిలువు, c_im, pad);
            }
        }
    }
}

