#ਅਨ੍ਤਰ੍ਭਾਵ "matrix.h"
#ਅਨ੍ਤਰ੍ਭਾਵ "utils.h"
#ਅਨ੍ਤਰ੍ਭਾਵ "blas.h"
#ਅਨ੍ਤਰ੍ਭਾਵ <stdio.h>
#ਅਨ੍ਤਰ੍ਭਾਵ <stdlib.h>
#ਅਨ੍ਤਰ੍ਭਾਵ <string.h>
#ਅਨ੍ਤਰ੍ਭਾਵ <assert.h>
#ਅਨ੍ਤਰ੍ਭਾਵ <math.h>

ਖਾਲੀ free_ਮੈਟ੍ਰਿਕਸ(ਮੈਟ੍ਰਿਕਸ m)
{
    ਪੂਰਨ i;
    ਲਈ(i = 0; i < m.ਪੰਕਤੀਆਂ; ++i) ਮੁਕਤ(m.vals[i]);
    ਮੁਕਤ(m.vals);
}

ਦਸ਼ਮਲਵ ਮੈਟ੍ਰਿਕਸ_topk_accuracy(ਮੈਟ੍ਰਿਕਸ truth, ਮੈਟ੍ਰਿਕਸ guess, ਪੂਰਨ k)
{
    ਪੂਰਨ *indexes = ਸਿਫਰ_ਸਮ੍ਰਿਤੀ_ਦਿਓ(k, ਆਕਾਰ(ਪੂਰਨ));
    ਪੂਰਨ n = truth.ਖਾਨੇ_ਗਿਣਤੀ;
    ਪੂਰਨ i,j;
    ਪੂਰਨ correct = 0;
    ਲਈ(i = 0; i < truth.ਪੰਕਤੀਆਂ; ++i){
        ਸਿਖਰ_k(guess.vals[i], n, k, indexes);
        ਲਈ(j = 0; j < k; ++j){
            ਪੂਰਨ class = indexes[j];
            ਜੇ(truth.vals[i][class]){
                ++correct;
                ਰੋਕੋ;
            }
        }
    }
    ਮੁਕਤ(indexes);
    ਵਾਪਸ (ਦਸ਼ਮਲਵ)correct/truth.ਪੰਕਤੀਆਂ;
}

ਖਾਲੀ scale_ਮੈਟ੍ਰਿਕਸ(ਮੈਟ੍ਰਿਕਸ m, ਦਸ਼ਮਲਵ scale)
{
    ਪੂਰਨ i,j;
    ਲਈ(i = 0; i < m.ਪੰਕਤੀਆਂ; ++i){
        ਲਈ(j = 0; j < m.ਖਾਨੇ_ਗਿਣਤੀ; ++j){
            m.vals[i][j] *= scale;
        }
    }
}

ਮੈਟ੍ਰਿਕਸ resize_ਮੈਟ੍ਰਿਕਸ(ਮੈਟ੍ਰਿਕਸ m, ਪੂਰਨ ਮਾਪ)
{
    ਪੂਰਨ i;
    ਜੇ (m.ਪੰਕਤੀਆਂ == ਮਾਪ) ਵਾਪਸ m;
    ਜੇ (m.ਪੰਕਤੀਆਂ < ਮਾਪ) {
        m.vals = realloc(m.vals, ਮਾਪ*ਆਕਾਰ(ਦਸ਼ਮਲਵ*));
        ਲਈ (i = m.ਪੰਕਤੀਆਂ; i < ਮਾਪ; ++i) {
            m.vals[i] = ਸਿਫਰ_ਸਮ੍ਰਿਤੀ_ਦਿਓ(m.ਖਾਨੇ_ਗਿਣਤੀ, ਆਕਾਰ(ਦਸ਼ਮਲਵ));
        }
    } ਨਹੀਂਤਾਂ ਜੇ (m.ਪੰਕਤੀਆਂ > ਮਾਪ) {
        ਲਈ (i = ਮਾਪ; i < m.ਪੰਕਤੀਆਂ; ++i) {
            ਮੁਕਤ(m.vals[i]);
        }
        m.vals = realloc(m.vals, ਮਾਪ*ਆਕਾਰ(ਦਸ਼ਮਲਵ*));
    }
    m.ਪੰਕਤੀਆਂ = ਮਾਪ;
    ਵਾਪਸ m;
}

ਖਾਲੀ ਮੈਟ੍ਰਿਕਸ_ਜੋੜੋ_ਮੈਟ੍ਰਿਕਸ(ਮੈਟ੍ਰਿਕਸ from, ਮੈਟ੍ਰਿਕਸ ਮੰਜ਼ਿਲ)
{
    ਪ੍ਰਤਿਜ੍ਞਾ(from.ਪੰਕਤੀਆਂ == ਮੰਜ਼ਿਲ.ਪੰਕਤੀਆਂ && from.ਖਾਨੇ_ਗਿਣਤੀ == ਮੰਜ਼ਿਲ.ਖਾਨੇ_ਗਿਣਤੀ);
    ਪੂਰਨ i,j;
    ਲਈ(i = 0; i < from.ਪੰਕਤੀਆਂ; ++i){
        ਲਈ(j = 0; j < from.ਖਾਨੇ_ਗਿਣਤੀ; ++j){
            ਮੰਜ਼ਿਲ.vals[i][j] += from.vals[i][j];
        }
    }
}

ਮੈਟ੍ਰਿਕਸ copy_ਮੈਟ੍ਰਿਕਸ(ਮੈਟ੍ਰਿਕਸ m)
{
    ਮੈਟ੍ਰਿਕਸ c = {0};
    c.ਪੰਕਤੀਆਂ = m.ਪੰਕਤੀਆਂ;
    c.ਖਾਨੇ_ਗਿਣਤੀ = m.ਖਾਨੇ_ਗਿਣਤੀ;
    c.vals = ਸਿਫਰ_ਸਮ੍ਰਿਤੀ_ਦਿਓ(c.ਪੰਕਤੀਆਂ, ਆਕਾਰ(ਦਸ਼ਮਲਵ *));
    ਪੂਰਨ i;
    ਲਈ(i = 0; i < c.ਪੰਕਤੀਆਂ; ++i){
        c.vals[i] = ਸਿਫਰ_ਸਮ੍ਰਿਤੀ_ਦਿਓ(c.ਖਾਨੇ_ਗਿਣਤੀ, ਆਕਾਰ(ਦਸ਼ਮਲਵ));
        copy_cpu(c.ਖਾਨੇ_ਗਿਣਤੀ, m.vals[i], 1, c.vals[i], 1);
    }
    ਵਾਪਸ c;
}

ਮੈਟ੍ਰਿਕਸ make_ਮੈਟ੍ਰਿਕਸ(ਪੂਰਨ ਪੰਕਤੀਆਂ, ਪੂਰਨ ਖਾਨੇ_ਗਿਣਤੀ)
{
    ਪੂਰਨ i;
    ਮੈਟ੍ਰਿਕਸ m;
    m.ਪੰਕਤੀਆਂ = ਪੰਕਤੀਆਂ;
    m.ਖਾਨੇ_ਗਿਣਤੀ = ਖਾਨੇ_ਗਿਣਤੀ;
    m.vals = ਸਿਫਰ_ਸਮ੍ਰਿਤੀ_ਦਿਓ(m.ਪੰਕਤੀਆਂ, ਆਕਾਰ(ਦਸ਼ਮਲਵ *));
    ਲਈ(i = 0; i < m.ਪੰਕਤੀਆਂ; ++i){
        m.vals[i] = ਸਿਫਰ_ਸਮ੍ਰਿਤੀ_ਦਿਓ(m.ਖਾਨੇ_ਗਿਣਤੀ, ਆਕਾਰ(ਦਸ਼ਮਲਵ));
    }
    ਵਾਪਸ m;
}

ਮੈਟ੍ਰਿਕਸ hold_ਬਾਹਰਲਾ_ਮੈਟ੍ਰਿਕਸ(ਮੈਟ੍ਰਿਕਸ *m, ਪੂਰਨ n)
{
    ਪੂਰਨ i;
    ਮੈਟ੍ਰਿਕਸ h;
    h.ਪੰਕਤੀਆਂ = n;
    h.ਖਾਨੇ_ਗਿਣਤੀ = m->ਖਾਨੇ_ਗਿਣਤੀ;
    h.vals = ਸਿਫਰ_ਸਮ੍ਰਿਤੀ_ਦਿਓ(h.ਪੰਕਤੀਆਂ, ਆਕਾਰ(ਦਸ਼ਮਲਵ *));
    ਲਈ(i = 0; i < n; ++i){
        ਪੂਰਨ ਸੂਚਕਾਂਕ = rand()%m->ਪੰਕਤੀਆਂ;
        h.vals[i] = m->vals[ਸੂਚਕਾਂਕ];
        m->vals[ਸੂਚਕਾਂਕ] = m->vals[--(m->ਪੰਕਤੀਆਂ)];
    }
    ਵਾਪਸ h;
}

ਦਸ਼ਮਲਵ *ਕੱਢੋ_ਕਾਲਮ(ਮੈਟ੍ਰਿਕਸ *m, ਪੂਰਨ c)
{
    ਦਸ਼ਮਲਵ *ਖਾਨਾ = ਸਿਫਰ_ਸਮ੍ਰਿਤੀ_ਦਿਓ(m->ਪੰਕਤੀਆਂ, ਆਕਾਰ(ਦਸ਼ਮਲਵ));
    ਪੂਰਨ i, j;
    ਲਈ(i = 0; i < m->ਪੰਕਤੀਆਂ; ++i){
        ਖਾਨਾ[i] = m->vals[i][c];
        ਲਈ(j = c; j < m->ਖਾਨੇ_ਗਿਣਤੀ-1; ++j){
            m->vals[i][j] = m->vals[i][j+1];
        }
    }
    --m->ਖਾਨੇ_ਗਿਣਤੀ;
    ਵਾਪਸ ਖਾਨਾ;
}

ਮੈਟ੍ਰਿਕਸ csv_ਮੰਜ਼ਿਲ_ਮੈਟ੍ਰਿਕਸ(ਅੱਖਰ *filename)
{
    FILE *fp = fopen(filename, "r");
    ਜੇ(!fp) file_error(filename);

    ਮੈਟ੍ਰਿਕਸ m;
    m.ਖਾਨੇ_ਗਿਣਤੀ = -1;

    ਅੱਖਰ *ਸਤਰ;

    ਪੂਰਨ n = 0;
    ਪੂਰਨ ਮਾਪ = 1024;
    m.vals = ਸਿਫਰ_ਸਮ੍ਰਿਤੀ_ਦਿਓ(ਮਾਪ, ਆਕਾਰ(ਦਸ਼ਮਲਵ*));
    ਜਦੋਂ((ਸਤਰ = fgetl(fp))){
        ਜੇ(m.ਖਾਨੇ_ਗਿਣਤੀ == -1) m.ਖਾਨੇ_ਗਿਣਤੀ = ਗਿਣਤੀ_fields(ਸਤਰ);
        ਜੇ(n == ਮਾਪ){
            ਮਾਪ *= 2;
            m.vals = realloc(m.vals, ਮਾਪ*ਆਕਾਰ(ਦਸ਼ਮਲਵ*));
        }
        m.vals[n] = parse_fields(ਸਤਰ, m.ਖਾਨੇ_ਗਿਣਤੀ);
        ਮੁਕਤ(ਸਤਰ);
        ++n;
    }
    m.vals = realloc(m.vals, n*ਆਕਾਰ(ਦਸ਼ਮਲਵ*));
    m.ਪੰਕਤੀਆਂ = n;
    ਵਾਪਸ m;
}

ਖਾਲੀ ਮੈਟ੍ਰਿਕਸ_ਮੰਜ਼ਿਲ_csv(ਮੈਟ੍ਰਿਕਸ m)
{
    ਪੂਰਨ i, j;

    ਲਈ(i = 0; i < m.ਪੰਕਤੀਆਂ; ++i){
        ਲਈ(j = 0; j < m.ਖਾਨੇ_ਗਿਣਤੀ; ++j){
            ਜੇ(j > 0) ਲਿਖੋ(",");
            ਲਿਖੋ("%.17g", m.vals[i][j]);
        }
        ਲਿਖੋ("\n");
    }
}

ਖਾਲੀ print_ਮੈਟ੍ਰਿਕਸ(ਮੈਟ੍ਰਿਕਸ m)
{
    ਪੂਰਨ i, j;
    ਲਿਖੋ("%d X %d Matrix:\n",m.ਪੰਕਤੀਆਂ, m.ਖਾਨੇ_ਗਿਣਤੀ);
    ਲਿਖੋ(" __");
    ਲਈ(j = 0; j < 16*m.ਖਾਨੇ_ਗਿਣਤੀ-1; ++j) ਲਿਖੋ(" ");
    ਲਿਖੋ("__ \n");

    ਲਿਖੋ("|  ");
    ਲਈ(j = 0; j < 16*m.ਖਾਨੇ_ਗਿਣਤੀ-1; ++j) ਲਿਖੋ(" ");
    ਲਿਖੋ("  |\n");

    ਲਈ(i = 0; i < m.ਪੰਕਤੀਆਂ; ++i){
        ਲਿਖੋ("|  ");
        ਲਈ(j = 0; j < m.ਖਾਨੇ_ਗਿਣਤੀ; ++j){
            ਲਿਖੋ("%15.7f ", m.vals[i][j]);
        }
        ਲਿਖੋ(" |\n");
    }
    ਲਿਖੋ("|__");
    ਲਈ(j = 0; j < 16*m.ਖਾਨੇ_ਗਿਣਤੀ-1; ++j) ਲਿਖੋ(" ");
    ਲਿਖੋ("__|\n");
}
