#అన్తర్భావ "matrix.h"
#అన్తర్భావ "utils.h"
#అన్తర్భావ "blas.h"
#అన్తర్భావ <stdio.h>
#అన్తర్భావ <stdlib.h>
#అన్తర్భావ <string.h>
#అన్తర్భావ <assert.h>
#అన్తర్భావ <math.h>

శూన్య free_మాతృక(మాతృక m)
{
    పూర్ణాంకం i;
    కొరకు(i = 0; i < m.అడ్డువరుసలు; ++i) విడుదల(m.vals[i]);
    విడుదల(m.vals);
}

దశాంశం మాతృక_topk_accuracy(మాతృక truth, మాతృక guess, పూర్ణాంకం k)
{
    పూర్ణాంకం *indexes = సున్నా_జ్ఞాపకం_ఇవ్వు(k, పరిమాణం(పూర్ణాంకం));
    పూర్ణాంకం n = truth.నిలువుల_సంఖ్య;
    పూర్ణాంకం i,j;
    పూర్ణాంకం correct = 0;
    కొరకు(i = 0; i < truth.అడ్డువరుసలు; ++i){
        శిఖరం_k(guess.vals[i], n, k, indexes);
        కొరకు(j = 0; j < k; ++j){
            పూర్ణాంకం class = indexes[j];
            ఒకవేళ(truth.vals[i][class]){
                ++correct;
                ఆపు;
            }
        }
    }
    విడుదల(indexes);
    తిరిగి (దశాంశం)correct/truth.అడ్డువరుసలు;
}

శూన్య scale_మాతృక(మాతృక m, దశాంశం scale)
{
    పూర్ణాంకం i,j;
    కొరకు(i = 0; i < m.అడ్డువరుసలు; ++i){
        కొరకు(j = 0; j < m.నిలువుల_సంఖ్య; ++j){
            m.vals[i][j] *= scale;
        }
    }
}

మాతృక resize_మాతృక(మాతృక m, పూర్ణాంకం కొలత)
{
    పూర్ణాంకం i;
    ఒకవేళ (m.అడ్డువరుసలు == కొలత) తిరిగి m;
    ఒకవేళ (m.అడ్డువరుసలు < కొలత) {
        m.vals = realloc(m.vals, కొలత*పరిమాణం(దశాంశం*));
        కొరకు (i = m.అడ్డువరుసలు; i < కొలత; ++i) {
            m.vals[i] = సున్నా_జ్ఞాపకం_ఇవ్వు(m.నిలువుల_సంఖ్య, పరిమాణం(దశాంశం));
        }
    } లేకపోతే ఒకవేళ (m.అడ్డువరుసలు > కొలత) {
        కొరకు (i = కొలత; i < m.అడ్డువరుసలు; ++i) {
            విడుదల(m.vals[i]);
        }
        m.vals = realloc(m.vals, కొలత*పరిమాణం(దశాంశం*));
    }
    m.అడ్డువరుసలు = కొలత;
    తిరిగి m;
}

శూన్య మాతృక_కూడు_మాతృక(మాతృక from, మాతృక గమ్యం)
{
    ప్రతిజ్ఞా(from.అడ్డువరుసలు == గమ్యం.అడ్డువరుసలు && from.నిలువుల_సంఖ్య == గమ్యం.నిలువుల_సంఖ్య);
    పూర్ణాంకం i,j;
    కొరకు(i = 0; i < from.అడ్డువరుసలు; ++i){
        కొరకు(j = 0; j < from.నిలువుల_సంఖ్య; ++j){
            గమ్యం.vals[i][j] += from.vals[i][j];
        }
    }
}

మాతృక copy_మాతృక(మాతృక m)
{
    మాతృక c = {0};
    c.అడ్డువరుసలు = m.అడ్డువరుసలు;
    c.నిలువుల_సంఖ్య = m.నిలువుల_సంఖ్య;
    c.vals = సున్నా_జ్ఞాపకం_ఇవ్వు(c.అడ్డువరుసలు, పరిమాణం(దశాంశం *));
    పూర్ణాంకం i;
    కొరకు(i = 0; i < c.అడ్డువరుసలు; ++i){
        c.vals[i] = సున్నా_జ్ఞాపకం_ఇవ్వు(c.నిలువుల_సంఖ్య, పరిమాణం(దశాంశం));
        copy_cpu(c.నిలువుల_సంఖ్య, m.vals[i], 1, c.vals[i], 1);
    }
    తిరిగి c;
}

మాతృక make_మాతృక(పూర్ణాంకం అడ్డువరుసలు, పూర్ణాంకం నిలువుల_సంఖ్య)
{
    పూర్ణాంకం i;
    మాతృక m;
    m.అడ్డువరుసలు = అడ్డువరుసలు;
    m.నిలువుల_సంఖ్య = నిలువుల_సంఖ్య;
    m.vals = సున్నా_జ్ఞాపకం_ఇవ్వు(m.అడ్డువరుసలు, పరిమాణం(దశాంశం *));
    కొరకు(i = 0; i < m.అడ్డువరుసలు; ++i){
        m.vals[i] = సున్నా_జ్ఞాపకం_ఇవ్వు(m.నిలువుల_సంఖ్య, పరిమాణం(దశాంశం));
    }
    తిరిగి m;
}

మాతృక hold_బహిర్గతం_మాతృక(మాతృక *m, పూర్ణాంకం n)
{
    పూర్ణాంకం i;
    మాతృక h;
    h.అడ్డువరుసలు = n;
    h.నిలువుల_సంఖ్య = m->నిలువుల_సంఖ్య;
    h.vals = సున్నా_జ్ఞాపకం_ఇవ్వు(h.అడ్డువరుసలు, పరిమాణం(దశాంశం *));
    కొరకు(i = 0; i < n; ++i){
        పూర్ణాంకం సూచీ = rand()%m->అడ్డువరుసలు;
        h.vals[i] = m->vals[సూచీ];
        m->vals[సూచీ] = m->vals[--(m->అడ్డువరుసలు)];
    }
    తిరిగి h;
}

దశాంశం *తీయి_స్తంభం(మాతృక *m, పూర్ణాంకం c)
{
    దశాంశం *నిలువు = సున్నా_జ్ఞాపకం_ఇవ్వు(m->అడ్డువరుసలు, పరిమాణం(దశాంశం));
    పూర్ణాంకం i, j;
    కొరకు(i = 0; i < m->అడ్డువరుసలు; ++i){
        నిలువు[i] = m->vals[i][c];
        కొరకు(j = c; j < m->నిలువుల_సంఖ్య-1; ++j){
            m->vals[i][j] = m->vals[i][j+1];
        }
    }
    --m->నిలువుల_సంఖ్య;
    తిరిగి నిలువు;
}

మాతృక csv_గమ్యం_మాతృక(అక్షరం *filename)
{
    FILE *fp = fopen(filename, "r");
    ఒకవేళ(!fp) file_error(filename);

    మాతృక m;
    m.నిలువుల_సంఖ్య = -1;

    అక్షరం *పంక్తి;

    పూర్ణాంకం n = 0;
    పూర్ణాంకం కొలత = 1024;
    m.vals = సున్నా_జ్ఞాపకం_ఇవ్వు(కొలత, పరిమాణం(దశాంశం*));
    అయితే((పంక్తి = fgetl(fp))){
        ఒకవేళ(m.నిలువుల_సంఖ్య == -1) m.నిలువుల_సంఖ్య = లెక్క_fields(పంక్తి);
        ఒకవేళ(n == కొలత){
            కొలత *= 2;
            m.vals = realloc(m.vals, కొలత*పరిమాణం(దశాంశం*));
        }
        m.vals[n] = parse_fields(పంక్తి, m.నిలువుల_సంఖ్య);
        విడుదల(పంక్తి);
        ++n;
    }
    m.vals = realloc(m.vals, n*పరిమాణం(దశాంశం*));
    m.అడ్డువరుసలు = n;
    తిరిగి m;
}

శూన్య మాతృక_గమ్యం_csv(మాతృక m)
{
    పూర్ణాంకం i, j;

    కొరకు(i = 0; i < m.అడ్డువరుసలు; ++i){
        కొరకు(j = 0; j < m.నిలువుల_సంఖ్య; ++j){
            ఒకవేళ(j > 0) రాయి(",");
            రాయి("%.17g", m.vals[i][j]);
        }
        రాయి("\n");
    }
}

శూన్య print_మాతృక(మాతృక m)
{
    పూర్ణాంకం i, j;
    రాయి("%d X %d Matrix:\n",m.అడ్డువరుసలు, m.నిలువుల_సంఖ్య);
    రాయి(" __");
    కొరకు(j = 0; j < 16*m.నిలువుల_సంఖ్య-1; ++j) రాయి(" ");
    రాయి("__ \n");

    రాయి("|  ");
    కొరకు(j = 0; j < 16*m.నిలువుల_సంఖ్య-1; ++j) రాయి(" ");
    రాయి("  |\n");

    కొరకు(i = 0; i < m.అడ్డువరుసలు; ++i){
        రాయి("|  ");
        కొరకు(j = 0; j < m.నిలువుల_సంఖ్య; ++j){
            రాయి("%15.7f ", m.vals[i][j]);
        }
        రాయి(" |\n");
    }
    రాయి("|__");
    కొరకు(j = 0; j < 16*m.నిలువుల_సంఖ్య-1; ++j) రాయి(" ");
    రాయి("__|\n");
}
