#अन्तर्भाव <stdio.h>
#अन्तर्भाव <stdlib.h>
#अन्तर्भाव <string.h>
#अन्तर्भाव <math.h>
#अन्तर्भाव <assert.h>
#अन्तर्भाव <unistd.h>
#अन्तर्भाव <float.h>
#अन्तर्भाव <limits.h>
#अन्तर्भाव <time.h>
#अन्तर्भाव <sys/time.h>

#अन्तर्भाव "utils.h"


/*
// old timing. is it better? who knows!!
double get_wall_time()
{
    struct timeval time;
    if (gettimeofday(&time,NULL)){
        return 0;
    }
    return (double)time.tv_sec + (double)time.tv_usec * .000001;
}
*/

द्विगुण what_time_is_it_now()
{
    संरचना timeval time;
    यदि (gettimeofday(&time,रिक्त)){
        प्रत्यागम 0;
    }
    प्रत्यागम (द्विगुण)time.tv_sec + (द्विगुण)time.tv_usec * .000001;
}

पूर्णाङ्क *read_intlist(वर्ण *gpu_list, पूर्णाङ्क *ngpus, पूर्णाङ्क d)
{
    पूर्णाङ्क *gpus = 0;
    यदि(gpu_list){
        पूर्णाङ्क len = वाक्यदैर्घ्यम्(gpu_list);
        *ngpus = 1;
        पूर्णाङ्क i;
        प्रति(i = 0; i < len; ++i){
            यदि (gpu_list[i] == ',') ++*ngpus;
        }
        gpus = शून्यस्मृतिं_देहि(*ngpus, परिमाण(पूर्णाङ्क));
        प्रति(i = 0; i < *ngpus; ++i){
            gpus[i] = atoi(gpu_list);
            gpu_list = strchr(gpu_list, ',')+1;
        }
    } अन्यथा {
        gpus = शून्यस्मृतिं_देहि(1, परिमाण(भिन्न));
        *gpus = d;
        *ngpus = 1;
    }
    प्रत्यागम gpus;
}

पूर्णाङ्क *read_map(वर्ण *filename)
{
    पूर्णाङ्क n = 0;
    पूर्णाङ्क *map = 0;
    वर्ण *str;
    FILE *file = fopen(filename, "r");
    यदि(!file) file_error(filename);
    यावत्((str=fgetl(file))){
        ++n;
        map = realloc(map, n*परिमाण(पूर्णाङ्क));
        map[n-1] = atoi(str);
    }
    प्रत्यागम map;
}

शून्य sorta_shuffle(शून्य *arr, size_t n, size_t आकार, size_t sections)
{
    size_t i;
    प्रति(i = 0; i < sections; ++i){
        size_t start = n*i/sections;
        size_t अन्तः = n*(i+1)/sections;
        size_t अङ्कः = अन्तः-start;
        shuffle(arr+(start*आकार), अङ्कः, आकार);
    }
}

शून्य shuffle(शून्य *arr, size_t n, size_t आकार)
{
    size_t i;
    शून्य *swp = शून्यस्मृतिं_देहि(1, आकार);
    प्रति(i = 0; i < n-1; ++i){
        size_t j = i + यादृच्छिकम्()/(RAND_MAX / (n-i)+1);
        स्मृतिं_प्रतिलिख(swp,          arr+(j*आकार), आकार);
        स्मृतिं_प्रतिलिख(arr+(j*आकार), arr+(i*आकार), आकार);
        स्मृतिं_प्रतिलिख(arr+(i*आकार), swp,          आकार);
    }
}

पूर्णाङ्क *random_सूचकांक_क्रमः(पूर्णाङ्क min, पूर्णाङ्क max)
{
    पूर्णाङ्क *inds = शून्यस्मृतिं_देहि(max-min, परिमाण(पूर्णाङ्क));
    पूर्णाङ्क i;
    प्रति(i = min; i < max; ++i){
        inds[i] = i;
    }
    प्रति(i = min; i < max-1; ++i){
        पूर्णाङ्क swap = inds[i];
        पूर्णाङ्क सूचकांक = i + यादृच्छिकम्()%(max-i);
        inds[i] = inds[सूचकांक];
        inds[सूचकांक] = swap;
    }
    प्रत्यागम inds;
}

शून्य del_arg(पूर्णाङ्क argc, वर्ण **argv, पूर्णाङ्क सूचकांक)
{
    पूर्णाङ्क i;
    प्रति(i = सूचकांक; i < argc-1; ++i) argv[i] = argv[i+1];
    argv[i] = 0;
}

पूर्णाङ्क find_arg(पूर्णाङ्क argc, वर्ण* argv[], वर्ण *arg)
{
    पूर्णाङ्क i;
    प्रति(i = 0; i < argc; ++i) {
        यदि(!argv[i]) अनुवर्त;
        यदि(0==वाक्यं_तुलय(argv[i], arg)) {
            del_arg(argc, argv, i);
            प्रत्यागम 1;
        }
    }
    प्रत्यागम 0;
}

पूर्णाङ्क find_int_arg(पूर्णाङ्क argc, वर्ण **argv, वर्ण *arg, पूर्णाङ्क def)
{
    पूर्णाङ्क i;
    प्रति(i = 0; i < argc-1; ++i){
        यदि(!argv[i]) अनुवर्त;
        यदि(0==वाक्यं_तुलय(argv[i], arg)){
            def = atoi(argv[i+1]);
            del_arg(argc, argv, i);
            del_arg(argc, argv, i);
            भङ्ग;
        }
    }
    प्रत्यागम def;
}

भिन्न find_float_arg(पूर्णाङ्क argc, वर्ण **argv, वर्ण *arg, भिन्न def)
{
    पूर्णाङ्क i;
    प्रति(i = 0; i < argc-1; ++i){
        यदि(!argv[i]) अनुवर्त;
        यदि(0==वाक्यं_तुलय(argv[i], arg)){
            def = atof(argv[i+1]);
            del_arg(argc, argv, i);
            del_arg(argc, argv, i);
            भङ्ग;
        }
    }
    प्रत्यागम def;
}

वर्ण *find_char_arg(पूर्णाङ्क argc, वर्ण **argv, वर्ण *arg, वर्ण *def)
{
    पूर्णाङ्क i;
    प्रति(i = 0; i < argc-1; ++i){
        यदि(!argv[i]) अनुवर्त;
        यदि(0==वाक्यं_तुलय(argv[i], arg)){
            def = argv[i+1];
            del_arg(argc, argv, i);
            del_arg(argc, argv, i);
            भङ्ग;
        }
    }
    प्रत्यागम def;
}


वर्ण *basecfg(वर्ण *cfgfile)
{
    वर्ण *c = cfgfile;
    वर्ण *अग्र;
    यावत्((अग्र = strchr(c, '/')))
    {
        c = अग्र+1;
    }
    c = copy_string(c);
    अग्र = strchr(c, '.');
    यदि (अग्र) *अग्र = 0;
    प्रत्यागम c;
}

पूर्णाङ्क alphanum_गन्तव्यम्_int(वर्ण c)
{
    प्रत्यागम (c < 58) ? c - 48 : c-87;
}
वर्ण int_गन्तव्यम्_alphanum(पूर्णाङ्क i)
{
    यदि (i == 36) प्रत्यागम '.';
    प्रत्यागम (i < 10) ? i + 48 : i + 87;
}

शून्य pm(पूर्णाङ्क M, पूर्णाङ्क N, भिन्न *A)
{
    पूर्णाङ्क i,j;
    प्रति(i =0 ; i < M; ++i){
        प्रारूप_लिख("%d ", i+1);
        प्रति(j = 0; j < N; ++j){
            प्रारूप_लिख("%2.4f, ", A[i*N+j]);
        }
        प्रारूप_लिख("\n");
    }
    प्रारूप_लिख("\n");
}

शून्य find_replace(वर्ण *str, वर्ण *orig, वर्ण *rep, वर्ण *output)
{
    वर्ण बफर[4096] = {0};
    वर्ण *p;

    sprintf(बफर, "%s", str);
    यदि(!(p = वाक्ये_अन्विष(बफर, orig))){  // Is 'orig' even in 'str'?
        sprintf(output, "%s", str);
        प्रत्यागम;
    }

    *p = '\0';

    sprintf(output, "%s%s%s", बफर, rep, p+वाक्यदैर्घ्यम्(orig));
}

भिन्न sec(clock_t clocks)
{
    प्रत्यागम (भिन्न)clocks/CLOCKS_PER_SEC;
}

शून्य शिखरम्_k(भिन्न *a, पूर्णाङ्क n, पूर्णाङ्क k, पूर्णाङ्क *सूचकांक)
{
    पूर्णाङ्क i,j;
    प्रति(j = 0; j < k; ++j) सूचकांक[j] = -1;
    प्रति(i = 0; i < n; ++i){
        पूर्णाङ्क curr = i;
        प्रति(j = 0; j < k; ++j){
            यदि((सूचकांक[j] < 0) || a[curr] > a[सूचकांक[j]]){
                पूर्णाङ्क swap = curr;
                curr = सूचकांक[j];
                सूचकांक[j] = swap;
            }
        }
    }
}

शून्य error(ध्रुव वर्ण *s)
{
    perror(s);
    प्रतिज्ञा(0);
    निर्गच्छ(-1);
}

अचिह्नित वर्ण *read_file(वर्ण *filename)
{
    FILE *fp = fopen(filename, "rb");
    size_t आकार;

    fseek(fp, 0, SEEK_END); 
    आकार = ftell(fp);
    fseek(fp, 0, SEEK_SET); 

    अचिह्नित वर्ण *text = शून्यस्मृतिं_देहि(आकार+1, परिमाण(वर्ण));
    fread(text, 1, आकार, fp);
    fclose(fp);
    प्रत्यागम text;
}

शून्य malloc_error()
{
    fprintf(stderr, "Malloc error\n");
    निर्गच्छ(-1);
}

शून्य file_error(वर्ण *s)
{
    fprintf(stderr, "Couldn't open file: %s\n", s);
    निर्गच्छ(0);
}

list *विभज_str(वर्ण *s, वर्ण delim)
{
    size_t i;
    size_t len = वाक्यदैर्घ्यम्(s);
    list *l = make_list();
    list_निवेशय(l, s);
    प्रति(i = 0; i < len; ++i){
        यदि(s[i] == delim){
            s[i] = '\0';
            list_निवेशय(l, &(s[i+1]));
        }
    }
    प्रत्यागम l;
}

शून्य strip(वर्ण *s)
{
    size_t i;
    size_t len = वाक्यदैर्घ्यम्(s);
    size_t विस्थापनम् = 0;
    प्रति(i = 0; i < len; ++i){
        वर्ण c = s[i];
        यदि(c==' '||c=='\t'||c=='\n') ++विस्थापनम्;
        अन्यथा s[i-विस्थापनम्] = c;
    }
    s[len-विस्थापनम्] = '\0';
}

शून्य strip_char(वर्ण *s, वर्ण bad)
{
    size_t i;
    size_t len = वाक्यदैर्घ्यम्(s);
    size_t विस्थापनम् = 0;
    प्रति(i = 0; i < len; ++i){
        वर्ण c = s[i];
        यदि(c==bad) ++विस्थापनम्;
        अन्यथा s[i-विस्थापनम्] = c;
    }
    s[len-विस्थापनम्] = '\0';
}

शून्य free_ptrs(शून्य **ptrs, पूर्णाङ्क n)
{
    पूर्णाङ्क i;
    प्रति(i = 0; i < n; ++i) मुक्त(ptrs[i]);
    मुक्त(ptrs);
}

वर्ण *fgetl(FILE *fp)
{
    यदि(feof(fp)) प्रत्यागम 0;
    size_t आकार = 512;
    वर्ण *पङ्क्तिः = स्मृतिं_देहि(आकार*परिमाण(वर्ण));
    यदि(!fgets(पङ्क्तिः, आकार, fp)){
        मुक्त(पङ्क्तिः);
        प्रत्यागम 0;
    }

    size_t curr = वाक्यदैर्घ्यम्(पङ्क्तिः);

    यावत्((पङ्क्तिः[curr-1] != '\n') && !feof(fp)){
        यदि(curr == आकार-1){
            आकार *= 2;
            पङ्क्तिः = realloc(पङ्क्तिः, आकार*परिमाण(वर्ण));
            यदि(!पङ्क्तिः) {
                प्रारूप_लिख("%ld\n", आकार);
                malloc_error();
            }
        }
        size_t readsize = आकार-curr;
        यदि(readsize > अधिकतम_पूर्णाङ्कः) readsize = अधिकतम_पूर्णाङ्कः-1;
        fgets(&पङ्क्तिः[curr], readsize, fp);
        curr = वाक्यदैर्घ्यम्(पङ्क्तिः);
    }
    यदि(पङ्क्तिः[curr-1] == '\n') पङ्क्तिः[curr-1] = '\0';

    प्रत्यागम पङ्क्तिः;
}

पूर्णाङ्क read_int(पूर्णाङ्क fd)
{
    पूर्णाङ्क n = 0;
    पूर्णाङ्क अग्र = पठ(fd, &n, परिमाण(पूर्णाङ्क));
    यदि(अग्र <= 0) प्रत्यागम -1;
    प्रत्यागम n;
}

शून्य write_int(पूर्णाङ्क fd, पूर्णाङ्क n)
{
    पूर्णाङ्क अग्र = लिख(fd, &n, परिमाण(पूर्णाङ्क));
    यदि(अग्र <= 0) error("read failed");
}

पूर्णाङ्क read_all_fail(पूर्णाङ्क fd, वर्ण *बफर, size_t अष्टकानि)
{
    size_t n = 0;
    यावत्(n < अष्टकानि){
        पूर्णाङ्क अग्र = पठ(fd, बफर + n, अष्टकानि-n);
        यदि(अग्र <= 0) प्रत्यागम 1;
        n += अग्र;
    }
    प्रत्यागम 0;
}

पूर्णाङ्क write_all_fail(पूर्णाङ्क fd, वर्ण *बफर, size_t अष्टकानि)
{
    size_t n = 0;
    यावत्(n < अष्टकानि){
        size_t अग्र = लिख(fd, बफर + n, अष्टकानि-n);
        यदि(अग्र <= 0) प्रत्यागम 1;
        n += अग्र;
    }
    प्रत्यागम 0;
}

शून्य read_all(पूर्णाङ्क fd, वर्ण *बफर, size_t अष्टकानि)
{
    size_t n = 0;
    यावत्(n < अष्टकानि){
        पूर्णाङ्क अग्र = पठ(fd, बफर + n, अष्टकानि-n);
        यदि(अग्र <= 0) error("read failed");
        n += अग्र;
    }
}

शून्य write_all(पूर्णाङ्क fd, वर्ण *बफर, size_t अष्टकानि)
{
    size_t n = 0;
    यावत्(n < अष्टकानि){
        size_t अग्र = लिख(fd, बफर + n, अष्टकानि-n);
        यदि(अग्र <= 0) error("write failed");
        n += अग्र;
    }
}


वर्ण *copy_string(वर्ण *s)
{
    वर्ण *copy = स्मृतिं_देहि(वाक्यदैर्घ्यम्(s)+1);
    strncpy(copy, s, वाक्यदैर्घ्यम्(s)+1);
    प्रत्यागम copy;
}

list *parse_csv_पङ्क्तिः(वर्ण *पङ्क्तिः)
{
    list *l = make_list();
    वर्ण *c, *p;
    पूर्णाङ्क अन्तर् = 0;
    प्रति(c = पङ्क्तिः, p = पङ्क्तिः; *c != '\0'; ++c){
        यदि(*c == '"') अन्तर् = !अन्तर्;
        अन्यथा यदि(*c == ',' && !अन्तर्){
            *c = '\0';
            list_निवेशय(l, copy_string(p));
            p = c+1;
        }
    }
    list_निवेशय(l, copy_string(p));
    प्रत्यागम l;
}

पूर्णाङ्क गणनम्_fields(वर्ण *पङ्क्तिः)
{
    पूर्णाङ्क गणनम् = 0;
    पूर्णाङ्क समाप्तम् = 0;
    वर्ण *c;
    प्रति(c = पङ्क्तिः; !समाप्तम्; ++c){
        समाप्तम् = (*c == '\0');
        यदि(*c == ',' || समाप्तम्) ++गणनम्;
    }
    प्रत्यागम गणनम्;
}

भिन्न *parse_fields(वर्ण *पङ्क्तिः, पूर्णाङ्क n)
{
    भिन्न *क्षेत्रम् = शून्यस्मृतिं_देहि(n, परिमाण(भिन्न));
    वर्ण *c, *p, *अन्तः;
    पूर्णाङ्क गणनम् = 0;
    पूर्णाङ्क समाप्तम् = 0;
    प्रति(c = पङ्क्तिः, p = पङ्क्तिः; !समाप्तम्; ++c){
        समाप्तम् = (*c == '\0');
        यदि(*c == ',' || समाप्तम्){
            *c = '\0';
            क्षेत्रम्[गणनम्] = strtod(p, &अन्तः);
            यदि(p == c) क्षेत्रम्[गणनम्] = nan("");
            यदि(अन्तः != c && (अन्तः != c-1 || *अन्तः != '\r')) क्षेत्रम्[गणनम्] = nan(""); //DOS file formats!
            p = c+1;
            ++गणनम्;
        }
    }
    प्रत्यागम क्षेत्रम्;
}

भिन्न योग_array(भिन्न *a, पूर्णाङ्क n)
{
    पूर्णाङ्क i;
    भिन्न योग = 0;
    प्रति(i = 0; i < n; ++i) योग += a[i];
    प्रत्यागम योग;
}

भिन्न माध्यम्_array(भिन्न *a, पूर्णाङ्क n)
{
    प्रत्यागम योग_array(a,n)/n;
}

शून्य माध्यम्_arrays(भिन्न **a, पूर्णाङ्क n, पूर्णाङ्क els, भिन्न *avg)
{
    पूर्णाङ्क i;
    पूर्णाङ्क j;
    स्मृतिं_पूरय(avg, 0, els*परिमाण(भिन्न));
    प्रति(j = 0; j < n; ++j){
        प्रति(i = 0; i < els; ++i){
            avg[i] += a[j][i];
        }
    }
    प्रति(i = 0; i < els; ++i){
        avg[i] /= n;
    }
}

शून्य print_statistics(भिन्न *a, पूर्णाङ्क n)
{
    भिन्न m = माध्यम्_array(a, n);
    भिन्न v = variance_array(a, n);
    प्रारूप_लिख("MSE: %.6f, Mean: %.6f, Variance: %.6f\n", mse_array(a, n), m, v);
}

भिन्न variance_array(भिन्न *a, पूर्णाङ्क n)
{
    पूर्णाङ्क i;
    भिन्न योग = 0;
    भिन्न माध्यम् = माध्यम्_array(a, n);
    प्रति(i = 0; i < n; ++i) योग += (a[i] - माध्यम्)*(a[i]-माध्यम्);
    भिन्न variance = योग/n;
    प्रत्यागम variance;
}

पूर्णाङ्क constrain_int(पूर्णाङ्क a, पूर्णाङ्क min, पूर्णाङ्क max)
{
    यदि (a < min) प्रत्यागम min;
    यदि (a > max) प्रत्यागम max;
    प्रत्यागम a;
}

भिन्न constrain(भिन्न min, भिन्न max, भिन्न a)
{
    यदि (a < min) प्रत्यागम min;
    यदि (a > max) प्रत्यागम max;
    प्रत्यागम a;
}

भिन्न dist_array(भिन्न *a, भिन्न *b, पूर्णाङ्क n, पूर्णाङ्क sub)
{
    पूर्णाङ्क i;
    भिन्न योग = 0;
    प्रति(i = 0; i < n; i += sub) योग += घातः(a[i]-b[i], 2);
    प्रत्यागम वर्गमूलम्(योग);
}

भिन्न mse_array(भिन्न *a, पूर्णाङ्क n)
{
    पूर्णाङ्क i;
    भिन्न योग = 0;
    प्रति(i = 0; i < n; ++i) योग += a[i]*a[i];
    प्रत्यागम वर्गमूलम्(योग/n);
}

शून्य normalize_array(भिन्न *a, पूर्णाङ्क n)
{
    पूर्णाङ्क i;
    भिन्न mu = माध्यम्_array(a,n);
    भिन्न sigma = वर्गमूलम्(variance_array(a,n));
    प्रति(i = 0; i < n; ++i){
        a[i] = (a[i] - mu)/sigma;
    }
    mu = माध्यम्_array(a,n);
    sigma = वर्गमूलम्(variance_array(a,n));
}

शून्य translate_array(भिन्न *a, पूर्णाङ्क n, भिन्न s)
{
    पूर्णाङ्क i;
    प्रति(i = 0; i < n; ++i){
        a[i] += s;
    }
}

भिन्न mag_array(भिन्न *a, पूर्णाङ्क n)
{
    पूर्णाङ्क i;
    भिन्न योग = 0;
    प्रति(i = 0; i < n; ++i){
        योग += a[i]*a[i];   
    }
    प्रत्यागम वर्गमूलम्(योग);
}

शून्य scale_array(भिन्न *a, पूर्णाङ्क n, भिन्न s)
{
    पूर्णाङ्क i;
    प्रति(i = 0; i < n; ++i){
        a[i] *= s;
    }
}

पूर्णाङ्क sample_array(भिन्न *a, पूर्णाङ्क n)
{
    भिन्न योग = योग_array(a, n);
    scale_array(a, n, 1./योग);
    भिन्न r = rand_एकरूपम्(0, 1);
    पूर्णाङ्क i;
    प्रति(i = 0; i < n; ++i){
        r = r - a[i];
        यदि (r <= 0) प्रत्यागम i;
    }
    प्रत्यागम n-1;
}

पूर्णाङ्क max_int_सूचकांक(पूर्णाङ्क *a, पूर्णाङ्क n)
{
    यदि(n <= 0) प्रत्यागम -1;
    पूर्णाङ्क i, max_i = 0;
    पूर्णाङ्क max = a[0];
    प्रति(i = 1; i < n; ++i){
        यदि(a[i] > max){
            max = a[i];
            max_i = i;
        }
    }
    प्रत्यागम max_i;
}

पूर्णाङ्क max_सूचकांक(भिन्न *a, पूर्णाङ्क n)
{
    यदि(n <= 0) प्रत्यागम -1;
    पूर्णाङ्क i, max_i = 0;
    भिन्न max = a[0];
    प्रति(i = 1; i < n; ++i){
        यदि(a[i] > max){
            max = a[i];
            max_i = i;
        }
    }
    प्रत्यागम max_i;
}

पूर्णाङ्क int_सूचकांक(पूर्णाङ्क *a, पूर्णाङ्क val, पूर्णाङ्क n)
{
    पूर्णाङ्क i;
    प्रति(i = 0; i < n; ++i){
        यदि(a[i] == val) प्रत्यागम i;
    }
    प्रत्यागम -1;
}

पूर्णाङ्क rand_int(पूर्णाङ्क min, पूर्णाङ्क max)
{
    यदि (max < min){
        पूर्णाङ्क s = min;
        min = max;
        max = s;
    }
    पूर्णाङ्क r = (यादृच्छिकम्()%(max - min + 1)) + min;
    प्रत्यागम r;
}

// From http://en.wikipedia.org/wiki/Box%E2%80%93Muller_transform
भिन्न rand_प्रसामान्यम्()
{
    स्थिर पूर्णाङ्क have_अतिरिक्तः = 0;
    स्थिर द्विगुण rand1, rand2;

    यदि(have_अतिरिक्तः)
    {
        have_अतिरिक्तः = 0;
        प्रत्यागम वर्गमूलम्(rand1) * ज्या(rand2);
    }

    have_अतिरिक्तः = 1;

    rand1 = यादृच्छिकम्() / ((द्विगुण) RAND_MAX);
    यदि(rand1 < 1e-100) rand1 = 1e-100;
    rand1 = -2 * लघुगणकः(rand1);
    rand2 = (यादृच्छिकम्() / ((द्विगुण) RAND_MAX)) * TWO_PI;

    प्रत्यागम वर्गमूलम्(rand1) * कोटिज्या(rand2);
}

/*
   float rand_normal()
   {
   int n = 12;
   int i;
   float sum= 0;
   for(i = 0; i < n; ++i) sum += (float)rand()/RAND_MAX;
   return sum-n/2.;
   }
 */

size_t rand_आकार_t()
{
    प्रत्यागम  ((size_t)(यादृच्छिकम्()&0xff) << 56) | 
        ((size_t)(यादृच्छिकम्()&0xff) << 48) |
        ((size_t)(यादृच्छिकम्()&0xff) << 40) |
        ((size_t)(यादृच्छिकम्()&0xff) << 32) |
        ((size_t)(यादृच्छिकम्()&0xff) << 24) |
        ((size_t)(यादृच्छिकम्()&0xff) << 16) |
        ((size_t)(यादृच्छिकम्()&0xff) << 8) |
        ((size_t)(यादृच्छिकम्()&0xff) << 0);
}

भिन्न rand_एकरूपम्(भिन्न min, भिन्न max)
{
    यदि(max < min){
        भिन्न swap = min;
        min = max;
        max = swap;
    }
    प्रत्यागम ((भिन्न)यादृच्छिकम्()/RAND_MAX * (max - min)) + min;
}

भिन्न rand_scale(भिन्न s)
{
    भिन्न scale = rand_एकरूपम्(1, s);
    यदि(यादृच्छिकम्()%2) प्रत्यागम scale;
    प्रत्यागम 1./scale;
}

भिन्न **one_hot_encode(भिन्न *a, पूर्णाङ्क n, पूर्णाङ्क k)
{
    पूर्णाङ्क i;
    भिन्न **t = शून्यस्मृतिं_देहि(n, परिमाण(भिन्न*));
    प्रति(i = 0; i < n; ++i){
        t[i] = शून्यस्मृतिं_देहि(k, परिमाण(भिन्न));
        पूर्णाङ्क सूचकांक = (पूर्णाङ्क)a[i];
        t[i][सूचकांक] = 1;
    }
    प्रत्यागम t;
}

