#ಅನ್ತರ್ಭಾವ <stdio.h>
#ಅನ್ತರ್ಭಾವ <stdlib.h>
#ಅನ್ತರ್ಭಾವ <string.h>
#ಅನ್ತರ್ಭಾವ <math.h>
#ಅನ್ತರ್ಭಾವ <assert.h>
#ಅನ್ತರ್ಭಾವ <unistd.h>
#ಅನ್ತರ್ಭಾವ <float.h>
#ಅನ್ತರ್ಭಾವ <limits.h>
#ಅನ್ತರ್ಭಾವ <time.h>
#ಅನ್ತರ್ಭಾವ <sys/time.h>

#ಅನ್ತರ್ಭಾವ "utils.h"


/*
// old timing. is it better? who knows!!
double get_wall_time()
{
    struct timeval time;
    if (gettimeofday(&time,NULL)){
        return 0;
    }
    return (double)time.tv_sec + (double)time.tv_usec * .000001;
}
*/

ದ್ವಿಗುಣ what_ಸಮಯ_is_it_now()
{
    ರಚನೆ timeval ಸಮಯ;
    ಆದರೆ (gettimeofday(&ಸಮಯ,ಖಾಲಿ)){
        ಹಿಂತಿರುಗಿ 0;
    }
    ಹಿಂತಿರುಗಿ (ದ್ವಿಗುಣ)ಸಮಯ.tv_sec + (ದ್ವಿಗುಣ)ಸಮಯ.tv_usec * .000001;
}

ಪೂರ್ಣಾಂಕ *read_intlist(ಅಕ್ಷರ *gpu_list, ಪೂರ್ಣಾಂಕ *ngpus, ಪೂರ್ಣಾಂಕ d)
{
    ಪೂರ್ಣಾಂಕ *gpus = 0;
    ಆದರೆ(gpu_list){
        ಪೂರ್ಣಾಂಕ len = ಅಕ್ಷರಸರಣಿ_ಉದ್ದ(gpu_list);
        *ngpus = 1;
        ಪೂರ್ಣಾಂಕ i;
        ಗಾಗಿ(i = 0; i < len; ++i){
            ಆದರೆ (gpu_list[i] == ',') ++*ngpus;
        }
        gpus = ಸೊನ್ನೆ_ಸ್ಮರಣೆ_ಕೊಡು(*ngpus, ಗಾತ್ರ(ಪೂರ್ಣಾಂಕ));
        ಗಾಗಿ(i = 0; i < *ngpus; ++i){
            gpus[i] = atoi(gpu_list);
            gpu_list = strchr(gpu_list, ',')+1;
        }
    } ಇಲ್ಲದಿದ್ದರೆ {
        gpus = ಸೊನ್ನೆ_ಸ್ಮರಣೆ_ಕೊಡು(1, ಗಾತ್ರ(ದಶಮಾಂಶ));
        *gpus = d;
        *ngpus = 1;
    }
    ಹಿಂತಿರುಗಿ gpus;
}

ಪೂರ್ಣಾಂಕ *read_map(ಅಕ್ಷರ *filename)
{
    ಪೂರ್ಣಾಂಕ n = 0;
    ಪೂರ್ಣಾಂಕ *map = 0;
    ಅಕ್ಷರ *str;
    FILE *file = fopen(filename, "r");
    ಆದರೆ(!file) file_error(filename);
    ಆಗ((str=fgetl(file))){
        ++n;
        map = realloc(map, n*ಗಾತ್ರ(ಪೂರ್ಣಾಂಕ));
        map[n-1] = atoi(str);
    }
    ಹಿಂತಿರುಗಿ map;
}

ಶೂನ್ಯ sorta_shuffle(ಶೂನ್ಯ *arr, size_t n, size_t ಗಾತ್ರ_2, size_t sections)
{
    size_t i;
    ಗಾಗಿ(i = 0; i < sections; ++i){
        size_t ಆರಂಭ = n*i/sections;
        size_t ಕೊನೆ = n*(i+1)/sections;
        size_t ಅಂಕೆ = ಕೊನೆ-ಆರಂಭ;
        shuffle(arr+(ಆರಂಭ*ಗಾತ್ರ_2), ಅಂಕೆ, ಗಾತ್ರ_2);
    }
}

ಶೂನ್ಯ shuffle(ಶೂನ್ಯ *arr, size_t n, size_t ಗಾತ್ರ_2)
{
    size_t i;
    ಶೂನ್ಯ *swp = ಸೊನ್ನೆ_ಸ್ಮರಣೆ_ಕೊಡು(1, ಗಾತ್ರ_2);
    ಗಾಗಿ(i = 0; i < n-1; ++i){
        size_t j = i + rand()/(RAND_MAX / (n-i)+1);
        ಸ್ಮರಣೆ_ನಕಲು(swp,          arr+(j*ಗಾತ್ರ_2), ಗಾತ್ರ_2);
        ಸ್ಮರಣೆ_ನಕಲು(arr+(j*ಗಾತ್ರ_2), arr+(i*ಗಾತ್ರ_2), ಗಾತ್ರ_2);
        ಸ್ಮರಣೆ_ನಕಲು(arr+(i*ಗಾತ್ರ_2), swp,          ಗಾತ್ರ_2);
    }
}

ಪೂರ್ಣಾಂಕ *random_ಸೂಚ್ಯಂಕ_ಕ್ರಮ(ಪೂರ್ಣಾಂಕ min, ಪೂರ್ಣಾಂಕ max)
{
    ಪೂರ್ಣಾಂಕ *inds = ಸೊನ್ನೆ_ಸ್ಮರಣೆ_ಕೊಡು(max-min, ಗಾತ್ರ(ಪೂರ್ಣಾಂಕ));
    ಪೂರ್ಣಾಂಕ i;
    ಗಾಗಿ(i = min; i < max; ++i){
        inds[i] = i;
    }
    ಗಾಗಿ(i = min; i < max-1; ++i){
        ಪೂರ್ಣಾಂಕ ಅದಲುಬದಲು = inds[i];
        ಪೂರ್ಣಾಂಕ ಸೂಚ್ಯಂಕ = i + rand()%(max-i);
        inds[i] = inds[ಸೂಚ್ಯಂಕ];
        inds[ಸೂಚ್ಯಂಕ] = ಅದಲುಬದಲು;
    }
    ಹಿಂತಿರುಗಿ inds;
}

ಶೂನ್ಯ del_arg(ಪೂರ್ಣಾಂಕ argc, ಅಕ್ಷರ **argv, ಪೂರ್ಣಾಂಕ ಸೂಚ್ಯಂಕ)
{
    ಪೂರ್ಣಾಂಕ i;
    ಗಾಗಿ(i = ಸೂಚ್ಯಂಕ; i < argc-1; ++i) argv[i] = argv[i+1];
    argv[i] = 0;
}

ಪೂರ್ಣಾಂಕ ಕಂಡುಹಿಡಿ_arg(ಪೂರ್ಣಾಂಕ argc, ಅಕ್ಷರ* argv[], ಅಕ್ಷರ *arg)
{
    ಪೂರ್ಣಾಂಕ i;
    ಗಾಗಿ(i = 0; i < argc; ++i) {
        ಆದರೆ(!argv[i]) ಮುಂದುವರಿ;
        ಆದರೆ(0==strcmp(argv[i], arg)) {
            del_arg(argc, argv, i);
            ಹಿಂತಿರುಗಿ 1;
        }
    }
    ಹಿಂತಿರುಗಿ 0;
}

ಪೂರ್ಣಾಂಕ ಕಂಡುಹಿಡಿ_int_arg(ಪೂರ್ಣಾಂಕ argc, ಅಕ್ಷರ **argv, ಅಕ್ಷರ *arg, ಪೂರ್ಣಾಂಕ def)
{
    ಪೂರ್ಣಾಂಕ i;
    ಗಾಗಿ(i = 0; i < argc-1; ++i){
        ಆದರೆ(!argv[i]) ಮುಂದುವರಿ;
        ಆದರೆ(0==strcmp(argv[i], arg)){
            def = atoi(argv[i+1]);
            del_arg(argc, argv, i);
            del_arg(argc, argv, i);
            ನಿಲ್ಲಿಸು;
        }
    }
    ಹಿಂತಿರುಗಿ def;
}

ದಶಮಾಂಶ ಕಂಡುಹಿಡಿ_float_arg(ಪೂರ್ಣಾಂಕ argc, ಅಕ್ಷರ **argv, ಅಕ್ಷರ *arg, ದಶಮಾಂಶ def)
{
    ಪೂರ್ಣಾಂಕ i;
    ಗಾಗಿ(i = 0; i < argc-1; ++i){
        ಆದರೆ(!argv[i]) ಮುಂದುವರಿ;
        ಆದರೆ(0==strcmp(argv[i], arg)){
            def = atof(argv[i+1]);
            del_arg(argc, argv, i);
            del_arg(argc, argv, i);
            ನಿಲ್ಲಿಸು;
        }
    }
    ಹಿಂತಿರುಗಿ def;
}

ಅಕ್ಷರ *ಕಂಡುಹಿಡಿ_char_arg(ಪೂರ್ಣಾಂಕ argc, ಅಕ್ಷರ **argv, ಅಕ್ಷರ *arg, ಅಕ್ಷರ *def)
{
    ಪೂರ್ಣಾಂಕ i;
    ಗಾಗಿ(i = 0; i < argc-1; ++i){
        ಆದರೆ(!argv[i]) ಮುಂದುವರಿ;
        ಆದರೆ(0==strcmp(argv[i], arg)){
            def = argv[i+1];
            del_arg(argc, argv, i);
            del_arg(argc, argv, i);
            ನಿಲ್ಲಿಸು;
        }
    }
    ಹಿಂತಿರುಗಿ def;
}


ಅಕ್ಷರ *basecfg(ಅಕ್ಷರ *cfgfile)
{
    ಅಕ್ಷರ *c = cfgfile;
    ಅಕ್ಷರ *ಮುಂದಿನ;
    ಆಗ((ಮುಂದಿನ = strchr(c, '/')))
    {
        c = ಮುಂದಿನ+1;
    }
    c = copy_string(c);
    ಮುಂದಿನ = strchr(c, '.');
    ಆದರೆ (ಮುಂದಿನ) *ಮುಂದಿನ = 0;
    ಹಿಂತಿರುಗಿ c;
}

ಪೂರ್ಣಾಂಕ alphanum_ಗಮ್ಯ_int(ಅಕ್ಷರ c)
{
    ಹಿಂತಿರುಗಿ (c < 58) ? c - 48 : c-87;
}
ಅಕ್ಷರ int_ಗಮ್ಯ_alphanum(ಪೂರ್ಣಾಂಕ i)
{
    ಆದರೆ (i == 36) ಹಿಂತಿರುಗಿ '.';
    ಹಿಂತಿರುಗಿ (i < 10) ? i + 48 : i + 87;
}

ಶೂನ್ಯ pm(ಪೂರ್ಣಾಂಕ M, ಪೂರ್ಣಾಂಕ N, ದಶಮಾಂಶ *A)
{
    ಪೂರ್ಣಾಂಕ i,j;
    ಗಾಗಿ(i =0 ; i < M; ++i){
        ಬರೆ("%d ", i+1);
        ಗಾಗಿ(j = 0; j < N; ++j){
            ಬರೆ("%2.4f, ", A[i*N+j]);
        }
        ಬರೆ("\n");
    }
    ಬರೆ("\n");
}

ಶೂನ್ಯ ಕಂಡುಹಿಡಿ_replace(ಅಕ್ಷರ *str, ಅಕ್ಷರ *orig, ಅಕ್ಷರ *rep, ಅಕ್ಷರ *output)
{
    ಅಕ್ಷರ ಬಫರ್[4096] = {0};
    ಅಕ್ಷರ *p;

    sprintf(ಬಫರ್, "%s", str);
    ಆದರೆ(!(p = ಅಕ್ಷರಸರಣಿ_ಹುಡುಕು(ಬಫರ್, orig))){  // Is 'orig' even in 'str'?
        sprintf(output, "%s", str);
        ಹಿಂತಿರುಗಿ;
    }

    *p = '\0';

    sprintf(output, "%s%s%s", ಬಫರ್, rep, p+ಅಕ್ಷರಸರಣಿ_ಉದ್ದ(orig));
}

ದಶಮಾಂಶ sec(clock_t clocks)
{
    ಹಿಂತಿರುಗಿ (ದಶಮಾಂಶ)clocks/CLOCKS_PER_SEC;
}

ಶೂನ್ಯ ತುದಿ_k(ದಶಮಾಂಶ *a, ಪೂರ್ಣಾಂಕ n, ಪೂರ್ಣಾಂಕ k, ಪೂರ್ಣಾಂಕ *ಸೂಚ್ಯಂಕ)
{
    ಪೂರ್ಣಾಂಕ i,j;
    ಗಾಗಿ(j = 0; j < k; ++j) ಸೂಚ್ಯಂಕ[j] = -1;
    ಗಾಗಿ(i = 0; i < n; ++i){
        ಪೂರ್ಣಾಂಕ curr = i;
        ಗಾಗಿ(j = 0; j < k; ++j){
            ಆದರೆ((ಸೂಚ್ಯಂಕ[j] < 0) || a[curr] > a[ಸೂಚ್ಯಂಕ[j]]){
                ಪೂರ್ಣಾಂಕ ಅದಲುಬದಲು = curr;
                curr = ಸೂಚ್ಯಂಕ[j];
                ಸೂಚ್ಯಂಕ[j] = ಅದಲುಬದಲು;
            }
        }
    }
}

ಶೂನ್ಯ error(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s)
{
    perror(s);
    ಪ್ರತಿಜ್ಞಾ(0);
    ನಿರ್ಗಮಿಸು(-1);
}

ಚಿಹ್ನೆರಹಿತ ಅಕ್ಷರ *read_file(ಅಕ್ಷರ *filename)
{
    FILE *fp = fopen(filename, "rb");
    size_t ಗಾತ್ರ_2;

    fseek(fp, 0, SEEK_END); 
    ಗಾತ್ರ_2 = ftell(fp);
    fseek(fp, 0, SEEK_SET); 

    ಚಿಹ್ನೆರಹಿತ ಅಕ್ಷರ *ಪಠ್ಯ = ಸೊನ್ನೆ_ಸ್ಮರಣೆ_ಕೊಡು(ಗಾತ್ರ_2+1, ಗಾತ್ರ(ಅಕ್ಷರ));
    fread(ಪಠ್ಯ, 1, ಗಾತ್ರ_2, fp);
    fclose(fp);
    ಹಿಂತಿರುಗಿ ಪಠ್ಯ;
}

ಶೂನ್ಯ malloc_error()
{
    fprintf(stderr, "Malloc error\n");
    ನಿರ್ಗಮಿಸು(-1);
}

ಶೂನ್ಯ file_error(ಅಕ್ಷರ *s)
{
    fprintf(stderr, "Couldn't open file: %s\n", s);
    ನಿರ್ಗಮಿಸು(0);
}

list *ವಿಭಜಿಸು_str(ಅಕ್ಷರ *s, ಅಕ್ಷರ delim)
{
    size_t i;
    size_t len = ಅಕ್ಷರಸರಣಿ_ಉದ್ದ(s);
    list *l = make_list();
    list_ಸೇರಿಸು(l, s);
    ಗಾಗಿ(i = 0; i < len; ++i){
        ಆದರೆ(s[i] == delim){
            s[i] = '\0';
            list_ಸೇರಿಸು(l, &(s[i+1]));
        }
    }
    ಹಿಂತಿರುಗಿ l;
}

ಶೂನ್ಯ strip(ಅಕ್ಷರ *s)
{
    size_t i;
    size_t len = ಅಕ್ಷರಸರಣಿ_ಉದ್ದ(s);
    size_t ಸ್ಥಾನಾಂತರ = 0;
    ಗಾಗಿ(i = 0; i < len; ++i){
        ಅಕ್ಷರ c = s[i];
        ಆದರೆ(c==' '||c=='\t'||c=='\n') ++ಸ್ಥಾನಾಂತರ;
        ಇಲ್ಲದಿದ್ದರೆ s[i-ಸ್ಥಾನಾಂತರ] = c;
    }
    s[len-ಸ್ಥಾನಾಂತರ] = '\0';
}

ಶೂನ್ಯ strip_char(ಅಕ್ಷರ *s, ಅಕ್ಷರ bad)
{
    size_t i;
    size_t len = ಅಕ್ಷರಸರಣಿ_ಉದ್ದ(s);
    size_t ಸ್ಥಾನಾಂತರ = 0;
    ಗಾಗಿ(i = 0; i < len; ++i){
        ಅಕ್ಷರ c = s[i];
        ಆದರೆ(c==bad) ++ಸ್ಥಾನಾಂತರ;
        ಇಲ್ಲದಿದ್ದರೆ s[i-ಸ್ಥಾನಾಂತರ] = c;
    }
    s[len-ಸ್ಥಾನಾಂತರ] = '\0';
}

ಶೂನ್ಯ free_ptrs(ಶೂನ್ಯ **ptrs, ಪೂರ್ಣಾಂಕ n)
{
    ಪೂರ್ಣಾಂಕ i;
    ಗಾಗಿ(i = 0; i < n; ++i) ಬಿಡುಗಡೆ(ptrs[i]);
    ಬಿಡುಗಡೆ(ptrs);
}

ಅಕ್ಷರ *fgetl(FILE *fp)
{
    ಆದರೆ(feof(fp)) ಹಿಂತಿರುಗಿ 0;
    size_t ಗಾತ್ರ_2 = 512;
    ಅಕ್ಷರ *ಸಾಲು = ಸ್ಮರಣೆ_ಕೊಡು(ಗಾತ್ರ_2*ಗಾತ್ರ(ಅಕ್ಷರ));
    ಆದರೆ(!fgets(ಸಾಲು, ಗಾತ್ರ_2, fp)){
        ಬಿಡುಗಡೆ(ಸಾಲು);
        ಹಿಂತಿರುಗಿ 0;
    }

    size_t curr = ಅಕ್ಷರಸರಣಿ_ಉದ್ದ(ಸಾಲು);

    ಆಗ((ಸಾಲು[curr-1] != '\n') && !feof(fp)){
        ಆದರೆ(curr == ಗಾತ್ರ_2-1){
            ಗಾತ್ರ_2 *= 2;
            ಸಾಲು = realloc(ಸಾಲು, ಗಾತ್ರ_2*ಗಾತ್ರ(ಅಕ್ಷರ));
            ಆದರೆ(!ಸಾಲು) {
                ಬರೆ("%ld\n", ಗಾತ್ರ_2);
                malloc_error();
            }
        }
        size_t readsize = ಗಾತ್ರ_2-curr;
        ಆದರೆ(readsize > ಗರಿಷ್ಠ_ಪೂರ್ಣಾಂಕ) readsize = ಗರಿಷ್ಠ_ಪೂರ್ಣಾಂಕ-1;
        fgets(&ಸಾಲು[curr], readsize, fp);
        curr = ಅಕ್ಷರಸರಣಿ_ಉದ್ದ(ಸಾಲು);
    }
    ಆದರೆ(ಸಾಲು[curr-1] == '\n') ಸಾಲು[curr-1] = '\0';

    ಹಿಂತಿರುಗಿ ಸಾಲು;
}

ಪೂರ್ಣಾಂಕ read_int(ಪೂರ್ಣಾಂಕ fd)
{
    ಪೂರ್ಣಾಂಕ n = 0;
    ಪೂರ್ಣಾಂಕ ಮುಂದಿನ = ಪಠ(fd, &n, ಗಾತ್ರ(ಪೂರ್ಣಾಂಕ));
    ಆದರೆ(ಮುಂದಿನ <= 0) ಹಿಂತಿರುಗಿ -1;
    ಹಿಂತಿರುಗಿ n;
}

ಶೂನ್ಯ write_int(ಪೂರ್ಣಾಂಕ fd, ಪೂರ್ಣಾಂಕ n)
{
    ಪೂರ್ಣಾಂಕ ಮುಂದಿನ = ಲಿಖ(fd, &n, ಗಾತ್ರ(ಪೂರ್ಣಾಂಕ));
    ಆದರೆ(ಮುಂದಿನ <= 0) error("read failed");
}

ಪೂರ್ಣಾಂಕ read_all_fail(ಪೂರ್ಣಾಂಕ fd, ಅಕ್ಷರ *ಬಫರ್, size_t ಬೈಟುಗಳು)
{
    size_t n = 0;
    ಆಗ(n < ಬೈಟುಗಳು){
        ಪೂರ್ಣಾಂಕ ಮುಂದಿನ = ಪಠ(fd, ಬಫರ್ + n, ಬೈಟುಗಳು-n);
        ಆದರೆ(ಮುಂದಿನ <= 0) ಹಿಂತಿರುಗಿ 1;
        n += ಮುಂದಿನ;
    }
    ಹಿಂತಿರುಗಿ 0;
}

ಪೂರ್ಣಾಂಕ write_all_fail(ಪೂರ್ಣಾಂಕ fd, ಅಕ್ಷರ *ಬಫರ್, size_t ಬೈಟುಗಳು)
{
    size_t n = 0;
    ಆಗ(n < ಬೈಟುಗಳು){
        size_t ಮುಂದಿನ = ಲಿಖ(fd, ಬಫರ್ + n, ಬೈಟುಗಳು-n);
        ಆದರೆ(ಮುಂದಿನ <= 0) ಹಿಂತಿರುಗಿ 1;
        n += ಮುಂದಿನ;
    }
    ಹಿಂತಿರುಗಿ 0;
}

ಶೂನ್ಯ read_all(ಪೂರ್ಣಾಂಕ fd, ಅಕ್ಷರ *ಬಫರ್, size_t ಬೈಟುಗಳು)
{
    size_t n = 0;
    ಆಗ(n < ಬೈಟುಗಳು){
        ಪೂರ್ಣಾಂಕ ಮುಂದಿನ = ಪಠ(fd, ಬಫರ್ + n, ಬೈಟುಗಳು-n);
        ಆದರೆ(ಮುಂದಿನ <= 0) error("read failed");
        n += ಮುಂದಿನ;
    }
}

ಶೂನ್ಯ write_all(ಪೂರ್ಣಾಂಕ fd, ಅಕ್ಷರ *ಬಫರ್, size_t ಬೈಟುಗಳು)
{
    size_t n = 0;
    ಆಗ(n < ಬೈಟುಗಳು){
        size_t ಮುಂದಿನ = ಲಿಖ(fd, ಬಫರ್ + n, ಬೈಟುಗಳು-n);
        ಆದರೆ(ಮುಂದಿನ <= 0) error("write failed");
        n += ಮುಂದಿನ;
    }
}


ಅಕ್ಷರ *copy_string(ಅಕ್ಷರ *s)
{
    ಅಕ್ಷರ *copy = ಸ್ಮರಣೆ_ಕೊಡು(ಅಕ್ಷರಸರಣಿ_ಉದ್ದ(s)+1);
    strncpy(copy, s, ಅಕ್ಷರಸರಣಿ_ಉದ್ದ(s)+1);
    ಹಿಂತಿರುಗಿ copy;
}

list *parse_csv_ಸಾಲು(ಅಕ್ಷರ *ಸಾಲು)
{
    list *l = make_list();
    ಅಕ್ಷರ *c, *p;
    ಪೂರ್ಣಾಂಕ ಒಳ = 0;
    ಗಾಗಿ(c = ಸಾಲು, p = ಸಾಲು; *c != '\0'; ++c){
        ಆದರೆ(*c == '"') ಒಳ = !ಒಳ;
        ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ(*c == ',' && !ಒಳ){
            *c = '\0';
            list_ಸೇರಿಸು(l, copy_string(p));
            p = c+1;
        }
    }
    list_ಸೇರಿಸು(l, copy_string(p));
    ಹಿಂತಿರುಗಿ l;
}

ಪೂರ್ಣಾಂಕ ಎಣಿಕೆ_fields(ಅಕ್ಷರ *ಸಾಲು)
{
    ಪೂರ್ಣಾಂಕ ಎಣಿಕೆ_2 = 0;
    ಪೂರ್ಣಾಂಕ ಮುಗಿದ = 0;
    ಅಕ್ಷರ *c;
    ಗಾಗಿ(c = ಸಾಲು; !ಮುಗಿದ; ++c){
        ಮುಗಿದ = (*c == '\0');
        ಆದರೆ(*c == ',' || ಮುಗಿದ) ++ಎಣಿಕೆ_2;
    }
    ಹಿಂತಿರುಗಿ ಎಣಿಕೆ_2;
}

ದಶಮಾಂಶ *parse_fields(ಅಕ್ಷರ *ಸಾಲು, ಪೂರ್ಣಾಂಕ n)
{
    ದಶಮಾಂಶ *ಕ್ಷೇತ್ರ = ಸೊನ್ನೆ_ಸ್ಮರಣೆ_ಕೊಡು(n, ಗಾತ್ರ(ದಶಮಾಂಶ));
    ಅಕ್ಷರ *c, *p, *ಕೊನೆ;
    ಪೂರ್ಣಾಂಕ ಎಣಿಕೆ_2 = 0;
    ಪೂರ್ಣಾಂಕ ಮುಗಿದ = 0;
    ಗಾಗಿ(c = ಸಾಲು, p = ಸಾಲು; !ಮುಗಿದ; ++c){
        ಮುಗಿದ = (*c == '\0');
        ಆದರೆ(*c == ',' || ಮುಗಿದ){
            *c = '\0';
            ಕ್ಷೇತ್ರ[ಎಣಿಕೆ_2] = strtod(p, &ಕೊನೆ);
            ಆದರೆ(p == c) ಕ್ಷೇತ್ರ[ಎಣಿಕೆ_2] = nan("");
            ಆದರೆ(ಕೊನೆ != c && (ಕೊನೆ != c-1 || *ಕೊನೆ != '\r')) ಕ್ಷೇತ್ರ[ಎಣಿಕೆ_2] = nan(""); //DOS file formats!
            p = c+1;
            ++ಎಣಿಕೆ_2;
        }
    }
    ಹಿಂತಿರುಗಿ ಕ್ಷೇತ್ರ;
}

ದಶಮಾಂಶ ಮೊತ್ತ_array(ದಶಮಾಂಶ *a, ಪೂರ್ಣಾಂಕ n)
{
    ಪೂರ್ಣಾಂಕ i;
    ದಶಮಾಂಶ ಮೊತ್ತ = 0;
    ಗಾಗಿ(i = 0; i < n; ++i) ಮೊತ್ತ += a[i];
    ಹಿಂತಿರುಗಿ ಮೊತ್ತ;
}

ದಶಮಾಂಶ ಸರಾಸರಿ_array(ದಶಮಾಂಶ *a, ಪೂರ್ಣಾಂಕ n)
{
    ಹಿಂತಿರುಗಿ ಮೊತ್ತ_array(a,n)/n;
}

ಶೂನ್ಯ ಸರಾಸರಿ_arrays(ದಶಮಾಂಶ **a, ಪೂರ್ಣಾಂಕ n, ಪೂರ್ಣಾಂಕ els, ದಶಮಾಂಶ *avg)
{
    ಪೂರ್ಣಾಂಕ i;
    ಪೂರ್ಣಾಂಕ j;
    memset(avg, 0, els*ಗಾತ್ರ(ದಶಮಾಂಶ));
    ಗಾಗಿ(j = 0; j < n; ++j){
        ಗಾಗಿ(i = 0; i < els; ++i){
            avg[i] += a[j][i];
        }
    }
    ಗಾಗಿ(i = 0; i < els; ++i){
        avg[i] /= n;
    }
}

ಶೂನ್ಯ print_statistics(ದಶಮಾಂಶ *a, ಪೂರ್ಣಾಂಕ n)
{
    ದಶಮಾಂಶ m = ಸರಾಸರಿ_array(a, n);
    ದಶಮಾಂಶ v = variance_array(a, n);
    ಬರೆ("MSE: %.6f, Mean: %.6f, Variance: %.6f\n", mse_array(a, n), m, v);
}

ದಶಮಾಂಶ variance_array(ದಶಮಾಂಶ *a, ಪೂರ್ಣಾಂಕ n)
{
    ಪೂರ್ಣಾಂಕ i;
    ದಶಮಾಂಶ ಮೊತ್ತ = 0;
    ದಶಮಾಂಶ ಸರಾಸರಿ = ಸರಾಸರಿ_array(a, n);
    ಗಾಗಿ(i = 0; i < n; ++i) ಮೊತ್ತ += (a[i] - ಸರಾಸರಿ)*(a[i]-ಸರಾಸರಿ);
    ದಶಮಾಂಶ variance = ಮೊತ್ತ/n;
    ಹಿಂತಿರುಗಿ variance;
}

ಪೂರ್ಣಾಂಕ constrain_int(ಪೂರ್ಣಾಂಕ a, ಪೂರ್ಣಾಂಕ min, ಪೂರ್ಣಾಂಕ max)
{
    ಆದರೆ (a < min) ಹಿಂತಿರುಗಿ min;
    ಆದರೆ (a > max) ಹಿಂತಿರುಗಿ max;
    ಹಿಂತಿರುಗಿ a;
}

ದಶಮಾಂಶ constrain(ದಶಮಾಂಶ min, ದಶಮಾಂಶ max, ದಶಮಾಂಶ a)
{
    ಆದರೆ (a < min) ಹಿಂತಿರುಗಿ min;
    ಆದರೆ (a > max) ಹಿಂತಿರುಗಿ max;
    ಹಿಂತಿರುಗಿ a;
}

ದಶಮಾಂಶ dist_array(ದಶಮಾಂಶ *a, ದಶಮಾಂಶ *b, ಪೂರ್ಣಾಂಕ n, ಪೂರ್ಣಾಂಕ sub)
{
    ಪೂರ್ಣಾಂಕ i;
    ದಶಮಾಂಶ ಮೊತ್ತ = 0;
    ಗಾಗಿ(i = 0; i < n; i += sub) ಮೊತ್ತ += ಘಾತ(a[i]-b[i], 2);
    ಹಿಂತಿರುಗಿ ವರ್ಗಮೂಲ(ಮೊತ್ತ);
}

ದಶಮಾಂಶ mse_array(ದಶಮಾಂಶ *a, ಪೂರ್ಣಾಂಕ n)
{
    ಪೂರ್ಣಾಂಕ i;
    ದಶಮಾಂಶ ಮೊತ್ತ = 0;
    ಗಾಗಿ(i = 0; i < n; ++i) ಮೊತ್ತ += a[i]*a[i];
    ಹಿಂತಿರುಗಿ ವರ್ಗಮೂಲ(ಮೊತ್ತ/n);
}

ಶೂನ್ಯ normalize_array(ದಶಮಾಂಶ *a, ಪೂರ್ಣಾಂಕ n)
{
    ಪೂರ್ಣಾಂಕ i;
    ದಶಮಾಂಶ mu = ಸರಾಸರಿ_array(a,n);
    ದಶಮಾಂಶ sigma = ವರ್ಗಮೂಲ(variance_array(a,n));
    ಗಾಗಿ(i = 0; i < n; ++i){
        a[i] = (a[i] - mu)/sigma;
    }
    mu = ಸರಾಸರಿ_array(a,n);
    sigma = ವರ್ಗಮೂಲ(variance_array(a,n));
}

ಶೂನ್ಯ translate_array(ದಶಮಾಂಶ *a, ಪೂರ್ಣಾಂಕ n, ದಶಮಾಂಶ s)
{
    ಪೂರ್ಣಾಂಕ i;
    ಗಾಗಿ(i = 0; i < n; ++i){
        a[i] += s;
    }
}

ದಶಮಾಂಶ mag_array(ದಶಮಾಂಶ *a, ಪೂರ್ಣಾಂಕ n)
{
    ಪೂರ್ಣಾಂಕ i;
    ದಶಮಾಂಶ ಮೊತ್ತ = 0;
    ಗಾಗಿ(i = 0; i < n; ++i){
        ಮೊತ್ತ += a[i]*a[i];   
    }
    ಹಿಂತಿರುಗಿ ವರ್ಗಮೂಲ(ಮೊತ್ತ);
}

ಶೂನ್ಯ scale_array(ದಶಮಾಂಶ *a, ಪೂರ್ಣಾಂಕ n, ದಶಮಾಂಶ s)
{
    ಪೂರ್ಣಾಂಕ i;
    ಗಾಗಿ(i = 0; i < n; ++i){
        a[i] *= s;
    }
}

ಪೂರ್ಣಾಂಕ sample_array(ದಶಮಾಂಶ *a, ಪೂರ್ಣಾಂಕ n)
{
    ದಶಮಾಂಶ ಮೊತ್ತ = ಮೊತ್ತ_array(a, n);
    scale_array(a, n, 1./ಮೊತ್ತ);
    ದಶಮಾಂಶ r = rand_ಏಕರೂಪ(0, 1);
    ಪೂರ್ಣಾಂಕ i;
    ಗಾಗಿ(i = 0; i < n; ++i){
        r = r - a[i];
        ಆದರೆ (r <= 0) ಹಿಂತಿರುಗಿ i;
    }
    ಹಿಂತಿರುಗಿ n-1;
}

ಪೂರ್ಣಾಂಕ max_int_ಸೂಚ್ಯಂಕ(ಪೂರ್ಣಾಂಕ *a, ಪೂರ್ಣಾಂಕ n)
{
    ಆದರೆ(n <= 0) ಹಿಂತಿರುಗಿ -1;
    ಪೂರ್ಣಾಂಕ i, max_i = 0;
    ಪೂರ್ಣಾಂಕ max = a[0];
    ಗಾಗಿ(i = 1; i < n; ++i){
        ಆದರೆ(a[i] > max){
            max = a[i];
            max_i = i;
        }
    }
    ಹಿಂತಿರುಗಿ max_i;
}

ಪೂರ್ಣಾಂಕ max_ಸೂಚ್ಯಂಕ(ದಶಮಾಂಶ *a, ಪೂರ್ಣಾಂಕ n)
{
    ಆದರೆ(n <= 0) ಹಿಂತಿರುಗಿ -1;
    ಪೂರ್ಣಾಂಕ i, max_i = 0;
    ದಶಮಾಂಶ max = a[0];
    ಗಾಗಿ(i = 1; i < n; ++i){
        ಆದರೆ(a[i] > max){
            max = a[i];
            max_i = i;
        }
    }
    ಹಿಂತಿರುಗಿ max_i;
}

ಪೂರ್ಣಾಂಕ int_ಸೂಚ್ಯಂಕ(ಪೂರ್ಣಾಂಕ *a, ಪೂರ್ಣಾಂಕ val, ಪೂರ್ಣಾಂಕ n)
{
    ಪೂರ್ಣಾಂಕ i;
    ಗಾಗಿ(i = 0; i < n; ++i){
        ಆದರೆ(a[i] == val) ಹಿಂತಿರುಗಿ i;
    }
    ಹಿಂತಿರುಗಿ -1;
}

ಪೂರ್ಣಾಂಕ rand_int(ಪೂರ್ಣಾಂಕ min, ಪೂರ್ಣಾಂಕ max)
{
    ಆದರೆ (max < min){
        ಪೂರ್ಣಾಂಕ s = min;
        min = max;
        max = s;
    }
    ಪೂರ್ಣಾಂಕ r = (rand()%(max - min + 1)) + min;
    ಹಿಂತಿರುಗಿ r;
}

// From http://en.wikipedia.org/wiki/Box%E2%80%93Muller_transform
ದಶಮಾಂಶ rand_ಸಾಮಾನ್ಯ()
{
    ಸ್ಥಿರ ಪೂರ್ಣಾಂಕ have_ಹೆಚ್ಚುವರಿ = 0;
    ಸ್ಥಿರ ದ್ವಿಗುಣ rand1, rand2;

    ಆದರೆ(have_ಹೆಚ್ಚುವರಿ)
    {
        have_ಹೆಚ್ಚುವರಿ = 0;
        ಹಿಂತಿರುಗಿ ವರ್ಗಮೂಲ(rand1) * ಜ್ಯಾ(rand2);
    }

    have_ಹೆಚ್ಚುವರಿ = 1;

    rand1 = rand() / ((ದ್ವಿಗುಣ) RAND_MAX);
    ಆದರೆ(rand1 < 1e-100) rand1 = 1e-100;
    rand1 = -2 * ಲಘುಗಣಕ(rand1);
    rand2 = (rand() / ((ದ್ವಿಗುಣ) RAND_MAX)) * TWO_PI;

    ಹಿಂತಿರುಗಿ ವರ್ಗಮೂಲ(rand1) * ಕೋಜ್ಯಾ(rand2);
}

/*
   float rand_normal()
   {
   int n = 12;
   int i;
   float sum= 0;
   for(i = 0; i < n; ++i) sum += (float)rand()/RAND_MAX;
   return sum-n/2.;
   }
 */

size_t rand_ಗಾತ್ರ_t()
{
    ಹಿಂತಿರುಗಿ  ((size_t)(rand()&0xff) << 56) | 
        ((size_t)(rand()&0xff) << 48) |
        ((size_t)(rand()&0xff) << 40) |
        ((size_t)(rand()&0xff) << 32) |
        ((size_t)(rand()&0xff) << 24) |
        ((size_t)(rand()&0xff) << 16) |
        ((size_t)(rand()&0xff) << 8) |
        ((size_t)(rand()&0xff) << 0);
}

ದಶಮಾಂಶ rand_ಏಕರೂಪ(ದಶಮಾಂಶ min, ದಶಮಾಂಶ max)
{
    ಆದರೆ(max < min){
        ದಶಮಾಂಶ ಅದಲುಬದಲು = min;
        min = max;
        max = ಅದಲುಬದಲು;
    }
    ಹಿಂತಿರುಗಿ ((ದಶಮಾಂಶ)rand()/RAND_MAX * (max - min)) + min;
}

ದಶಮಾಂಶ rand_scale(ದಶಮಾಂಶ s)
{
    ದಶಮಾಂಶ scale = rand_ಏಕರೂಪ(1, s);
    ಆದರೆ(rand()%2) ಹಿಂತಿರುಗಿ scale;
    ಹಿಂತಿರುಗಿ 1./scale;
}

ದಶಮಾಂಶ **one_hot_encode(ದಶಮಾಂಶ *a, ಪೂರ್ಣಾಂಕ n, ಪೂರ್ಣಾಂಕ k)
{
    ಪೂರ್ಣಾಂಕ i;
    ದಶಮಾಂಶ **t = ಸೊನ್ನೆ_ಸ್ಮರಣೆ_ಕೊಡು(n, ಗಾತ್ರ(ದಶಮಾಂಶ*));
    ಗಾಗಿ(i = 0; i < n; ++i){
        t[i] = ಸೊನ್ನೆ_ಸ್ಮರಣೆ_ಕೊಡು(k, ಗಾತ್ರ(ದಶಮಾಂಶ));
        ಪೂರ್ಣಾಂಕ ಸೂಚ್ಯಂಕ = (ಪೂರ್ಣಾಂಕ)a[i];
        t[i][ಸೂಚ್ಯಂಕ] = 1;
    }
    ಹಿಂತಿರುಗಿ t;
}

