#అన్తర్భావ <stdio.h>
#అన్తర్భావ <stdlib.h>
#అన్తర్భావ <string.h>
#అన్తర్భావ <math.h>
#అన్తర్భావ <assert.h>
#అన్తర్భావ <unistd.h>
#అన్తర్భావ <float.h>
#అన్తర్భావ <limits.h>
#అన్తర్భావ <time.h>
#అన్తర్భావ <sys/time.h>

#అన్తర్భావ "utils.h"


/*
// old timing. is it better? who knows!!
double get_wall_time()
{
    struct timeval time;
    if (gettimeofday(&time,NULL)){
        return 0;
    }
    return (double)time.tv_sec + (double)time.tv_usec * .000001;
}
*/

ద్విగుణ what_సమయం_is_it_now()
{
    నిర్మాణం timeval సమయం;
    ఒకవేళ (gettimeofday(&సమయం,ఖాళీ)){
        తిరిగి 0;
    }
    తిరిగి (ద్విగుణ)సమయం.tv_sec + (ద్విగుణ)సమయం.tv_usec * .000001;
}

పూర్ణాంకం *read_intlist(అక్షరం *gpu_list, పూర్ణాంకం *ngpus, పూర్ణాంకం d)
{
    పూర్ణాంకం *gpus = 0;
    ఒకవేళ(gpu_list){
        పూర్ణాంకం len = అక్షరశ్రేణి_పొడవు(gpu_list);
        *ngpus = 1;
        పూర్ణాంకం i;
        కొరకు(i = 0; i < len; ++i){
            ఒకవేళ (gpu_list[i] == ',') ++*ngpus;
        }
        gpus = సున్నా_జ్ఞాపకం_ఇవ్వు(*ngpus, పరిమాణం(పూర్ణాంకం));
        కొరకు(i = 0; i < *ngpus; ++i){
            gpus[i] = atoi(gpu_list);
            gpu_list = strchr(gpu_list, ',')+1;
        }
    } లేకపోతే {
        gpus = సున్నా_జ్ఞాపకం_ఇవ్వు(1, పరిమాణం(దశాంశం));
        *gpus = d;
        *ngpus = 1;
    }
    తిరిగి gpus;
}

పూర్ణాంకం *read_map(అక్షరం *filename)
{
    పూర్ణాంకం n = 0;
    పూర్ణాంకం *map = 0;
    అక్షరం *str;
    FILE *file = fopen(filename, "r");
    ఒకవేళ(!file) file_error(filename);
    అయితే((str=fgetl(file))){
        ++n;
        map = realloc(map, n*పరిమాణం(పూర్ణాంకం));
        map[n-1] = atoi(str);
    }
    తిరిగి map;
}

శూన్య sorta_shuffle(శూన్య *arr, size_t n, size_t కొలత, size_t sections)
{
    size_t i;
    కొరకు(i = 0; i < sections; ++i){
        size_t ప్రారంభం = n*i/sections;
        size_t చివర = n*(i+1)/sections;
        size_t అంకె = చివర-ప్రారంభం;
        shuffle(arr+(ప్రారంభం*కొలత), అంకె, కొలత);
    }
}

శూన్య shuffle(శూన్య *arr, size_t n, size_t కొలత)
{
    size_t i;
    శూన్య *swp = సున్నా_జ్ఞాపకం_ఇవ్వు(1, కొలత);
    కొరకు(i = 0; i < n-1; ++i){
        size_t j = i + rand()/(RAND_MAX / (n-i)+1);
        జ్ఞాపకం_నకలు(swp,          arr+(j*కొలత), కొలత);
        జ్ఞాపకం_నకలు(arr+(j*కొలత), arr+(i*కొలత), కొలత);
        జ్ఞాపకం_నకలు(arr+(i*కొలత), swp,          కొలత);
    }
}

పూర్ణాంకం *random_సూచీ_క్రమం(పూర్ణాంకం min, పూర్ణాంకం max)
{
    పూర్ణాంకం *inds = సున్నా_జ్ఞాపకం_ఇవ్వు(max-min, పరిమాణం(పూర్ణాంకం));
    పూర్ణాంకం i;
    కొరకు(i = min; i < max; ++i){
        inds[i] = i;
    }
    కొరకు(i = min; i < max-1; ++i){
        పూర్ణాంకం మార్పిడి = inds[i];
        పూర్ణాంకం సూచీ = i + rand()%(max-i);
        inds[i] = inds[సూచీ];
        inds[సూచీ] = మార్పిడి;
    }
    తిరిగి inds;
}

శూన్య del_arg(పూర్ణాంకం argc, అక్షరం **argv, పూర్ణాంకం సూచీ)
{
    పూర్ణాంకం i;
    కొరకు(i = సూచీ; i < argc-1; ++i) argv[i] = argv[i+1];
    argv[i] = 0;
}

పూర్ణాంకం కనుగొను_arg(పూర్ణాంకం argc, అక్షరం* argv[], అక్షరం *arg)
{
    పూర్ణాంకం i;
    కొరకు(i = 0; i < argc; ++i) {
        ఒకవేళ(!argv[i]) కొనసాగు;
        ఒకవేళ(0==strcmp(argv[i], arg)) {
            del_arg(argc, argv, i);
            తిరిగి 1;
        }
    }
    తిరిగి 0;
}

పూర్ణాంకం కనుగొను_int_arg(పూర్ణాంకం argc, అక్షరం **argv, అక్షరం *arg, పూర్ణాంకం def)
{
    పూర్ణాంకం i;
    కొరకు(i = 0; i < argc-1; ++i){
        ఒకవేళ(!argv[i]) కొనసాగు;
        ఒకవేళ(0==strcmp(argv[i], arg)){
            def = atoi(argv[i+1]);
            del_arg(argc, argv, i);
            del_arg(argc, argv, i);
            ఆపు;
        }
    }
    తిరిగి def;
}

దశాంశం కనుగొను_float_arg(పూర్ణాంకం argc, అక్షరం **argv, అక్షరం *arg, దశాంశం def)
{
    పూర్ణాంకం i;
    కొరకు(i = 0; i < argc-1; ++i){
        ఒకవేళ(!argv[i]) కొనసాగు;
        ఒకవేళ(0==strcmp(argv[i], arg)){
            def = atof(argv[i+1]);
            del_arg(argc, argv, i);
            del_arg(argc, argv, i);
            ఆపు;
        }
    }
    తిరిగి def;
}

అక్షరం *కనుగొను_char_arg(పూర్ణాంకం argc, అక్షరం **argv, అక్షరం *arg, అక్షరం *def)
{
    పూర్ణాంకం i;
    కొరకు(i = 0; i < argc-1; ++i){
        ఒకవేళ(!argv[i]) కొనసాగు;
        ఒకవేళ(0==strcmp(argv[i], arg)){
            def = argv[i+1];
            del_arg(argc, argv, i);
            del_arg(argc, argv, i);
            ఆపు;
        }
    }
    తిరిగి def;
}


అక్షరం *basecfg(అక్షరం *cfgfile)
{
    అక్షరం *c = cfgfile;
    అక్షరం *తదుపరి;
    అయితే((తదుపరి = strchr(c, '/')))
    {
        c = తదుపరి+1;
    }
    c = copy_string(c);
    తదుపరి = strchr(c, '.');
    ఒకవేళ (తదుపరి) *తదుపరి = 0;
    తిరిగి c;
}

పూర్ణాంకం alphanum_గమ్యం_int(అక్షరం c)
{
    తిరిగి (c < 58) ? c - 48 : c-87;
}
అక్షరం int_గమ్యం_alphanum(పూర్ణాంకం i)
{
    ఒకవేళ (i == 36) తిరిగి '.';
    తిరిగి (i < 10) ? i + 48 : i + 87;
}

శూన్య pm(పూర్ణాంకం M, పూర్ణాంకం N, దశాంశం *A)
{
    పూర్ణాంకం i,j;
    కొరకు(i =0 ; i < M; ++i){
        రాయి("%d ", i+1);
        కొరకు(j = 0; j < N; ++j){
            రాయి("%2.4f, ", A[i*N+j]);
        }
        రాయి("\n");
    }
    రాయి("\n");
}

శూన్య కనుగొను_replace(అక్షరం *str, అక్షరం *orig, అక్షరం *rep, అక్షరం *output)
{
    అక్షరం బఫరు[4096] = {0};
    అక్షరం *p;

    sprintf(బఫరు, "%s", str);
    ఒకవేళ(!(p = అక్షరశ్రేణి_శోధన(బఫరు, orig))){  // Is 'orig' even in 'str'?
        sprintf(output, "%s", str);
        తిరిగి;
    }

    *p = '\0';

    sprintf(output, "%s%s%s", బఫరు, rep, p+అక్షరశ్రేణి_పొడవు(orig));
}

దశాంశం sec(clock_t clocks)
{
    తిరిగి (దశాంశం)clocks/CLOCKS_PER_SEC;
}

శూన్య శిఖరం_k(దశాంశం *a, పూర్ణాంకం n, పూర్ణాంకం k, పూర్ణాంకం *సూచీ)
{
    పూర్ణాంకం i,j;
    కొరకు(j = 0; j < k; ++j) సూచీ[j] = -1;
    కొరకు(i = 0; i < n; ++i){
        పూర్ణాంకం curr = i;
        కొరకు(j = 0; j < k; ++j){
            ఒకవేళ((సూచీ[j] < 0) || a[curr] > a[సూచీ[j]]){
                పూర్ణాంకం మార్పిడి = curr;
                curr = సూచీ[j];
                సూచీ[j] = మార్పిడి;
            }
        }
    }
}

శూన్య error(స్థిరరాశి అక్షరం *s)
{
    perror(s);
    ప్రతిజ్ఞా(0);
    నిష్క్రమించు(-1);
}

గుర్తులేని అక్షరం *read_file(అక్షరం *filename)
{
    FILE *fp = fopen(filename, "rb");
    size_t కొలత;

    fseek(fp, 0, SEEK_END); 
    కొలత = ftell(fp);
    fseek(fp, 0, SEEK_SET); 

    గుర్తులేని అక్షరం *పాఠ్యం = సున్నా_జ్ఞాపకం_ఇవ్వు(కొలత+1, పరిమాణం(అక్షరం));
    fread(పాఠ్యం, 1, కొలత, fp);
    fclose(fp);
    తిరిగి పాఠ్యం;
}

శూన్య malloc_error()
{
    fprintf(stderr, "Malloc error\n");
    నిష్క్రమించు(-1);
}

శూన్య file_error(అక్షరం *s)
{
    fprintf(stderr, "Couldn't open file: %s\n", s);
    నిష్క్రమించు(0);
}

list *విభజించు_str(అక్షరం *s, అక్షరం delim)
{
    size_t i;
    size_t len = అక్షరశ్రేణి_పొడవు(s);
    list *l = make_list();
    list_చొప్పించు(l, s);
    కొరకు(i = 0; i < len; ++i){
        ఒకవేళ(s[i] == delim){
            s[i] = '\0';
            list_చొప్పించు(l, &(s[i+1]));
        }
    }
    తిరిగి l;
}

శూన్య strip(అక్షరం *s)
{
    size_t i;
    size_t len = అక్షరశ్రేణి_పొడవు(s);
    size_t స్థానభ్రంశం = 0;
    కొరకు(i = 0; i < len; ++i){
        అక్షరం c = s[i];
        ఒకవేళ(c==' '||c=='\t'||c=='\n') ++స్థానభ్రంశం;
        లేకపోతే s[i-స్థానభ్రంశం] = c;
    }
    s[len-స్థానభ్రంశం] = '\0';
}

శూన్య strip_char(అక్షరం *s, అక్షరం bad)
{
    size_t i;
    size_t len = అక్షరశ్రేణి_పొడవు(s);
    size_t స్థానభ్రంశం = 0;
    కొరకు(i = 0; i < len; ++i){
        అక్షరం c = s[i];
        ఒకవేళ(c==bad) ++స్థానభ్రంశం;
        లేకపోతే s[i-స్థానభ్రంశం] = c;
    }
    s[len-స్థానభ్రంశం] = '\0';
}

శూన్య free_ptrs(శూన్య **ptrs, పూర్ణాంకం n)
{
    పూర్ణాంకం i;
    కొరకు(i = 0; i < n; ++i) విడుదల(ptrs[i]);
    విడుదల(ptrs);
}

అక్షరం *fgetl(FILE *fp)
{
    ఒకవేళ(feof(fp)) తిరిగి 0;
    size_t కొలత = 512;
    అక్షరం *పంక్తి = జ్ఞాపకం_ఇవ్వు(కొలత*పరిమాణం(అక్షరం));
    ఒకవేళ(!fgets(పంక్తి, కొలత, fp)){
        విడుదల(పంక్తి);
        తిరిగి 0;
    }

    size_t curr = అక్షరశ్రేణి_పొడవు(పంక్తి);

    అయితే((పంక్తి[curr-1] != '\n') && !feof(fp)){
        ఒకవేళ(curr == కొలత-1){
            కొలత *= 2;
            పంక్తి = realloc(పంక్తి, కొలత*పరిమాణం(అక్షరం));
            ఒకవేళ(!పంక్తి) {
                రాయి("%ld\n", కొలత);
                malloc_error();
            }
        }
        size_t readsize = కొలత-curr;
        ఒకవేళ(readsize > గరిష్ఠ_పూర్ణాంకం) readsize = గరిష్ఠ_పూర్ణాంకం-1;
        fgets(&పంక్తి[curr], readsize, fp);
        curr = అక్షరశ్రేణి_పొడవు(పంక్తి);
    }
    ఒకవేళ(పంక్తి[curr-1] == '\n') పంక్తి[curr-1] = '\0';

    తిరిగి పంక్తి;
}

పూర్ణాంకం read_int(పూర్ణాంకం fd)
{
    పూర్ణాంకం n = 0;
    పూర్ణాంకం తదుపరి = పఠ(fd, &n, పరిమాణం(పూర్ణాంకం));
    ఒకవేళ(తదుపరి <= 0) తిరిగి -1;
    తిరిగి n;
}

శూన్య write_int(పూర్ణాంకం fd, పూర్ణాంకం n)
{
    పూర్ణాంకం తదుపరి = లిఖ(fd, &n, పరిమాణం(పూర్ణాంకం));
    ఒకవేళ(తదుపరి <= 0) error("read failed");
}

పూర్ణాంకం read_all_fail(పూర్ణాంకం fd, అక్షరం *బఫరు, size_t బైట్లు)
{
    size_t n = 0;
    అయితే(n < బైట్లు){
        పూర్ణాంకం తదుపరి = పఠ(fd, బఫరు + n, బైట్లు-n);
        ఒకవేళ(తదుపరి <= 0) తిరిగి 1;
        n += తదుపరి;
    }
    తిరిగి 0;
}

పూర్ణాంకం write_all_fail(పూర్ణాంకం fd, అక్షరం *బఫరు, size_t బైట్లు)
{
    size_t n = 0;
    అయితే(n < బైట్లు){
        size_t తదుపరి = లిఖ(fd, బఫరు + n, బైట్లు-n);
        ఒకవేళ(తదుపరి <= 0) తిరిగి 1;
        n += తదుపరి;
    }
    తిరిగి 0;
}

శూన్య read_all(పూర్ణాంకం fd, అక్షరం *బఫరు, size_t బైట్లు)
{
    size_t n = 0;
    అయితే(n < బైట్లు){
        పూర్ణాంకం తదుపరి = పఠ(fd, బఫరు + n, బైట్లు-n);
        ఒకవేళ(తదుపరి <= 0) error("read failed");
        n += తదుపరి;
    }
}

శూన్య write_all(పూర్ణాంకం fd, అక్షరం *బఫరు, size_t బైట్లు)
{
    size_t n = 0;
    అయితే(n < బైట్లు){
        size_t తదుపరి = లిఖ(fd, బఫరు + n, బైట్లు-n);
        ఒకవేళ(తదుపరి <= 0) error("write failed");
        n += తదుపరి;
    }
}


అక్షరం *copy_string(అక్షరం *s)
{
    అక్షరం *copy = జ్ఞాపకం_ఇవ్వు(అక్షరశ్రేణి_పొడవు(s)+1);
    strncpy(copy, s, అక్షరశ్రేణి_పొడవు(s)+1);
    తిరిగి copy;
}

list *parse_csv_పంక్తి(అక్షరం *పంక్తి)
{
    list *l = make_list();
    అక్షరం *c, *p;
    పూర్ణాంకం లోపల = 0;
    కొరకు(c = పంక్తి, p = పంక్తి; *c != '\0'; ++c){
        ఒకవేళ(*c == '"') లోపల = !లోపల;
        లేకపోతే ఒకవేళ(*c == ',' && !లోపల){
            *c = '\0';
            list_చొప్పించు(l, copy_string(p));
            p = c+1;
        }
    }
    list_చొప్పించు(l, copy_string(p));
    తిరిగి l;
}

పూర్ణాంకం లెక్క_fields(అక్షరం *పంక్తి)
{
    పూర్ణాంకం లెక్క = 0;
    పూర్ణాంకం పూర్తి = 0;
    అక్షరం *c;
    కొరకు(c = పంక్తి; !పూర్తి; ++c){
        పూర్తి = (*c == '\0');
        ఒకవేళ(*c == ',' || పూర్తి) ++లెక్క;
    }
    తిరిగి లెక్క;
}

దశాంశం *parse_fields(అక్షరం *పంక్తి, పూర్ణాంకం n)
{
    దశాంశం *క్షేత్రం = సున్నా_జ్ఞాపకం_ఇవ్వు(n, పరిమాణం(దశాంశం));
    అక్షరం *c, *p, *చివర;
    పూర్ణాంకం లెక్క = 0;
    పూర్ణాంకం పూర్తి = 0;
    కొరకు(c = పంక్తి, p = పంక్తి; !పూర్తి; ++c){
        పూర్తి = (*c == '\0');
        ఒకవేళ(*c == ',' || పూర్తి){
            *c = '\0';
            క్షేత్రం[లెక్క] = strtod(p, &చివర);
            ఒకవేళ(p == c) క్షేత్రం[లెక్క] = nan("");
            ఒకవేళ(చివర != c && (చివర != c-1 || *చివర != '\r')) క్షేత్రం[లెక్క] = nan(""); //DOS file formats!
            p = c+1;
            ++లెక్క;
        }
    }
    తిరిగి క్షేత్రం;
}

దశాంశం కూడిక_array(దశాంశం *a, పూర్ణాంకం n)
{
    పూర్ణాంకం i;
    దశాంశం కూడిక = 0;
    కొరకు(i = 0; i < n; ++i) కూడిక += a[i];
    తిరిగి కూడిక;
}

దశాంశం సగటు_array(దశాంశం *a, పూర్ణాంకం n)
{
    తిరిగి కూడిక_array(a,n)/n;
}

శూన్య సగటు_arrays(దశాంశం **a, పూర్ణాంకం n, పూర్ణాంకం els, దశాంశం *avg)
{
    పూర్ణాంకం i;
    పూర్ణాంకం j;
    memset(avg, 0, els*పరిమాణం(దశాంశం));
    కొరకు(j = 0; j < n; ++j){
        కొరకు(i = 0; i < els; ++i){
            avg[i] += a[j][i];
        }
    }
    కొరకు(i = 0; i < els; ++i){
        avg[i] /= n;
    }
}

శూన్య print_statistics(దశాంశం *a, పూర్ణాంకం n)
{
    దశాంశం m = సగటు_array(a, n);
    దశాంశం v = variance_array(a, n);
    రాయి("MSE: %.6f, Mean: %.6f, Variance: %.6f\n", mse_array(a, n), m, v);
}

దశాంశం variance_array(దశాంశం *a, పూర్ణాంకం n)
{
    పూర్ణాంకం i;
    దశాంశం కూడిక = 0;
    దశాంశం సగటు = సగటు_array(a, n);
    కొరకు(i = 0; i < n; ++i) కూడిక += (a[i] - సగటు)*(a[i]-సగటు);
    దశాంశం variance = కూడిక/n;
    తిరిగి variance;
}

పూర్ణాంకం constrain_int(పూర్ణాంకం a, పూర్ణాంకం min, పూర్ణాంకం max)
{
    ఒకవేళ (a < min) తిరిగి min;
    ఒకవేళ (a > max) తిరిగి max;
    తిరిగి a;
}

దశాంశం constrain(దశాంశం min, దశాంశం max, దశాంశం a)
{
    ఒకవేళ (a < min) తిరిగి min;
    ఒకవేళ (a > max) తిరిగి max;
    తిరిగి a;
}

దశాంశం dist_array(దశాంశం *a, దశాంశం *b, పూర్ణాంకం n, పూర్ణాంకం sub)
{
    పూర్ణాంకం i;
    దశాంశం కూడిక = 0;
    కొరకు(i = 0; i < n; i += sub) కూడిక += ఘాతం(a[i]-b[i], 2);
    తిరిగి వర్గమూలం(కూడిక);
}

దశాంశం mse_array(దశాంశం *a, పూర్ణాంకం n)
{
    పూర్ణాంకం i;
    దశాంశం కూడిక = 0;
    కొరకు(i = 0; i < n; ++i) కూడిక += a[i]*a[i];
    తిరిగి వర్గమూలం(కూడిక/n);
}

శూన్య normalize_array(దశాంశం *a, పూర్ణాంకం n)
{
    పూర్ణాంకం i;
    దశాంశం mu = సగటు_array(a,n);
    దశాంశం sigma = వర్గమూలం(variance_array(a,n));
    కొరకు(i = 0; i < n; ++i){
        a[i] = (a[i] - mu)/sigma;
    }
    mu = సగటు_array(a,n);
    sigma = వర్గమూలం(variance_array(a,n));
}

శూన్య translate_array(దశాంశం *a, పూర్ణాంకం n, దశాంశం s)
{
    పూర్ణాంకం i;
    కొరకు(i = 0; i < n; ++i){
        a[i] += s;
    }
}

దశాంశం mag_array(దశాంశం *a, పూర్ణాంకం n)
{
    పూర్ణాంకం i;
    దశాంశం కూడిక = 0;
    కొరకు(i = 0; i < n; ++i){
        కూడిక += a[i]*a[i];   
    }
    తిరిగి వర్గమూలం(కూడిక);
}

శూన్య scale_array(దశాంశం *a, పూర్ణాంకం n, దశాంశం s)
{
    పూర్ణాంకం i;
    కొరకు(i = 0; i < n; ++i){
        a[i] *= s;
    }
}

పూర్ణాంకం sample_array(దశాంశం *a, పూర్ణాంకం n)
{
    దశాంశం కూడిక = కూడిక_array(a, n);
    scale_array(a, n, 1./కూడిక);
    దశాంశం r = rand_ఏకరీతి(0, 1);
    పూర్ణాంకం i;
    కొరకు(i = 0; i < n; ++i){
        r = r - a[i];
        ఒకవేళ (r <= 0) తిరిగి i;
    }
    తిరిగి n-1;
}

పూర్ణాంకం max_int_సూచీ(పూర్ణాంకం *a, పూర్ణాంకం n)
{
    ఒకవేళ(n <= 0) తిరిగి -1;
    పూర్ణాంకం i, max_i = 0;
    పూర్ణాంకం max = a[0];
    కొరకు(i = 1; i < n; ++i){
        ఒకవేళ(a[i] > max){
            max = a[i];
            max_i = i;
        }
    }
    తిరిగి max_i;
}

పూర్ణాంకం max_సూచీ(దశాంశం *a, పూర్ణాంకం n)
{
    ఒకవేళ(n <= 0) తిరిగి -1;
    పూర్ణాంకం i, max_i = 0;
    దశాంశం max = a[0];
    కొరకు(i = 1; i < n; ++i){
        ఒకవేళ(a[i] > max){
            max = a[i];
            max_i = i;
        }
    }
    తిరిగి max_i;
}

పూర్ణాంకం int_సూచీ(పూర్ణాంకం *a, పూర్ణాంకం val, పూర్ణాంకం n)
{
    పూర్ణాంకం i;
    కొరకు(i = 0; i < n; ++i){
        ఒకవేళ(a[i] == val) తిరిగి i;
    }
    తిరిగి -1;
}

పూర్ణాంకం rand_int(పూర్ణాంకం min, పూర్ణాంకం max)
{
    ఒకవేళ (max < min){
        పూర్ణాంకం s = min;
        min = max;
        max = s;
    }
    పూర్ణాంకం r = (rand()%(max - min + 1)) + min;
    తిరిగి r;
}

// From http://en.wikipedia.org/wiki/Box%E2%80%93Muller_transform
దశాంశం rand_సాధారణ()
{
    స్థిర పూర్ణాంకం have_అదనపు = 0;
    స్థిర ద్విగుణ rand1, rand2;

    ఒకవేళ(have_అదనపు)
    {
        have_అదనపు = 0;
        తిరిగి వర్గమూలం(rand1) * జ్యా(rand2);
    }

    have_అదనపు = 1;

    rand1 = rand() / ((ద్విగుణ) RAND_MAX);
    ఒకవేళ(rand1 < 1e-100) rand1 = 1e-100;
    rand1 = -2 * సంవర్గమానం(rand1);
    rand2 = (rand() / ((ద్విగుణ) RAND_MAX)) * TWO_PI;

    తిరిగి వర్గమూలం(rand1) * కోజ్యా(rand2);
}

/*
   float rand_normal()
   {
   int n = 12;
   int i;
   float sum= 0;
   for(i = 0; i < n; ++i) sum += (float)rand()/RAND_MAX;
   return sum-n/2.;
   }
 */

size_t rand_కొలత_t()
{
    తిరిగి  ((size_t)(rand()&0xff) << 56) | 
        ((size_t)(rand()&0xff) << 48) |
        ((size_t)(rand()&0xff) << 40) |
        ((size_t)(rand()&0xff) << 32) |
        ((size_t)(rand()&0xff) << 24) |
        ((size_t)(rand()&0xff) << 16) |
        ((size_t)(rand()&0xff) << 8) |
        ((size_t)(rand()&0xff) << 0);
}

దశాంశం rand_ఏకరీతి(దశాంశం min, దశాంశం max)
{
    ఒకవేళ(max < min){
        దశాంశం మార్పిడి = min;
        min = max;
        max = మార్పిడి;
    }
    తిరిగి ((దశాంశం)rand()/RAND_MAX * (max - min)) + min;
}

దశాంశం rand_scale(దశాంశం s)
{
    దశాంశం scale = rand_ఏకరీతి(1, s);
    ఒకవేళ(rand()%2) తిరిగి scale;
    తిరిగి 1./scale;
}

దశాంశం **one_hot_encode(దశాంశం *a, పూర్ణాంకం n, పూర్ణాంకం k)
{
    పూర్ణాంకం i;
    దశాంశం **t = సున్నా_జ్ఞాపకం_ఇవ్వు(n, పరిమాణం(దశాంశం*));
    కొరకు(i = 0; i < n; ++i){
        t[i] = సున్నా_జ్ఞాపకం_ఇవ్వు(k, పరిమాణం(దశాంశం));
        పూర్ణాంకం సూచీ = (పూర్ణాంకం)a[i];
        t[i][సూచీ] = 1;
    }
    తిరిగి t;
}

